kyckyckyc/DGM/src/gd32g5x3_init.c
/*
    \file  gd32g5x3_init.c
*/
/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/
#include "gd32g5x3.h"
#include "system_gd32g5x3.h"
#include "gd32g5x3_init.h"
#include "main.h"
#include "encoder.h"
/* user code [global 0] begin */
// #define SPI_TX_OFF()                                                                                \
// 	do {                                                                                          \
// 		gpio_init(SPI0_MOSI_PORT, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, SPI0_MOSI_PIN); \
// 	} while(0);
// #define SPI_TX_ON()                                                                             \
// 	do {                                                                                      \
// 		gpio_init(SPI0_MOSI_PORT, SPI0_MOSI_FUNC, GPIO_OSPEED_50MHZ, SPI0_MOSI_PIN); \
// 	} while(0);

// #define SPI_CS_ENABLE()	 gpio_bit_reset(U1_SPI0_NSS_PORT, U1_SPI0_NSS_PIN) 
// #define SPI_CS_DISABLE() gpio_bit_set(U1_SPI0_NSS_PORT, U1_SPI0_NSS_PIN)  









/* user code [global 0] end */

/* External includes*/
/* user code [External Includes] begin */

/* user code [External Includes] end */

/* Private Type Definitions */
/* user code [Private Type Definitions] begin */

/* user code [Private Type Definitions] end */

/* Private Macros */
/* user code [Private Macros] begin */

/* user code [Private Macros] end */

/* Private Constants */
/* user code [Private Constants] begin */

/* user code [Private Constants] end */

/* Private Variables */
/* user code [Private Variables] begin */

/* user code [Private Variables] end */

/* Private Function Declaration */
/* user code [Private Function Declaration] begin */
 
extern can_mailbox_descriptor_struct transmit_message;
extern can_mailbox_descriptor_struct receive_message;

/* user code [Private Function Declaration] end */

/* Extern Variables */
/* user code [Extern Variables] begin */

/* user code [Extern Variables] end */

/*!
    \brief      SYSTEM initialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
// uint16_t spi_rw_half_word(uint32_t spi_periph, const uint16_t i_HalfWord)
// {
//     uint32_t to;
//     uint16_t data = 0xFFFF;
//     bool ok = true;

//     // Send data
//     to = 200;
//     while ((RESET == spi_flag_get(spi_periph, SPI_FLAG_TBE)) && --to);
//     if (to == 0) ok = false;

//     if (ok) {
//         if(RESET == spi_flag_get(spi_periph, SPI_FLAG_RBNE)) {
//             (void)spi_data_receive(spi_periph); /* throw Dummy */
//         }
        
//         spi_data_transmit(spi_periph, i_HalfWord);

//         /* wait rx succ*/
//         to = 200;
//         while ((RESET == spi_flag_get(spi_periph, SPI_FLAG_RBNE)) && --to);
//         if (to == 0) ok = false;
//         else data = spi_data_receive(spi_periph); /* throw Dummy wait bsu idle */

//         if (ok) {
//             to = 200;
//             while ((SET == spi_flag_get(spi_periph, SPI_FLAG_TRANS)) 
//                    && SET == spi_flag_get(spi_periph, SPI_FLAG_RBNE) && --to);
//             if (to == 0) ok = false;
//         }
//     }

//     return ok ? data : 0xFFFF;
// }
 






void msd_system_init(void)
{
    /* user code [system_init local 0] begin */

    /* user code [system_init local 0] end */

    rcu_periph_clock_enable(RCU_SYSCFG);
    nvic_priority_group_set(NVIC_PRIGROUP_PRE4_SUB0);
    systick_clksource_set(SYSTICK_CLKSOURCE_HCLK);
    nvic_irq_enable(MemoryManagement_IRQn, 0, 0);
    nvic_irq_enable(BusFault_IRQn, 0, 0);
    nvic_irq_enable(UsageFault_IRQn, 0, 0);
    nvic_irq_enable(SVCall_IRQn, 0, 0);
    nvic_irq_enable(DebugMonitor_IRQn, 0, 0);
    nvic_irq_enable(PendSV_IRQn, 0, 0);

    /* user code [system_init local 1] begin */

    /* user code [system_init local 1] end */
}

/*!
    \brief      CLOCK initialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
// #if defined(__SYSTEM_CLOCK_216M_PLL_HXTAL) 

void msd_clock_init(void)
{
    /* user code [clock_init local 0] begin */

    /* user code [clock_init local 0] end */

    rcu_osci_on(RCU_HXTAL);
    while (rcu_osci_stab_wait(RCU_HXTAL) != SUCCESS);

    rcu_pll_source_config(RCU_PLLSRC_HXTAL);
    rcu_pll_config((1U), (54U), (2U), (2U), (2U));
    rcu_pll_clock_output_enable(RCU_PLLP);
    rcu_pll_clock_output_enable(RCU_PLLR);
    fmc_wscnt_set(FMC_WAIT_STATE_7);
    rcu_system_clock_source_config(RCU_CKSYSSRC_PLLP);
    rcu_osci_on(RCU_PLL_CK);
    while (rcu_osci_stab_wait(RCU_PLL_CK) != SUCCESS);

    rcu_ahb_clock_config(RCU_AHB_CKSYS_DIV1);
    rcu_apb1_clock_config(RCU_APB1_CKAHB_DIV1);
    rcu_apb2_clock_config(RCU_APB2_CKAHB_DIV1);
    rcu_apb3_clock_config(RCU_APB3_CKAHB_DIV1);

    rcu_can_clock_config(IDX_CAN0, RCU_CANSRC_APB2);
    rcu_adc_clock_config(IDX_ADC0, RCU_ADCSRC_PLLR);
    rcu_adc_clock_config(IDX_ADC1, RCU_ADCSRC_PLLR);
    rcu_usart_clock_config(IDX_USART0, RCU_USARTSRC_APB);
    rcu_usart_clock_config(IDX_USART2, RCU_USARTSRC_APB);

