kyckyckyc/DGM/src/gd32g5x3_init.c
    rcu_osci_bypass_mode_disable(RCU_HXTAL);
    rcu_osci_bypass_mode_disable(RCU_LXTAL);
    rcu_hxtal_clock_monitor_disable();
    rcu_lxtal_clock_monitor_disable();

    /* update SystemCoreClock value */
    SystemCoreClockUpdate();

    /* setup systick timer for 1000Hz interrupts */
    if (SysTick_Config(SystemCoreClock / 1000U))
    {
        /* capture error */
        while (1);
    }

    /* user code [clock_init local 1] begin */

    /* user code [clock_init local 1] end */
}

//#elif defined(__SYSTEM_CLOCK_216M_PLL_IRC8M)

// void msd_clock_init(void)
// {


//     rcu_osci_on(RCU_IRC8M);
//     while (rcu_osci_stab_wait(RCU_IRC8M) != SUCCESS);
//     rcu_irc8m_adjust_value_set(16U);

//     rcu_pll_source_config(RCU_PLLSRC_IRC8M);
//     rcu_pll_config((2U), (108U), (2U), (2U), (2U));
//     rcu_pll_clock_output_enable(RCU_PLLP);
//     fmc_wscnt_set(FMC_WAIT_STATE_7);
//     rcu_system_clock_source_config(RCU_CKSYSSRC_PLLP);
//     rcu_osci_on(RCU_PLL_CK);
//     while (rcu_osci_stab_wait(RCU_PLL_CK) != SUCCESS);

//     rcu_ahb_clock_config(RCU_AHB_CKSYS_DIV1);
//     rcu_apb1_clock_config(RCU_APB1_CKAHB_DIV1);
//     rcu_apb2_clock_config(RCU_APB2_CKAHB_DIV1);
//     rcu_apb3_clock_config(RCU_APB3_CKAHB_DIV1);
//     rcu_osci_bypass_mode_disable(RCU_HXTAL);
//     rcu_osci_bypass_mode_disable(RCU_LXTAL);
//     rcu_hxtal_clock_monitor_disable();
//     rcu_lxtal_clock_monitor_disable();
 
//     SystemCoreClockUpdate();


//     if (SysTick_Config(SystemCoreClock / 1000U))
//     {

//     while (1);
//     }

// }

//#endif


/*!
    \brief      GPIO initialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void msd_gpio_init(void)
{
//    /* user code [gpio_init local 0] begin */

//    /* user code [gpio_init local 0] end */

//    rcu_periph_clock_enable(RCU_GPIOD);
//    rcu_periph_clock_enable(RCU_GPIOC);
//    rcu_periph_clock_enable(RCU_GPIOB);
//    rcu_periph_clock_enable(RCU_GPIOA);
//    gpio_af_set(GPIOC, GPIO_AF_1, GPIO_PIN_6);
//    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_6);
//    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_6);
//    gpio_input_filter_set(GPIOC, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_6);

//    gpio_bit_set(GPIOB, GPIO_PIN_2);
//    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_2);
//    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_2);

//    gpio_af_set(GPIOA, GPIO_AF_2, GPIO_PIN_6);
//    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_6);
//    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_6);
//    gpio_input_filter_set(GPIOA, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_6);

//    gpio_af_set(GPIOC, GPIO_AF_2, GPIO_PIN_8);
//    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_8);
//    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_8);
//    gpio_input_filter_set(GPIOC, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_8);

//    gpio_mode_set(GPIOC, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_7);
//    syscfg_exti_line_config(EXTI_SOURCE_GPIOC, EXTI_SOURCE_PIN7);
//    exti_init(EXTI_7, EXTI_INTERRUPT, EXTI_TRIG_RISING);
//    exti_interrupt_flag_clear(EXTI_7);

//    gpio_af_set(GPIOA, GPIO_AF_6, GPIO_PIN_8);
//    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_8);
//    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_8);
//    gpio_input_filter_set(GPIOA, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_8);

//    gpio_af_set(GPIOA, GPIO_AF_2, GPIO_PIN_7);
//    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_7);
//    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_7);
//    gpio_input_filter_set(GPIOA, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_7);

//    gpio_af_set(GPIOC, GPIO_AF_2, GPIO_PIN_9);
//    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_9);
//    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_9);
//    gpio_input_filter_set(GPIOC, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_9);

//    gpio_af_set(GPIOA, GPIO_AF_6, GPIO_PIN_9);
//    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_9);
//    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_9);
//    gpio_input_filter_set(GPIOA, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_9);

//    gpio_af_set(GPIOB, GPIO_AF_6, GPIO_PIN_14);
//    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_14);
//    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_14);
//    gpio_input_filter_set(GPIOB, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_14);

//    gpio_af_set(GPIOB, GPIO_AF_6, GPIO_PIN_13);
//    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_13);
//    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_13);
//    gpio_input_filter_set(GPIOB, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_13);

//    gpio_af_set(GPIOB, GPIO_AF_4, GPIO_PIN_15);
//    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_15);
//    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_15);
//    gpio_input_filter_set(GPIOB, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_15);

//    gpio_af_set(GPIOA, GPIO_AF_6, GPIO_PIN_10);
//    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_10);
//    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_10);
//    gpio_input_filter_set(GPIOA, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_10);

//    gpio_bit_reset(GPIOC, GPIO_PIN_0);
//    gpio_mode_set(GPIOC, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_0);
//    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_0);

//    gpio_bit_reset(GPIOC, GPIO_PIN_2);
//    gpio_mode_set(GPIOC, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_2);
//    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_2);

//    gpio_bit_set(GPIOB, GPIO_PIN_1);
//    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_1);
//    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_1);

