kyckyckyc/DGM/src/gd32g5x3_init.c
    gpio_mode_set(GPIOA, GPIO_MODE_ANALOG, GPIO_PUPD_NONE, GPIO_PIN_3);

    gpio_mode_set(GPIOA, GPIO_MODE_ANALOG, GPIO_PUPD_NONE, GPIO_PIN_0);


   /* reset ADC */
    adc_deinit(ADC0);
    /* ADC clock config */
    adc_clock_config(ADC0, ADC_CLK_SYNC_HCLK_DIV12);
    /* ADC contineous function enable */
    adc_special_function_config(ADC0, ADC_CONTINUOUS_MODE, DISABLE);
    /* ADC scan mode enable */
    adc_special_function_config(ADC0, ADC_SCAN_MODE, ENABLE);
    /* ADC resolution config */
    adc_resolution_config(ADC0, ADC_RESOLUTION_12B);
    /* ADC data alignment config */
    adc_data_alignment_config(ADC0, ADC_DATAALIGN_RIGHT);

    /* ADC channel length config */
    adc_channel_length_config(ADC0, ADC_INSERTED_CHANNEL, 4);

    adc_inserted_channel_config(ADC0, 0, ADC_CHANNEL_0, 6);//Ia
    adc_inserted_channel_config(ADC0, 1, ADC_CHANNEL_1, 6);//Ib
    adc_inserted_channel_config(ADC0, 2, ADC_CHANNEL_2, 6);//Ic
    adc_inserted_channel_config(ADC0, 3, ADC_CHANNEL_3, 6);//vbus
//     trigsel_init(TRIGSEL_OUTPUT_ADC0_INSTRG, TRIGSEL_INPUT_TIMER0_CH3);
 
    /* ADC trigger config */
    adc_external_trigger_config(ADC0, ADC_INSERTED_CHANNEL, EXTERNAL_TRIGGER_RISING);
    /* clear the ADC flag */
    adc_interrupt_flag_clear(ADC0, ADC_INT_FLAG_EOC);
    adc_interrupt_flag_clear(ADC0, ADC_INT_FLAG_EOIC);
    /* enable ADC interrupt */
    adc_interrupt_enable(ADC0, ADC_INT_EOIC);

    /* enable ADC interface */
    adc_enable(ADC0);
    /* wait for ADC stability */
     delay_ms(1);
    /* ADC calibration mode config */
    adc_calibration_mode_config(ADC0, ADC_CALIBRATION_OFFSET_MISMATCH);
    /* ADC calibration number config */
    adc_calibration_number(ADC0, ADC_CALIBRATION_NUM1);
    /* ADC calibration and reset calibration */
    adc_calibration_enable(ADC0);

}

/*!
    \brief      ADC0 deinitialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void msd_adc0_deinit(void)
{
    /* user code [adc0_deinit local 0] begin */

    /* user code [adc0_deinit local 0] end */

    rcu_periph_clock_disable(RCU_ADC0);

    adc_deinit(ADC0);

    /* user code [adc0_deinit local 1] begin */

    /* user code [adc0_deinit local 1] end */
}

/*!
    \brief      ADC1 initialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void msd_adc1_init(void)
{
    /* user code [adc1_init local 0] begin */

    /* user code [adc1_init local 0] end */

    rcu_periph_clock_enable(RCU_ADC1);
    rcu_periph_clock_enable(RCU_TRIGSEL);

    gpio_mode_set(GPIOC, GPIO_MODE_ANALOG, GPIO_PUPD_NONE, GPIO_PIN_5);


   /* reset ADC */
    adc_deinit(ADC1);
    /* ADC clock config */
    adc_clock_config(ADC1, ADC_CLK_SYNC_HCLK_DIV12);
    /* ADC contineous function enable */
    adc_special_function_config(ADC1, ADC_CONTINUOUS_MODE, DISABLE);
    /* ADC scan mode enable */
    adc_special_function_config(ADC1, ADC_SCAN_MODE, ENABLE);
    /* ADC resolution config */
    adc_resolution_config(ADC1, ADC_RESOLUTION_12B);
    /* ADC data alignment config */
    adc_data_alignment_config(ADC1, ADC_DATAALIGN_RIGHT);

    /* ADC channel length config */
    adc_channel_length_config(ADC1, ADC_INSERTED_CHANNEL, 1);

     adc_inserted_channel_config(ADC1, 0, ADC_CHANNEL_10, 6);//mos temp
 
     trigsel_init(TRIGSEL_OUTPUT_ADC1_INSTRG, TRIGSEL_INPUT_TIMER0_CH3);
 
    /* ADC trigger config */
    adc_external_trigger_config(ADC1, ADC_INSERTED_CHANNEL, EXTERNAL_TRIGGER_RISING);
    /* clear the ADC flag */
    adc_interrupt_flag_clear(ADC1, ADC_INT_FLAG_EOC);
    adc_interrupt_flag_clear(ADC1, ADC_INT_FLAG_EOIC);
    /* enable ADC interrupt */
//     adc_interrupt_enable(ADC1, ADC_INT_EOIC);

    /* enable ADC interface */
    adc_enable(ADC1);
    /* wait for ADC stability */
     delay_ms(1);
    /* ADC calibration mode config */
    adc_calibration_mode_config(ADC1, ADC_CALIBRATION_OFFSET_MISMATCH);
    /* ADC calibration number config */
    adc_calibration_number(ADC1, ADC_CALIBRATION_NUM1);
    /* ADC calibration and reset calibration */
    adc_calibration_enable(ADC1);

    /* user code [adc1_init local 1] begin */

    /* user code [adc1_init local 1] end */
}

/*!
    \brief      ADC1 deinitialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void msd_adc1_deinit(void)
{
    /* user code [adc1_deinit local 0] begin */

    /* user code [adc1_deinit local 0] end */

    rcu_periph_clock_disable(RCU_ADC1);

    adc_deinit(ADC1);

    /* user code [adc1_deinit local 1] begin */

    /* user code [adc1_deinit local 1] end */
}

 
/*!
    \brief      CAN0 deinitialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void msd_can0_deinit(void)
{
    /* user code [can0_deinit local 0] begin */

    /* user code [can0_deinit local 0] end */

    rcu_periph_clock_disable(RCU_CAN0);

    can_deinit(CAN0);

    /* user code [can0_deinit local 1] begin */

    /* user code [can0_deinit local 1] end */
}

/*!
    \brief      SPI2 initialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
    spi_parameter_struct spi0_parameter;


void msd_spi0_init(void)
{
    /* user code [spi2_init local 0] begin */

    /* user code [spi2_init local 0] end */


    rcu_periph_clock_enable(RCU_SPI0);

//    gpio_af_set(GPIOB, GPIO_AF_6, GPIO_PIN_3);
//    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_3);
//    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_3);
//    gpio_input_filter_set(GPIOB, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_3);

//    gpio_af_set(GPIOB, GPIO_AF_6, GPIO_PIN_5);
//    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_5);
//    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_5);
//    gpio_input_filter_set(GPIOB, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_5);

//    gpio_af_set(GPIOB, GPIO_AF_6, GPIO_PIN_4);
//    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_4);
//    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_4);
//    gpio_input_filter_set(GPIOB, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_4);

