kyckyckyc/DGM/src/gd32g5x3_init.c
    spi_struct_para_init(&spi0_parameter);

    spi0_parameter.device_mode = SPI_MASTER;
    spi0_parameter.nss = SPI_NSS_SOFT;
    spi0_parameter.endian = SPI_ENDIAN_MSB;

    #if defined(TLE5012B)
    spi0_parameter.clock_polarity_phase = SPI_CK_PL_LOW_PH_2EDGE;//
    spi0_parameter.trans_mode = SPI_TRANSMODE_FULLDUPLEX;
    spi0_parameter.prescale = SPI_PSC_64;
    spi0_parameter.frame_size = SPI_FRAMESIZE_16BIT;
    
    #elif defined(KTH71)
    spi0_parameter.clock_polarity_phase = SPI_CK_PL_HIGH_PH_2EDGE;//
    spi0_parameter.trans_mode = SPI_TRANSMODE_FULLDUPLEX;
    spi0_parameter.prescale = SPI_PSC_8;
    spi0_parameter.frame_size = SPI_FRAMESIZE_8BIT;

    #endif
    spi_init(SPI0, &spi0_parameter);


    // spi_nss_output_enable(SPI0);
    // spi_nssp_mode_enable(SPI0);

//    spi_fifo_access_size_config(SPI0, SPI_HALFWORD_ACCESS);

    spi_enable(SPI0);


 

    /* user code [spi2_init local 1] begin */

    /* user code [spi2_init local 1] end */
}





/**
  * @brief Send or read half word through SPI
  * @param[in] spi_periph: SPI peripheral
  * @param[in] i_HalfWord: data to send
  * @return received data
  */
 


/*!
    \brief      SPI2 deinitialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void msd_spi2_deinit(void)
{
    /* user code [spi2_deinit local 0] begin */

    /* user code [spi2_deinit local 0] end */

    rcu_periph_clock_disable(RCU_SPI2);

    spi_deinit(SPI2);

    /* user code [spi2_deinit local 1] begin */

    /* user code [spi2_deinit local 1] end */
}

/*!
    \brief      TIMER0 initialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void msd_timer0_init(void)
{
    /* user code [timer0_init local 0] begin */

    /* user code [timer0_init local 0] end */

    timer_parameter_struct timer0_parameter;

    rcu_periph_clock_enable(RCU_TIMER0);

    timer_struct_para_init(&timer0_parameter);

    timer_adjustment_mode_config(TIMER0, DISABLE);
    timer_auto_reload_shadow_enable(TIMER0);
    timer_counter_initial_register_config(TIMER0, DISABLE);
    timer_upif_backup_config(TIMER0, DISABLE);
    timer_master_slave_mode_config(TIMER0, TIMER_MASTER_SLAVE_MODE_DISABLE);
    timer_master_output0_trigger_source_select(TIMER0, TIMER_TRI_OUT0_SRC_O3CPRE);
    timer_master_output1_trigger_source_select(TIMER0, TIMER_TRI_OUT1_SRC_UPDATE);
    timer0_parameter.prescaler = 0;
    timer0_parameter.alignedmode = TIMER_COUNTER_CENTER_BOTH;
    timer0_parameter.period = 5399;
    timer0_parameter.repetitioncounter = 0x00000000;
    timer0_parameter.clockdivision = TIMER_CKDIV_DIV1;
    timer_init(TIMER0, &timer0_parameter);

    timer_internal_clock_config(TIMER0);

    nvic_irq_enable(TIMER0_BRK_IRQn, 0, 0);
    nvic_irq_enable(TIMER0_UP_IRQn, 0, 0);

    /* user code [timer0_init local 1] begin */

    /* user code [timer0_init local 1] end */
}

/*!
    \brief      TIMER0 deinitialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void msd_timer0_deinit(void)
{
    /* user code [timer0_deinit local 0] begin */

    /* user code [timer0_deinit local 0] end */

    rcu_periph_clock_disable(RCU_TIMER0);

    timer_deinit(TIMER0);

    /* user code [timer0_deinit local 1] begin */

    /* user code [timer0_deinit local 1] end */
}

/*!
    \brief      UART3 initialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void msd_uart3_init(void)
{
    /* user code [uart3_init local 0] begin */

    /* user code [uart3_init local 0] end */

    rcu_periph_clock_enable(RCU_UART3);

    gpio_af_set(GPIOC, GPIO_AF_5, GPIO_PIN_11);
    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_11);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_85MHZ, GPIO_PIN_11);
    gpio_input_filter_set(GPIOC, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_11);

    gpio_af_set(GPIOC, GPIO_AF_5, GPIO_PIN_10);
    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_10);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_85MHZ, GPIO_PIN_10);
    gpio_input_filter_set(GPIOC, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_10);

    usart_baudrate_set(UART3, 115200);
    usart_word_length_set(UART3, USART_WL_8BIT);
    usart_parity_config(UART3, USART_PM_NONE);
    usart_stop_bit_set(UART3, USART_STB_1BIT);
    usart_receive_config(UART3, USART_RECEIVE_ENABLE);
    usart_transmit_config(UART3, USART_TRANSMIT_ENABLE);
    usart_oversample_config(UART3, USART_OVSMOD_16);
    usart_sample_bit_config(UART3, USART_OSB_3BIT);
    usart_fifo_disable(UART3);
    usart_overrun_disable(UART3);
    usart_reception_error_dma_disable(UART3);
    usart_data_first_config(UART3, USART_MSBF_LSB);
    usart_invert_config(UART3, USART_TXPIN_DISABLE);
    usart_invert_config(UART3, USART_RXPIN_DISABLE);
    usart_invert_config(UART3, USART_DINV_DISABLE);
    usart_invert_config(UART3, USART_SWAP_DISABLE);
    usart_enable(UART3);

    /* user code [uart3_init local 1] begin */

    /* user code [uart3_init local 1] end */
}

/*!
    \brief      UART3 deinitialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void msd_uart3_deinit(void)
{
    /* user code [uart3_deinit local 0] begin */

    /* user code [uart3_deinit local 0] end */

    rcu_periph_clock_disable(RCU_UART3);

    usart_deinit(UART3);

    /* user code [uart3_deinit local 1] begin */

    /* user code [uart3_deinit local 1] end */
}

/*!
    \brief      UART4 initialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void msd_uart4_init(void)
{
    /* user code [uart4_init local 0] begin */

    /* user code [uart4_init local 0] end */

    rcu_periph_clock_enable(RCU_UART4);

    gpio_af_set(GPIOC, GPIO_AF_5, GPIO_PIN_12);
    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_12);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_85MHZ, GPIO_PIN_12);
    gpio_input_filter_set(GPIOC, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_12);

