kyckyckyc/DGM/src/gd32g5x3_init.c
    gpio_af_set(GPIOD, GPIO_AF_5, GPIO_PIN_2);
    gpio_mode_set(GPIOD, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_2);
    gpio_output_options_set(GPIOD, GPIO_OTYPE_PP, GPIO_OSPEED_85MHZ, GPIO_PIN_2);
    gpio_input_filter_set(GPIOD, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_2);

    usart_baudrate_set(UART4, 115200);
    usart_word_length_set(UART4, USART_WL_8BIT);
    usart_parity_config(UART4, USART_PM_NONE);
    usart_stop_bit_set(UART4, USART_STB_1BIT);
    usart_receive_config(UART4, USART_RECEIVE_ENABLE);
    usart_transmit_config(UART4, USART_TRANSMIT_ENABLE);
    usart_oversample_config(UART4, USART_OVSMOD_16);
    usart_sample_bit_config(UART4, USART_OSB_3BIT);
    usart_fifo_disable(UART4);
    usart_overrun_disable(UART4);
    usart_reception_error_dma_disable(UART4);
    usart_data_first_config(UART4, USART_MSBF_LSB);
    usart_invert_config(UART4, USART_TXPIN_DISABLE);
    usart_invert_config(UART4, USART_RXPIN_DISABLE);
    usart_invert_config(UART4, USART_DINV_DISABLE);
    usart_invert_config(UART4, USART_SWAP_DISABLE);
    usart_enable(UART4);

    /* user code [uart4_init local 1] begin */

    /* user code [uart4_init local 1] end */
}

/*!
    \brief      UART4 deinitialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void msd_uart4_deinit(void)
{
    /* user code [uart4_deinit local 0] begin */

    /* user code [uart4_deinit local 0] end */

    rcu_periph_clock_disable(RCU_UART4);

    usart_deinit(UART4);

    /* user code [uart4_deinit local 1] begin */

    /* user code [uart4_deinit local 1] end */
}

/*!
    \brief      USART0 initialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void msd_usart0_init(void)
{
    /* user code [usart0_init local 0] begin */

    /* user code [usart0_init local 0] end */

    rcu_periph_clock_enable(RCU_USART0);

    gpio_af_set(GPIOB, GPIO_AF_7, GPIO_PIN_7);
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_7);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_85MHZ, GPIO_PIN_7);
    gpio_input_filter_set(GPIOB, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_7);

    gpio_af_set(GPIOB, GPIO_AF_7, GPIO_PIN_6);
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_6);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_85MHZ, GPIO_PIN_6);
    gpio_input_filter_set(GPIOB, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_6);

    usart_baudrate_set(USART0, 115200);
    usart_word_length_set(USART0, USART_WL_8BIT);
    usart_parity_config(USART0, USART_PM_NONE);
    usart_stop_bit_set(USART0, USART_STB_1BIT);
    usart_receive_config(USART0, USART_RECEIVE_ENABLE);
    usart_transmit_config(USART0, USART_TRANSMIT_ENABLE);
    usart_receiver_timeout_disable(USART0);
    usart_oversample_config(USART0, USART_OVSMOD_16);
    usart_sample_bit_config(USART0, USART_OSB_3BIT);
    usart_fifo_disable(USART0);
    usart_overrun_disable(USART0);
    usart_reception_error_dma_disable(USART0);
    usart_data_first_config(USART0, USART_MSBF_LSB);
    usart_invert_config(USART0, USART_TXPIN_DISABLE);
    usart_invert_config(USART0, USART_RXPIN_DISABLE);
    usart_invert_config(USART0, USART_DINV_DISABLE);
    usart_invert_config(USART0, USART_SWAP_DISABLE);
    usart_enable(USART0);

    /* user code [usart0_init local 1] begin */

    /* user code [usart0_init local 1] end */
}

/*!
    \brief      USART0 deinitialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void msd_usart0_deinit(void)
{
    /* user code [usart0_deinit local 0] begin */

    /* user code [usart0_deinit local 0] end */

    rcu_periph_clock_disable(RCU_USART0);

    usart_deinit(USART0);

    /* user code [usart0_deinit local 1] begin */

    /* user code [usart0_deinit local 1] end */
}

/*!
    \brief      USART2 initialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void msd_usart2_init(void)
{
    /* user code [usart2_init local 0] begin */

    /* user code [usart2_init local 0] end */

    rcu_periph_clock_enable(RCU_USART2);

    gpio_af_set(GPIOB, GPIO_AF_7, GPIO_PIN_9);
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_9);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_85MHZ, GPIO_PIN_9);
    gpio_input_filter_set(GPIOB, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_9);

    gpio_af_set(GPIOB, GPIO_AF_7, GPIO_PIN_11);
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_11);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_85MHZ, GPIO_PIN_11);
    gpio_input_filter_set(GPIOB, GPIO_ISPERIOD(0), GPIO_IFTYPE_ASYNC, GPIO_PIN_11);

    usart_baudrate_set(USART2, 115200);
    usart_word_length_set(USART2, USART_WL_8BIT);
    usart_parity_config(USART2, USART_PM_NONE);
    usart_stop_bit_set(USART2, USART_STB_1BIT);
    usart_receive_config(USART2, USART_RECEIVE_ENABLE);
    usart_transmit_config(USART2, USART_TRANSMIT_ENABLE);
    usart_receiver_timeout_disable(USART2);
    usart_oversample_config(USART2, USART_OVSMOD_16);
    usart_sample_bit_config(USART2, USART_OSB_3BIT);
    usart_fifo_disable(USART2);
    usart_overrun_disable(USART2);
    usart_reception_error_dma_disable(USART2);
    usart_data_first_config(USART2, USART_MSBF_LSB);
    usart_invert_config(USART2, USART_TXPIN_DISABLE);
    usart_invert_config(USART2, USART_RXPIN_DISABLE);
    usart_invert_config(USART2, USART_DINV_DISABLE);
    usart_invert_config(USART2, USART_SWAP_DISABLE);
    usart_enable(USART2);

    /* user code [usart2_init local 1] begin */

    /* user code [usart2_init local 1] end */
}

/*!
    \brief      USART2 deinitialization function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void msd_usart2_deinit(void)
{
    /* user code [usart2_deinit local 0] begin */

    /* user code [usart2_deinit local 0] end */

    rcu_periph_clock_disable(RCU_USART2);

    usart_deinit(USART2);

    /* user code [usart2_deinit local 1] begin */

    /* user code [usart2_deinit local 1] end */
}

