kyckyckyc/DGM/src/gd32g5x3_init.c
  void NVIC_init(void)
{
    nvic_priority_group_set(NVIC_PRIGROUP_PRE4_SUB0);

    // ADC01 insert convert complete interrupt NVIC
    NVIC_SetPriority(ADC0_1_IRQn, 0);
    NVIC_EnableIRQ(ADC0_1_IRQn);

    // TIM1 interrupt NVIC
    NVIC_SetPriority(TIMER1_IRQn, 1);
    NVIC_EnableIRQ(TIMER1_IRQn);


    // CAN0 Rx interrupt NVIC
    NVIC_SetPriority(CAN0_Message_IRQn, 2);
    NVIC_EnableIRQ(CAN0_Message_IRQn);

    NVIC_SetPriority(CAN2_Message_IRQn, 2);
    NVIC_EnableIRQ(CAN2_Message_IRQn);

}




void WATCH_DOG_init(void)
{


    /* enable IRC32K */
    rcu_osci_on(RCU_IRC32K);
    
    /* wait till IRC32K is ready */
    while(SUCCESS != rcu_osci_stab_wait(RCU_IRC32K)){
    }
    
    /* configure FWDGT counter clock: 32KHz(IRC32K) / 64 = 0.5 KHz */
    fwdgt_config(2*500, FWDGT_PSC_DIV64);
    
    /* after 2 seconds to generate a reset */
//    fwdgt_enable();


}

 void msd_can0_init(void)
{
     /* user code [can0_init local 0] begin */

    /* user code [can0_init local 0] end */

    /* enable CAN port clock */
    rcu_periph_clock_enable(RCU_GPIOA);

    /* configure CAN0_TX GPIO */
    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_12);
    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_12);
    gpio_af_set(GPIOA, GPIO_AF_9, GPIO_PIN_12);

    /* configure CAN0_RX GPIO */
    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_11);
    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_11);
    gpio_af_set(GPIOA, GPIO_AF_9, GPIO_PIN_11);

    can_parameter_struct can_parameter;
    can_fd_parameter_struct fd_parameter;

    /* select CK_APB2 as CAN's clock source */
    rcu_can_clock_config(IDX_CAN0, RCU_CANSRC_APB2);
    /* enable CAN clock */
    rcu_periph_clock_enable(RCU_CAN0);
    /* initialize CAN register */
    can_deinit(CAN0);
    /* initialize CAN */
    can_struct_para_init(CAN_INIT_STRUCT, &can_parameter);
    can_struct_para_init(CAN_FD_INIT_STRUCT, &fd_parameter);

    /* initialize CAN parameters */
    can_parameter.internal_counter_source = CAN_TIMER_SOURCE_BIT_CLOCK;
    can_parameter.self_reception = DISABLE;
    can_parameter.mb_tx_order = CAN_TX_HIGH_PRIORITY_MB_FIRST;
    can_parameter.mb_tx_abort_enable = ENABLE;
    can_parameter.local_priority_enable = DISABLE;
    can_parameter.mb_rx_ide_rtr_type = CAN_IDE_RTR_FILTERED;
    can_parameter.mb_remote_frame = CAN_STORE_REMOTE_REQUEST_FRAME;
    can_parameter.rx_private_filter_queue_enable = DISABLE;
    can_parameter.edge_filter_enable = DISABLE;
    can_parameter.protocol_exception_enable = DISABLE;
    can_parameter.rx_filter_order = CAN_RX_FILTER_ORDER_MAILBOX_FIRST;
    can_parameter.memory_size = CAN_MEMSIZE_32_UNIT;
    /* filter configuration */
    can_parameter.mb_public_filter = 0U;
    /* baud rate 1Mbps */
    can_parameter.resync_jump_width = 1U;
    can_parameter.prop_time_segment = 2U;
    can_parameter.time_segment_1 = 4U;
    can_parameter.time_segment_2 = 1U;
    can_parameter.prescaler = 27U;

    /* initialize CAN */
    can_init(CAN0, &can_parameter);

    /* FD parameter configurations */
    fd_parameter.bitrate_switch_enable = ENABLE;
    fd_parameter.iso_can_fd_enable = ENABLE;
    fd_parameter.mailbox_data_size = CAN_MAILBOX_DATA_SIZE_64_BYTES;
    fd_parameter.tdc_enable = DISABLE;
    fd_parameter.tdc_offset = 0U;
    /* FD baud rate 1Mbps */
    fd_parameter.resync_jump_width = 1U;
    fd_parameter.prop_time_segment = 2U;
    fd_parameter.time_segment_1 = 4U;
    fd_parameter.time_segment_2 = 1U;
    fd_parameter.prescaler = 27U;

    can_fd_config(CAN0, &fd_parameter);

    /* configure CAN0 NVIC */
    nvic_irq_enable(CAN0_Message_IRQn, 0U, 0U);

    /* enable CAN MB0 interrupt */
    can_interrupt_enable(CAN0, CAN_INT_MB0);

    can_operation_mode_enter(CAN0, CAN_NORMAL_MODE);

    receive_message.rtr = 0U;
    receive_message.ide = 0U;
    receive_message.code = CAN_MB_RX_STATUS_EMPTY;
    /* rx mailbox */
    receive_message.id = 0x55U;
    can_mailbox_config(CAN0, 0U, &receive_message);
 
}

void msd_can2_init(void)
{
    /* user code [can0_init local 0] begin */

    /* user code [can0_init local 0] end */

    rcu_periph_clock_enable(RCU_GPIOB);

    /* configure CAN0_TX GPIO */
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_4);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_4);
    gpio_af_set(GPIOB, GPIO_AF_11, GPIO_PIN_4);

    /* configure CAN0_RX GPIO */
	gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_3);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_3);
    gpio_af_set(GPIOB, GPIO_AF_11, GPIO_PIN_3);
   
	can_parameter_struct can2_parameter;
    //can_fd_parameter_struct fd2_parameter;

    /* select CK_APB2 as CAN's clock source */
    rcu_can_clock_config(IDX_CAN2, RCU_CANSRC_APB2);
    /* enable CAN clock */
    rcu_periph_clock_enable(RCU_CAN2);
    /* initialize CAN register */
    can_deinit(CAN2);
    /* initialize CAN */
    can_struct_para_init(CAN_INIT_STRUCT, &can2_parameter);
    //can_struct_para_init(CAN_FD_INIT_STRUCT, &fd2_parameter);

    /* initialize CAN parameters */
    can2_parameter.internal_counter_source = CAN_TIMER_SOURCE_BIT_CLOCK;
    can2_parameter.self_reception = DISABLE;
    can2_parameter.mb_tx_order = CAN_TX_HIGH_PRIORITY_MB_FIRST;
    can2_parameter.mb_tx_abort_enable = ENABLE;
    can2_parameter.local_priority_enable = DISABLE;
    can2_parameter.mb_rx_ide_rtr_type = CAN_IDE_RTR_FILTERED;
    can2_parameter.mb_remote_frame = CAN_STORE_REMOTE_REQUEST_FRAME;
    can2_parameter.rx_private_filter_queue_enable = DISABLE;
    can2_parameter.edge_filter_enable = DISABLE;
    can2_parameter.protocol_exception_enable = DISABLE;
    can2_parameter.rx_filter_order = CAN_RX_FILTER_ORDER_MAILBOX_FIRST;
    can2_parameter.memory_size = CAN_MEMSIZE_32_UNIT;
    /* filter configuration */
    can2_parameter.mb_public_filter = 0U;
    /* baud rate 1Mbps */
    can2_parameter.resync_jump_width = 1U;
    can2_parameter.prop_time_segment = 2U;
    can2_parameter.time_segment_1 = 4U;
    can2_parameter.time_segment_2 = 1U;
    can2_parameter.prescaler = 54U;

    /* initialize CAN */
    can_init(CAN2, &can2_parameter);

    /* configure CAN0 NVIC */
    nvic_irq_enable(CAN2_Message_IRQn, 0U, 0U);

