kyckyckyc/DGM/src/gd32g5x3_init.c
    /* enable CAN MB0 interrupt */
    can_interrupt_enable(CAN2, CAN_INT_MB2);

    can_operation_mode_enter(CAN2, CAN_NORMAL_MODE);

    can2receive_message.rtr = 0U;
    can2receive_message.ide = 0U;
    can2receive_message.code = CAN_MB_RX_STATUS_EMPTY;
    /* rx mailbox */
    can2receive_message.id = 0x01U;
    can_mailbox_config(CAN2, 2U, &can2receive_message);
}

void msd_can2_fifo_init(void)
{
    /* user code [can0_init local 0] begin */

    /* user code [can0_init local 0] end */

    rcu_periph_clock_enable(RCU_GPIOB);

    /* configure CAN0_TX GPIO */
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_4);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_4);
    gpio_af_set(GPIOB, GPIO_AF_11, GPIO_PIN_4);

    /* configure CAN0_RX GPIO */
	gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_3);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_3);
    gpio_af_set(GPIOB, GPIO_AF_11, GPIO_PIN_3);
   
	can_parameter_struct can2_parameter;
    can_fifo_parameter_struct fifo_parameter;  
    //can_fd_parameter_struct fd2_parameter;

    /* select CK_APB2 as CAN's clock source */
    rcu_can_clock_config(IDX_CAN2, RCU_CANSRC_APB2);
    /* enable CAN clock */
    rcu_periph_clock_enable(RCU_CAN2);
    /* initialize CAN register */
    can_deinit(CAN2);
    /* initialize CAN */
    can_struct_para_init(CAN_INIT_STRUCT, &can2_parameter);
    can_struct_para_init(CAN_FIFO_INIT_STRUCT, &fifo_parameter);
    //can_struct_para_init(CAN_FD_INIT_STRUCT, &fd2_parameter);

    /* initialize CAN parameters */
    can2_parameter.internal_counter_source = CAN_TIMER_SOURCE_BIT_CLOCK;
    can2_parameter.self_reception = DISABLE;
    can2_parameter.mb_tx_order = CAN_TX_HIGH_PRIORITY_MB_FIRST;
    can2_parameter.mb_tx_abort_enable = ENABLE;
    can2_parameter.local_priority_enable = DISABLE;
    can2_parameter.mb_rx_ide_rtr_type = CAN_IDE_RTR_FILTERED;
    can2_parameter.mb_remote_frame = CAN_STORE_REMOTE_REQUEST_FRAME;
    can2_parameter.rx_private_filter_queue_enable = DISABLE;
    can2_parameter.edge_filter_enable = DISABLE;
    can2_parameter.protocol_exception_enable = DISABLE;
    can2_parameter.rx_filter_order = CAN_RX_FILTER_ORDER_FIFO_FIRST;  // 闂傚倸鍊搁崐鎼佸磹閹间礁纾归柟闂寸绾惧綊鏌熼梻瀵割槮缁炬儳缍婇弻鐔兼⒒鐎靛壊妲紒鐐劤濠€閬嶅焵椤掑倹鍤€閻庢凹鍙冨畷宕囧鐎ｃ劋姹楅梺鍦劋閸ㄥ綊宕愰悙鐑樺仭婵犲﹤鍠氬Ο鈧悗娈垮枟閹倸顕ｆ禒瀣垫晣闁绘柨鎼獮鎰版⒒娴ｈ鍋犻柛搴灦瀹曟洟鏌嗗鍡椻偓鍫曟煃閸濆嫬鏆熺痪鎯с偢閺岀喖鏌囬敃鈧鐐箾閸喓鐭掗柡灞糕偓宕囨殕闁逞屽墴瀹曚即寮介鐐电暫閻熸粍鏌ㄩ悾閿嬬附閸涘﹤浜滈梺鍛婄箓鐎氼剙鈻撻妷鈺傗拻闁稿本鐟чˇ锕傛煙鐠囇呯瘈鐎规洖婀遍幉鎾礋椤掆偓瀵潡姊洪崷顓℃闁哥姵鐗犻幃鈥愁潨閳ь剟寮婚悢鍛婄秶濡わ絽鍟宥夋⒑缁嬫鍎愰柛鏃€鐟╅獮鍐ㄎ旈崨顓熷祶濡炪倖鎸鹃崐顐﹀鎺虫禍婊堟煏婢舵稑顩紒鐘愁焽缁辨帗娼忛妸锕€闉嶉梺鐟板槻閹虫ê鐣烽锕€绀嬬痪鐗埫禍鍓р偓鍏夊亾闁告洦鍓涢崢閬嶆⒑闂堟胆褰掑磿閹惰棄鏄ラ柨婵嗘礌閸嬫挸鈻撻崹顔界亶濠碘€冲级鐢ゆ闂佸憡鐟ラˇ顓熺濠婂嫨浜滈柟鏉垮閹偐绱掗悩闈涗沪闁靛洤瀚版慨鈧柍钘夋閻や線姊虹化鏇熸澒闁稿鎸搁—鍐Χ閸℃鐟ㄩ柣搴㈠嚬閸撶喖骞冮悙鍝勫瀭妞ゆ劗濮崇花濠氭⒑閸︻厼鍔嬮柛銊ф暬閸┾偓妞ゆ帒鍊归崵鈧梺瀹狀嚙缁夌懓顕ｉ幘顔藉亹闁汇垻顣槐鍙変繆閻愵亜鈧牕螞娓氣偓瀹曟垿骞囬鐔哥彿濠电偞鍨跺銊у閼测晝纾藉ù锝堫嚃閻掔晫绱掗悩闈涗粶闁宠鍨块、娆撴偂鎼存ê浜鹃柤鎰佸灣閻斿懘姊虹拠鎻掝劉濞撴碍顨婂畷鎴炵節閸屻倖缍庢繝鐢靛У閼瑰墽澹曢崗鍏煎弿婵妫楅崢鎾煕鐎ｎ偅宕屾鐐寸墬閹峰懘宕妷顖滀覆闂佽娴烽幊鎾垛偓姘煎弮瀹曞磭澹曠€ｃ劋姹楅梺鍦劋閸ㄥ綊宕愰悙鐑樺仭婵犲﹤鍠氬Ο鈧悗娈垮枟閹倸顕ｆ禒瀣垫晣闁绘柨鎼獮鎰版⒒娴ｈ鍋犻柛搴灦瀹曟洟鏌嗗鍡椻偓鍫曟煃閸濆嫬鏆熺痪鎯с偢閺岀喖鏌囬敃鈧鐐箾閸喓鐭掗柡灞糕偓宕囨殕闁逞屽墴瀹曚即寮介鐐电暫閻熸粍鏌ㄩ悾閿嬬附閸涘﹤浜滈梺鍛婄箓鐎氼剙鈻撻妷鈺傗拻闁稿本鐟чˇ锕傛煙鐠囇呯瘈鐎规洖婀遍幉鎾礋椤掆偓瀵潡姊洪崷顓℃闁哥姵鐗犻幃鈥愁潨閳ь剟寮婚悢鍛婄秶濡わ絽鍟宥夋⒑缁嬫鍎愰柛鏃€鐟╅獮鍐ㄎ旈崨顓熷祶濡炪倖鎸鹃崐顐﹀鎺虫禍婊堟煏婢舵稑顩紒鐘愁焽缁辨帗娼忛妸锕€闉嶉梺鐟板槻閹虫ê鐣烽锕€绀嬬痪鐗埫禍鍓р偓鍏夊亾闁告洦鍓涢崢閬嶆⒑闂堟胆褰掑磿閹惰棄鏄ラ柨婵嗘礌閸嬫挸鈻撻崹顔界亪濡炪値鍘鹃崗妯侯嚕椤愶箑绠涙い鎾跺仧缁愮偞绻濋悽闈浶㈤悗姘卞厴瀹曘儵宕ㄧ€涙ǚ鎷绘繛杈剧悼閹虫捇顢氬⿰鍛＜閻犲洦褰冮埀顒€娼￠悰顔藉緞婵炵偓顫嶉梺闈涚箳婵兘顢欓幒鏃傜＝闁稿本鐟ч崝宥嗐亜椤撶偞鍠樼€规洏鍨介獮鏍ㄦ媴閸忓瀚奸梻浣告啞缁嬫垿鏁冮敐鍥偨闂侇剙绉甸悡鏇㈡煟濡澧繛鍫熺矌閳ь剝顫夊ú姗€宕濆▎鎾跺祦闁搞儺鍓氶崑瀣煕椤愮姴鐏╂鐐村姍閺岋絾鎯旈垾鍐茶緟闂佺ǹ顑嗛幑鍥箖濡ゅ懏鏅查幖绮光偓鎰佹骄闂備椒绱粻鎴︽偋閹捐绠栨俊銈呭暞閸犲棝鏌涢弴銊ュ妞わ负鍔戦弻锝夊閳轰胶浠柣銏╁灣閸犳牠骞冨鈧獮鎺懳旀担鍝勫箺闂備胶绮崝鏇㈩敋椤撱垹鐓濋柟鍓х帛閻撳啰鎲稿⿰鍫濈婵炲棙鎸搁崒銊╂煛瀹ュ啫濡块柣婵嗙埣閺岋繝宕堕妷銉т痪闂佹娊鏀遍崹鍧楀蓟濞戞ǚ鏀介柛鈩冾殢娴尖偓闂備礁鐤囬褔藝閻㈢ǹ钃熸繛鎴炲焹閸嬫捇鏁嶉崡鐐叉殨濠㈣娲熷濠氬磼濞嗘帒鍘￠柡瀣典簼閵囧嫰骞嬪┑鍥舵＆濡ょ姷鍋為崝娆撶嵁閺嶃劎鐟瑰┑鐘插閳笺倖绻濋悽闈涒枅婵炰匠鍥舵晞闁糕剝绋戠壕褰掓⒑閸噮鍎嶅ù婊勭矒閺岀喖宕崟顒夋婵炲瓨绮嶉崕鎶解€旈崘顔嘉ч柛娑橆嚟瀹曨亪姊洪悷鏉挎闁瑰嚖鎷�
    can2_parameter.memory_size = CAN_MEMSIZE_32_UNIT;
    /* filter configuration */
    can2_parameter.mb_public_filter = 0U;
    /* baud rate 1Mbps */
    can2_parameter.resync_jump_width = 1U;
    can2_parameter.prop_time_segment = 2U;
    can2_parameter.time_segment_1 = 4U;
    can2_parameter.time_segment_2 = 1U;
    can2_parameter.prescaler = 54U;

    /* initialize CAN */
    can_init(CAN2, &can2_parameter);

    fifo_parameter.dma_enable = DISABLE;
    fifo_parameter.filter_format_and_number = CAN_RXFIFO_FILTER_A_NUM_8;  // 8闂傚倸鍊搁崐鎼佸磹閹间礁纾归柟闂寸绾惧綊鏌熼梻瀵割槮缁炬儳缍婇弻鐔兼⒒鐎靛壊妲紒鐐劤濠€閬嶅焵椤掑倹鍤€閻庢凹鍙冨畷宕囧鐎ｃ劋姹楅梺鍦劋閸ㄥ綊宕愰悙鐑樺仭婵犲﹤鍠氬Ο鈧悗娈垮枟閹倸顕ｆ禒瀣垫晣闁绘柨鎼獮鎰版⒒娴ｈ鍋犻柛搴灦瀹曟洟鏌嗗鍡椻偓鍫曟煃閸濆嫬鏆熺痪鎯с偢閺岀喖鏌囬敃鈧鐐箾閸喓鐭掗柡灞糕偓宕囨殕闁逞屽墴瀹曚即寮介鐐电暫閻熸粍鏌ㄩ悾閿嬬附閸涘﹤浜滈梺鍛婄箓鐎氼剙鈻撻妷鈺傗拻闁稿本鐟чˇ锕傛煙鐠囇呯瘈鐎规洖婀遍幉鎾礋椤掆偓瀵潡姊洪崷顓℃闁哥姵鐗犻幃鈥愁潨閳ь剟寮婚悢鍛婄秶濡わ絽鍟宥夋⒑缁嬫鍎愰柛鏃€鐟╅獮鍐ㄎ旈崨顓熷祶濡炪倖鎸鹃崐顐﹀鎺虫禍婊堟煏婢舵稑顩紒鐘愁焽缁辨帗娼忛妸锕€闉嶉梺鐟板槻閹虫ê鐣烽锕€绀嬬痪鐗埫禍鍓р偓鍏夊亾闁告洦鍓涢崢閬嶆⒑闂堟胆褰掑磿閹惰棄鏄ラ柨婵嗘礌閸嬫挸鈻撻崹顔界亪濡炪値鍘鹃崗妯侯嚕椤愶箑绠涙い鎾跺仧缁愮偞绻濋悽闈浶㈤悗姘卞厴瀹曘儵宕ㄧ€涙ǚ鎷绘繛杈剧悼閹虫捇顢氬⿰鍛＜閻犲洦褰冮埀顒€娼￠悰顔藉緞婵炵偓顫嶉梺闈涚箳婵兘顢欓幒鏃傜＝闁稿本鐟ч崝宥嗐亜椤撶偞鍠樼€规洏鍨介獮鏍ㄦ媴閸忓瀚奸梻浣告啞缁嬫垿鏁冮敐鍥偨闂侇剙绉甸悡鏇㈡煟濡澧繛鍫熺矌閳ь剝顫夊ú姗€宕濆▎鎾跺祦闁搞儺鍓氶崑瀣煕椤愮姴鐏╂鐐村姍閺岋絾鎯旈垾鍐茶緟闂佺ǹ顑嗛幑鍥箖濡ゅ懏鏅查幖绮光偓鎰佹骄闂備椒绱粻鎴︽偋閹捐绠栨俊銈呭暞閸犲棝鏌涢弴銊ュ妞わ负鍔戦弻锝夊閳轰胶浠柣銏╁灣閸犳牠骞冨鈧獮鎺懳旀担鍝勫箺闂備胶绮崝鏇㈩敋椤撱垹鐓濋柟鍓х帛閻撳啰鎲稿⿰鍫濈婵炲棙鎸搁崒銊╂煛瀹ュ啫濡块柣婵嗙埣閺岋繝宕堕妷銉т痪闂佹娊鏀遍崹鍧楀蓟濞戞ǚ鏀介柛鈩冾殢娴尖偓闂備礁鐤囬褔藝閻㈢ǹ钃熸繛鎴炲焹閸嬫捇鏁嶉崡鐐叉殨濠㈣娲熷濠氬磼濞嗘帒鍘￠柡瀣典簼閵囧嫰骞嬪┑鍥舵＆濡ょ姷鍋為崝娆撶嵁閺嶃劎鐟瑰┑鐘插閳笺倖绻濋悽闈涒枅婵炰匠鍥舵晞闁圭増婢橀弸渚€鏌涢埄鍐姇闁绘挻娲熼幃姗€鎮欓幓鎺嗘寖闂佽桨鐒﹂悧鐘诲蓟閺囩喓绠鹃柣鎰靛墯閻濇洟姊洪幎鑺ユ暠闁搞劌娼″璇测槈濡攱鏂€闂佺硶鍓濋〃蹇斿閸屾凹娓婚柕鍫濋娴滃墽绱掗悩铏磳鐎殿喛顕ч埥澶愬閻樼數娼夐梻渚€鈧偛鑻晶瀵糕偓瑙勬礀缂嶅﹤鐣风粙璇炬棃宕橀妸褋鍋婇梻鍌欑閹诧繝宕濋敃鍌氱獥闁哄稁鍙忕紞鏍煕濞戞鎽犻柣鎾崇箻閺屾盯顢曢敐鍥╃暫闂侀潻绲藉﹢杈╂閹烘绠涙い鎾跺Л婵洨绱撴担铏瑰笡缂佽鐗撻獮鍐╃鐎ｎ偒妫冨┑鐐殿棎缂堜即宕规禒瀣畺婵°倐鍋撴い顐ｇ箞濮婅崵鈧潧鎲￠弲鍏肩節绾版ǚ鍋撻崘鑼獓闂佸憡姊归悷銉╊敋閿濆绠绘い鏃傗拡濞煎﹪姊洪幎鑺ユ殰闁稿鎹囬弻鐔割槹鎼达絽绗＄紓浣虹帛缁嬫帒顭囪箛娑樼鐟滃秹宕哄畝鍕拺缁绢厼鎳庤缂備緡鍠栧ù鐑藉礆閹烘绫嶉柛顐ゅ枎閳ь剛绮穱濠囶敍閻愬瓨鐝崇紓浣靛妼椤嘲顫忓ú顏咁棃婵炴垼椴搁鍡涙⒒閸屾艾顏╅悗姘煎墴閹儳鐣￠幍顔芥畷闂侀€炲苯澧撮柛鈹惧亾濡炪倖甯掗崰姘焽閹邦厾绠鹃柛娆忣檧閼板潡鏌曢崱妤€鏆ｇ€规洏鍔嶅蹇涘礈瑜忛埣銈嗙節閻㈤潧孝闁挎洏鍊濋幃褔宕卞☉娆忊偓鍧楁煕椤垵浜栧ù婊勭矒閺岀喖宕崟顒夋婵炲瓨绮嶉崕鎶解€旈崘顔嘉ч柛鈩冾焽閳规稓绱撻崒姘毙＄紒鑸靛哺婵″瓨绗熼埀顒€顕ｉ幘顔碱潊闁斥晛鍟悵鏍⒒娓氣偓閳ь剛鍋涢懟顖涙櫠閹殿喚纾兼い鏂垮⒔鐢稓绱掔紒妯肩畵妞ゎ偅绻堥、姗€鎮欓弶鍨嚙闂傚倸鍊烽悞锕傚箖閸洖纾挎繝濠傜墕缁€鍐┿亜韫囨挾澧㈢€规洘绮岄埞鎴︽晬閸曨偂鏉梺绋匡攻閸ㄥ灝鐣烽弴銏″殤妞ゆ帊绀佹惔濠囨⒑閸撴彃浜濈紒璇茬Т椤洭寮介妸褏顔曢悗鐟板閸犳洜鑺遍崗绗轰簻闁靛鍎虫晶娑氱磼缂佹娲存鐐差儔閹瑧鎹勬笟顖涱棨濠碉紕鍋戦崐褏寰婃禒瀣妞ゆ劧绠戦悡姗€鏌熸潏鍓х暠闁绘搫绻濋弻娑㈠焺閸愶缚娌紓浣靛妿閸樠団€旈崘顔嘉ч柛鎰╁妼椤牓姊洪幐搴㈠濞存粠浜濇穱濠勨偓娑欘焽閻熷綊鏌嶈閸撴瑩顢氶敐澶樻晪闁逞屽墮閻ｉ攱绺介崨濠備簻闂佸憡绋戦オ瀛樼瑜斿濠氬磼濞嗘劗銈板┑鐐差槹濞茬喎鐣烽幎鑺ユ櫇闁稿本姘ㄩ鍡涙⒑鐠恒劌娅愰柟鍑ゆ嫹
    fifo_parameter.fifo_public_filter = 0x00000000U;

    can_rx_fifo_config(CAN2, &fifo_parameter);
    can_rx_fifo_id_filter_struct id_filter_table[8];

