kyckyckyc/DGM/src/gd32g5x3_init.c
    for(uint8_t i = 0; i < 8; i++) 
    {
        id_filter_table[i].remote_frame = CAN_DATA_FRAME_ACCEPTED;    // 闂傚倸鍊搁崐鎼佸磹閹间礁纾归柟闂寸绾惧綊鏌熼梻瀵割槮缁惧墽鎳撻—鍐偓锝庝簼閹癸綁鏌ｉ鐐搭棞闁靛棙甯掗～婵嬫晲閸涱剙顥氬┑掳鍊楁慨鐑藉磻濞戔懞鍥偨缁嬫寧鐎梺鐟板⒔缁垶宕戦幇鐗堢厱闁归偊鍨扮槐锕傛煟閵忋垻甯涘ǎ鍥э躬閹瑩顢旈崟銊ヤ壕闁哄稁鍘介崑瀣繆閵堝懎鏆熼柣顓熺懇閺岀喖鎮欓鍌涜弴闂侀€炲苯澧柟铏悾鐑芥晲閸℃绐為梺鍓插亝缁酣鎯勬惔銊︹拻濠电姴楠告禍婊勭箾鐠囇呯暤妤犵偞鍔欓幃娆擃敆娴ｅ湱褰块梻浣告惈濞层垽宕瑰ú顏呭亗婵炴垯鍨洪崐鐢告煥濠靛棗鈧懓鈻嶉崶鈺冪＜闁归偊鍘介ˉ鍫ユ煛鐏炵硶鍋撳畷鍥ㄦ畷闂侀€炲苯澧寸€规洑鍗冲浠嬵敇閻樿尙銈﹂梻浣侯攰閹活亞绮婚幋鐘典笉婵炴垯鍨洪埛鎺楁煕椤愩倕鏋旈柍顖涙礃閵囧嫰寮崹顕呬痪缂備胶绮换鍕窗婵犲伣鐔访虹紒妯肩Ч闂傚倷鑳舵灙妞ゆ垵鎳橀獮濠傤潨閳ь剙顕ｉ锕€绀冩い鏃傗拡濞煎﹪姊洪棃娑氬闁硅櫕鎹囬獮妤呭即閵忊檧鎷洪梺鍛婄箓鐎氼參宕掗妸鈺傜厱闁靛ǹ鍎崇粔娲煛鐏炵瓔鍎旂€规洖鐖兼俊姝岊槾闁伙箑鐗撳濠氬磼濮樺崬顤€缂備礁顑嗙敮鐐靛垝婵犲洤鐓涢柛灞剧懅缁犳艾顪冮妶鍡楀闁稿﹥娲樼粋鎺戔堪閸曗晙绨诲銈呯箰鐎氼剟寮抽敐鍛斀闁炽儱纾崺锝団偓瑙勬磸閸旀垿銆佸☉妯峰牚閹肩补鍓濋弳顏堟⒒閸屾艾鈧兘鎳楅崜浣稿灊妞ゆ牜鍋為崑瀣節婵犲倻澧曢柛灞诲妿閹叉悂寮崼鐔告珳闂佺粯鍔曟晶搴ㄦ偪閳ь剙鈹戦悙鏉戠仸闁荤噦绠撳畷鏇㈩敂閸喓鍘介梺缁樻煥閹芥粓骞婇崘顔藉€垫慨妯煎帶婢ф澘顭跨憴鍕妞ゃ垺鐩幃娆戝垝鐟欏嫬顏归梻鍌氬€搁崐鎼佹偋婵犲洦鍤勯柛鈩冨搸娴滃綊鏌熼悜妯虹仼闁挎稓鍠栧娲传閸曨噮娼堕梺绋垮閻撯€崇暦閹扮増顥堟繛纾嬫珪濡啴寮幇鏉垮窛妞ゆ挾鍠愰澶愭⒒娴ｇ懓鈻曢柡鈧柆宥呭瀭闁秆勵殔閽冪喐绻涢幋鐐冩岸寮ㄦ禒瀣厱闁斥晛鍠氬▓銏犆归悡搴ｇ劯婵﹨娅ｇ划娆撳锤濡ゅň鍋撳Δ鍐＜缂備焦锚閻忔潙鈹戦敍鍕毈鐎规洜鍠栭、娑㈡晲閸℃ɑ鐝濋梻鍌欒兌缁垵鎽悷婊勬緲閸熸挳鎮伴閿亾閿濆骸鏋熼柍閿嬪灩缁辨挻鎷呮慨鎴ｅ亹濞嗐垽鏌嗗鍡欏幈闂佺粯锚绾绢參濡撮幒鏃傜＜妞ゆ梹顑欓崵娆撴煃閽樺妲搁摶锝夋⒑閸噮鍎涙繛鍏兼⒐缁绘繈鎮介棃娑楃捕濠碘槅鍋呴〃鍫ュ箲閵忋倕骞㈡繛鎴烆焽閿涙盯姊虹憴鍕姢妞ゆ洦鍘惧褔鍩€椤掆偓閳规垿顢欓弬銈勭返闂佸憡锕㈢粻鏍х暦閵徛板亝闁告劏鏂侀幏娲煟閻樺弶绀岄柍褜鍓欓崯璺ㄧ不濞差亝鐓熼柕蹇婃櫅閻忥繝鎮介妞诲亾瀹曞洦娈惧┑鐘绘涧濡矂宕奸鍫熺厱闁哄洢鍔岄獮妯汇亜閺冣偓濞茬喎顫忓ú顏勫窛濠电姳鑳剁换渚€姊虹粙娆惧剰閻庢矮鍗抽獮鍐潨閳ь剙鐣烽敐鍡楃窞閻庯綆浜滄导搴♀攽閻樺灚鏆╁┑顔芥尦瀹曨垶顢涢悙鍙傦附绻濋棃娑氬闁稿鎸鹃幉鎾礋椤掆偓椤︹晠姊虹粙娆惧剰闁挎洏鍊濋幃楣冩倻閼恒儱浜滅紒鐐妞存悂寮插┑瀣拺缂備焦蓱椤ュ棙绻涢幘璇℃綈缂佹梻鍠栧鎾閳锯偓閹锋椽姊洪崨濠冨鞍鐟滄澘鍟粋宥呪攽閸モ晝顔曢梺鍛婄懃椤﹁鲸鏅堕崡鐑嗙唵閻熸瑥瀚粈澶愭煏閸ャ劌濮嶆鐐村浮楠炴鎹勯崫鍕唶闂備浇顕ф鍝ョ不瀹ュ纾块弶鍫厛濞堜粙鏌涘☉姗堝姛妞も晜鐓￠弻鐔煎箥椤旂⒈鏆梺缁樻尰濞茬喖骞冨Δ鍛櫜閹肩补鈧尙鍑归梺璇茬箰濞存岸宕㈡禒瀣﹂柛鏇ㄥ灱閺佸啴鏌ㄥ┑鍡樺窛闁汇倕瀚—鍐Χ閸愩劎浠惧銈冨妼閿曘倝鎮鹃悜钘夌闁瑰瓨姊归弫鐘绘⒑缂佹ê濮﹀ù婊勭矋閹便劑宕掑☉娆忓伎婵犵數濮撮崯顖炲Φ濠靛牃鍋撶憴鍕闁稿锕ら悾鐑芥偄绾拌鲸鏅梺鍛婁緱閸犳盯寮茶濮婂宕掑▎鎴М闂佽绁撮埀顒佸墯濞兼牜鎲搁悧鍫濈瑨闁搞劌鍊块弻娑滎槼妞ゃ劌鐗嗛悾鍨瑹閳ь剟寮诲☉銏犵疀闂傚牊绋掗悘鍫濐渻閵堝骸浜滈柟铏耿瀵寮撮姀鐘诲敹濠电娀娼уú銈呪枍閿濆洨纾藉ù锝囨嚀婵牏绱掔€ｎ偄绗ч柟骞垮灩閳规垹鈧綆鍋勬禒娲⒒閸屾氨澧涢柛鎺嗗亾闂侀潧绻堥崐鏍磹閸偅鍙忔慨妞诲亾婵☆偉娉曢懞閬嶆嚍閵夈倗绠氶梺鍛婄懃椤︻垱鎱ㄥ鍥ｅ亾濞堝灝鏋熼柟姝屾珪閹便劑鍩€椤掑嫭鐓冮梺娆惧灠娴滈箖姊鸿ぐ鎺濇缂侇噮鍨抽幑銏犫槈濞嗘劗绉堕梺鍛婃寙閸曨偂杩橀梻鍌欒兌鏋紒銊︽そ瀹曟劕鈹戦崱娆愭闂佹眹鍨绘灙闁绘帒鐏氶妵鍕箳閹存繍浠鹃梺鎶芥敱閸ㄥ潡寮婚悢鍏煎殐闁宠桨妞掔划鍫曟⒑鐠囧弶绂嬪ù婊庝邯瀵鏁愭径濠勵啋濡炪倖鐗楅〃鍛閸撗€鍋撶憴鍕婵炶绠戦埢鎾淬偅閸愨斁鎷洪梺鍛婄箓鐎氼垶锝為敃鍌涚厱閹兼番鍔嬮幉楣冩煙闁垮鐏撮柟顔哄灲瀹曟鎳栭埡浣稿婵犵數濮伴崹鐓庘枖濞戙垺鍋嬮柛鈩冪☉缁€澶愭煏閸繃顥撳ù婊勭矒閺岋繝宕掑☉姗嗗殝闂佹悶鍊曞ú锕傚箞閵婏妇绡€闁告侗鍣禒鈺呮⒑閸︻厽鍤€閻庢氨澧楁穱濠囧箹娴ｈ倽銊╂煥閺冣偓閸庡磭绱為幒妤佲拻闁稿本鐟ㄩ崗宀勬煙閾忣偅宕岀€规洜鏁诲浠嬵敇閻愭鍞甸梻浣芥硶閸ｏ箓骞忛敓锟�
        id_filter_table[i].extended_frame = CAN_STANDARD_FRAME_ACCEPTED; // 闂傚倸鍊搁崐鎼佸磹閹间礁纾归柟闂寸绾惧綊鏌熼梻瀵割槮缁惧墽鎳撻—鍐偓锝庝簼閹癸綁鏌ｉ鐐搭棞闁靛棙甯掗～婵嬫晲閸涱剙顥氬┑掳鍊楁慨鐑藉磻濞戔懞鍥偨缁嬫寧鐎梺鐟板⒔缁垶宕戦幇鐗堢厱闁归偊鍨扮槐锕傛煟閵忋垻甯涘ǎ鍥э躬閹瑩顢旈崟銊ヤ壕闁哄稁鍘介崑瀣繆閵堝懎鏆熼柣顓熺懇閺岀喖鎮欓鍌涜弴闂侀€炲苯澧柟铏悾鐑芥晲閸℃绐為梺鍓插亝缁酣鎯勬惔銊︹拻濠电姴楠告禍婊勭箾鐠囇呯暤妤犵偞鍔欓幃娆擃敆娴ｅ湱褰块梻浣告惈濞层垽宕瑰ú顏呭亗婵炴垯鍨洪崐鐢告煥濠靛棗鈧懓鈻嶉崶鈺冪＜闁归偊鍘介ˉ鍫ユ煛鐏炵硶鍋撳畷鍥ㄦ畷闂侀€炲苯澧寸€规洑鍗冲浠嬵敇閻樿尙銈﹂梻浣侯攰閹活亞绮婚幋鐘典笉婵炴垯鍨洪埛鎺楁煕椤愩倕鏋旈柍顖涙礃閵囧嫰寮崹顕呬痪缂備胶绮换鍕窗婵犲伣鐔访虹紒妯肩Ч闂傚倷鑳舵灙妞ゆ垵鎳橀獮濠傤潨閳ь剙顕ｉ锕€绀冩い鏃傗拡濞煎﹪姊洪棃娑氬闁硅櫕鎹囬獮妤呭即閵忊檧鎷洪梺鍛婄箓鐎氼參宕掗妸鈺傜厱闁靛ǹ鍎崇粔娲煛鐏炵瓔鍎旂€规洖鐖兼俊姝岊槾闁伙箑鐗撳濠氬磼濮樺崬顤€缂備礁顑嗙敮鐐靛垝婵犲洤鐓涢柛灞剧懅缁犳艾顪冮妶鍡楀闁稿﹥娲樼粋鎺戔堪閸曗晙绨诲銈呯箰鐎氼剟寮抽敐鍛斀闁炽儱纾崺锝団偓瑙勬磸閸旀垿銆佸☉妯峰牚閹肩补鍓濋弳顏堟⒒閸屾艾鈧兘鎳楅崜浣稿灊妞ゆ牜鍋為崑瀣節婵犲倻澧曢柛灞诲妿閹叉悂寮崼鐔告珳闂佺粯鍔曟晶搴ㄦ偪閳ь剙鈹戦悙鏉戠仸闁荤噦绠撳畷鏇㈩敂閸喓鍘介梺缁樻煥閹芥粓骞婇崘顔藉€垫慨妯煎帶婢ф澘顭跨憴鍕妞ゃ垺鐩幃娆戝垝鐟欏嫬顏归梻鍌氬€搁崐鎼佹偋婵犲洦鍤勯柛鈩冨搸娴滃綊鏌熼悜妯虹仼闁挎稓鍠栧娲传閸曨噮娼堕梺绋垮閻撯€崇暦閹邦喗宕夊┑鍌濇缂嶅﹪寮幇鏉块唶闁绘洑妞掗崫妤冪磽娴ｅ搫浜鹃柛搴㈠▕瀹曘儳鈧綆鍋嗛埞宥呪攽閻樺弶鎼愰崶鎾⒑閸涘﹥澶勯柛娆忛鍗辨い鏇楀亾婵﹨娅ｉ幏鐘绘嚑椤掑偆鍞归梻浣烘嚀閹测剝绻涙繝鍌ゅ殨濠电姵鑹鹃悘宕団偓瑙勬礀濞诧箑鈻撻弴銏♀拺闂侇偆鍋涢懟顖涙櫠鐎电硶鍋撶憴鍕；闁告鍟块锝嗙鐎ｅ灚鏅ｉ梺缁樓圭亸娆撳Χ閿曞倹鈷掑ù锝囩摂濞兼劗鈧娲橀敃銏ゃ€佸鎰佹Ь缂備緡鍠栭…鐑藉箹瑜版帩鏁冮柕鍫濇川濡插洭姊婚崒姘偓鎼佹偋婵犲嫮鐭欓柟鐑橆檪婢跺ň鍫柛鎰⒔閸炵敻姊洪懡銈呮灈闁稿锕よ灒闁逞屽墮閳规垿顢欑涵鐑界反濠电偛鎷戠紞渚€鐛箛娑欏亹閻犲洩灏欓宀勬⒑閸︻厼鍔嬬紒璇插€规穱濠囨倻閼恒儮鎷绘繛杈剧秬濡嫭绂嶈ぐ鎺撶厵闁惧浚鍋呯亸浼存煛閸涱厾鍩ｉ柟顔煎⒔娴狅妇绱掗姀锛勭◥闂傚倷鑳剁划顖炲礉閺囥埄鏁嬫い鎾跺Т婵剟鏌嶈閸撶喎顫忛搹鍦煓闁圭ǹ瀛╅幏杈╃磽娓氬洤鏋涚紒澶嬫尦閸┿垽骞樼拠鑼暰閻熸粌顦靛銊︾鐎ｎ偆鍘介梺褰掑亰閸撴瑧鐥閵囧嫰濡疯娴犻亶鏌″畝鈧崰鏍х暦閵婏妇绡€闁告劑鍔夐崑鎾诲箛閻楀牏鍘藉┑鐐村灥瀹曨剙鈻嶅鍛斀妞ゆ梻鎳撴禍楣冩⒒娴ｅ搫浠洪柛搴☆嚟娴滅ǹ鈻庨幋鐘辩瑝濠殿喗枪閸╂牠鍩涢幋锔解拻闁割偆鍠撻妴鎺戭熆瑜庡ú鐔煎箖濡も偓椤繈鎮℃惔銏㈠綆闂佽姤蓱缁诲牓寮婚妸鈺佹婵炲棛鍋撶紞妤佺箾鐎涙鐭嬬紒顔肩Ч婵＄敻宕熼姘辩杸闂傚倸鐗婄粙鎴︼綖椤忓牊鐓熼幖娣灮閸熸煡鏌熼崙銈嗗
        id_filter_table[i].id = 0x01U;  // 闂傚倸鍊搁崐鎼佸磹閹间礁纾归柟闂寸绾惧綊鏌熼梻瀵割槮缁炬儳缍婇弻鐔兼⒒鐎靛壊妲紒鐐劤濠€閬嶅焵椤掑倹鍤€閻庢凹鍙冨畷宕囧鐎ｃ劋姹楅梺鍦劋閸ㄥ綊宕愰悙鐑樺仭婵犲﹤鍠氬Ο鈧悗娈垮枟閹倸顕ｆ禒瀣垫晣闁绘柨鎼獮鎰版⒒娴ｈ鍋犻柛搴灦瀹曟洟鏌嗗鍡椻偓鍫曟煃閸濆嫬鏆熺痪鎯с偢閺岀喖鏌囬敃鈧鐐箾閸喓鐭掗柡灞糕偓宕囨殕闁逞屽墴瀹曚即寮介鐐电暫閻熸粍鏌ㄩ悾閿嬬附閸涘﹤浜滈梺鍛婄箓鐎氼剙鈻撻妷鈺傗拻闁稿本鐟чˇ锕傛煙鐠囇呯瘈鐎规洖婀遍幉鎾礋椤掆偓瀵潡姊洪崷顓℃闁哥姵鐗犻幃鈥愁潨閳ь剟寮婚悢鍛婄秶濡わ絽鍟宥夋⒑缁嬫鍎愰柛鏃€鐟╅獮鍐ㄎ旈崨顓熷祶濡炪倖鎸鹃崐顐﹀鎺虫禍婊堟煏婢舵稑顩紒鐘愁焽缁辨帗娼忛妸锕€闉嶉梺鐟板槻閹虫ê鐣烽锕€绀嬬痪鐗埫禍鍓р偓鍏夊亾闁告洦鍓涢崢閬嶆⒑闂堟胆褰掑磿閹惰棄鏄ラ柨婵嗘礌閸嬫挸鈻撻崹顔界亪濡炪値鍘鹃崗妯侯嚕椤愶箑绠涙い鎾跺仧缁愮偞绻濋悽闈浶㈤悗姘卞厴瀹曘儵宕ㄧ€涙ǚ鎷绘繛杈剧悼閹虫捇顢氬⿰鍛＜閻犲洦褰冮埀顒€娼￠悰顔藉緞婵炵偓顫嶉梺闈涚箳婵兘顢欓幒鏃傜＝闁稿本鐟ч崝宥嗐亜椤撶偞鍠樼€规洏鍨介獮鏍ㄦ媴閸忓瀚奸梻浣告啞缁嬫垿鏁冮敐鍥偨闂侇剙绉甸悡鏇㈡煟濡澧繛鍫熺矌閳ь剝顫夊ú姗€宕濆▎鎾跺祦闁搞儺鍓氶崑瀣煕椤愮姴鐏╂鐐村姍閺岋絾鎯旈垾鍐茶緟闂佺ǹ顑嗛幑鍥箖濡ゅ懏鏅查幖绮光偓鎰佹骄闂備椒绱粻鎴︽偋閹捐绠栨俊銈呭暞閸犲棝鏌涢弴銊ュ妞わ负鍔戦弻锝夊閳轰胶浠柣銏╁灣閸犳牠骞冨鈧獮鎺懳旀担鍝勫箺闂備胶绮崝鏇㈩敋椤撱垹鐓濋柟鍓х帛閻撳啰鎲稿⿰鍫濈婵炲棙鎸搁崒銊╂煛瀹ュ啫濡块柣婵嗙埣閺岋繝宕堕妷銉т痪闂佹娊鏀遍崹鍧楀蓟濞戞ǚ鏀介柛鈩冾殢娴尖偓闂備礁鐤囬褔藝閻㈢ǹ钃熸繛鎴炲焹閸嬫捇鏁嶉崡鐐叉殨濠㈣娲熷濠氬磼濞嗘帒鍘￠柡瀣典簼閵囧嫰骞嬪┑鍥舵＆濡ょ姷鍋為崝娆撶嵁閺嶃劎鐟瑰┑鐘插閳笺倖绻濋悽闈涒枅婵炰匠鍥舵晞闁圭増婢橀弸渚€鏌涢埄鍐姇闁绘挻娲熼幃姗€鎮欓幓鎺嗘寖闂佽桨鐒﹂悧鐘诲蓟閺囩喓绠鹃柣鎰靛墯閻濇洟姊洪幎鑺ユ暠闁搞劌娼￠獮鍐亹閹烘垹鍊為梺鎸庣箓閸婂憡绂嶉崜褉鍋撶憴鍕婵炶缍佸畷顐⑽旈崨顔规嫼闁荤姴娲﹁ぐ鍐敆閵忋倖鐓熸い鎾楀啯鐝濋悗瑙勬穿缁绘繈鐛惔銊﹀癄濠㈠厜鏂傞崕閬嶆箒闂佹寧绻傞幊搴ㄋ夎箛鏃傜閻忓繑鐗楀▍濠囨煙椤旀娼愰柕鍫畵楠炴劖鎯旈璇叉憢闂傚倷绀侀幉鈥澄涢幋鐘典笉闁硅揪鑵归埀顒佹瀹曟﹢顢欓崲澹洦鐓曢柍鈺佸枤濞堟﹢鏌ｉ悢鏉戝闁哄矉绲鹃幆鏃堝閻樺弶鐦撻梻浣告啞閹搁箖宕版惔顭戞晪闁挎繂顦婵嗏攽閻樻彃顏柟铏箞濮婃椽鏌呴悙鑼跺濠⒀冾嚟閳ь剚顔栭崰鏍€﹂悜钘夌畺闁靛繈鍊栭崑鍌炲箹鏉堝墽绉甸柛鐐茬秺濮婄粯绗熼埀顒勫焵椤掍胶鈽夌€规挸妫欑换娑欐媴閸愭彃鏆婇柡瀣⒐閵囧嫰骞樼捄杞版睏闂佽　鍋撳ù鐘差儐閻撳啴鏌﹀Ο渚Ч妞ゃ儲绮岄湁婵犲﹤瀚粻鐐烘煛鐏炶濮傜€殿喗娼欒灒闁惧繘鈧稓绀勯梺璇插椤旀牠宕伴弽顓涒偓锕€鐣￠柇锕€娈ㄩ梺鍦檸閸犳牠锝為崨瀛樼厽婵☆垱顑欓崵娆撴煛娴ｇ瓔娼愮紒缁樼箞閹粙妫冨☉鎺撶€版繝鐢靛仒閸栫娀宕楅悩鑼Ш鐎规洘甯掕闁稿繗鍋愬ú鎾煙椤旂晫鎳冩い鏂跨箻椤㈡瑩鎸婃径灞拘掗梻鍌氬€风欢姘焽瑜旈幃褔宕卞☉妯肩枃闂佸綊鍋婇崰姘▔瀹ュ鐓ｉ煫鍥风到娴滄牕霉濠婂嫮鐭嬮柕鍥у缁犳盯骞橀搹顐ｎ啋婵＄偑鍊х紞鍥箯閿燂拷
    }

    can_rx_fifo_filter_table_config(CAN2, id_filter_table);

    /* configure CAN0 NVIC */
    nvic_irq_enable(CAN2_Message_IRQn, 0U, 0U);

    /* enable CAN MB0 interrupt */
    can_interrupt_enable(CAN2, CAN_INT_FIFO_AVAILABLE);  // FIFO闂傚倸鍊搁崐鎼佸磹閹间礁纾归柟闂寸绾惧綊鏌熼梻瀵割槮缁炬儳缍婇弻鐔兼⒒鐎靛壊妲紒鐐劤濠€閬嶅焵椤掑倹鍤€閻庢凹鍙冨畷宕囧鐎ｃ劋姹楅梺鍦劋閸ㄥ綊宕愰悙鐑樺仭婵犲﹤鍠氬Ο鈧悗娈垮枟閹倸顕ｆ禒瀣垫晣闁绘柨鎼獮鎰版⒒娴ｈ鍋犻柛搴灦瀹曟洟鏌嗗鍡椻偓鍫曟煃閸濆嫬鏆熺痪鎯с偢閺岀喖鏌囬敃鈧鐐箾閸喓鐭掗柡灞糕偓宕囨殕闁逞屽墴瀹曚即寮介鐐电暫閻熸粍鏌ㄩ悾閿嬬附閸涘﹤浜滈梺鍛婄箓鐎氼剙鈻撻妷鈺傗拻闁稿本鐟чˇ锕傛煙鐠囇呯瘈鐎规洖婀遍幉鎾礋椤掆偓瀵潡姊洪崷顓℃闁哥姵鐗犻幃鈥愁潨閳ь剟寮婚悢鍛婄秶濡わ絽鍟宥夋⒑缁嬫鍎愰柛鏃€鐟╅獮鍐ㄎ旈崨顓熷祶濡炪倖鎸鹃崐顐﹀鎺虫禍婊堟煏婢舵稑顩紒鐘愁焽缁辨帗娼忛妸锕€闉嶉梺鐟板槻閹虫ê鐣烽锕€绀嬬痪鐗埫禍鍓р偓鍏夊亾闁告洦鍓涢崢閬嶆⒑闂堟胆褰掑磿閹惰棄鏄ラ柨婵嗘礌閸嬫挸鈻撻崹顔界亪濡炪値鍘鹃崗妯侯嚕椤愶箑绠涙い鎾跺仧缁愮偞绻濋悽闈浶㈤悗姘卞厴瀹曘儵宕ㄧ€涙ǚ鎷绘繛杈剧悼閹虫捇顢氬⿰鍛＜閻犲洦褰冮埀顒€娼￠悰顔藉緞婵炵偓顫嶉梺闈涚箳婵兘顢欓幒鏃傜＝闁稿本鐟ч崝宥嗐亜椤撶偞鍠樼€规洏鍨介獮鏍ㄦ媴閸忓瀚奸梻浣告啞缁嬫垿鏁冮敐鍥偨闂侇剙绉甸悡鏇㈡煟濡澧繛鍫熺矌閳ь剝顫夊ú姗€宕濆▎鎾跺祦闁搞儺鍓氶崑瀣煕椤愮姴鐏╂鐐村姍閺岋絾鎯旈垾鍐茶緟闂佺ǹ顑嗛幑鍥箖濡ゅ懏鏅查幖绮光偓鎰佹骄闂備椒绱粻鎴︽偋閹捐绠栨俊銈呭暞閸犲棝鏌涢弴銊ュ妞わ负鍔戦弻锝夊閳轰胶浠柣銏╁灣閸犳牠骞冨鈧獮鎺懳旀担鍝勫箺闂備胶绮崝鏇㈩敋椤撱垹鐓濋柟鍓х帛閻撳啰鎲稿⿰鍫濈婵炲棙鎸搁崒銊╂煛瀹ュ啫濡块柣婵嗙埣閺岋繝宕堕妷銉т痪闂佹娊鏀遍崹鍧楀蓟濞戞ǚ鏀介柛鈩冾殢娴尖偓闂備礁鐤囬褔藝閻㈢ǹ钃熸繛鎴炲焹閸嬫捇鏁嶉崡鐐叉殨濠㈣娲熷濠氬磼濞嗘帒鍘￠柡瀣典簼閵囧嫰骞嬪┑鍥舵＆濡ょ姷鍋為崝娆撶嵁閺嶃劎鐟瑰┑鐘插閳笺倖绻濋悽闈涒枅婵炰匠鍥舵晞闁圭増婢橀弸渚€鏌涢埄鍐姇闁绘挻娲熼幃姗€鎮欓幓鎺嗘寖闂佽桨鐒﹂悧鐘诲蓟閺囩喓绠鹃柣鎰靛墯閻濇洟姊洪幎鑺ユ暠闁搞劌娼″璇测槈濡攱鏂€闂佺硶鍓濋〃蹇斿閸屾凹娓婚柕鍫濋娴滃墽绱掗悩铏磳鐎殿喛顕ч埥澶愬閻樼數娼夐梻渚€鈧偛鑻晶瀵糕偓瑙勬礀缂嶅﹤鐣风粙璇炬棃宕橀妸褋鍋婇梻鍌欑閹诧繝宕濋敃鍌氱獥闁哄稁鍙忕紞鏍煕濞戞鎽犻柣鎾跺枑娣囧﹪顢涘┑鍥朵哗婵炲濮电粙鎺旀崲濞戙垹閱囬柣鏃囨閻ゅ嫬鈹戦纭锋敾婵＄偠妫勯悾鐑筋敃閿曗偓缁€瀣煕椤垵鈧綁顢旈崟銊︽杸闂佺粯鍔曞Ο濠偽ｇ憴鍕闁告瑥顦遍惌濠囧础闁秵鐓欓柟娈垮枛椤ｅジ鏌￠崨顔剧疄闁哄本绋撴禒锕傚礈瑜夐弸鏃堟⒑瑜版帗鏁辨俊鐐舵椤繐煤椤忓懎浜楅柟鍏兼儗閸犳绱炲Δ鍛拺缂佸灏呴弨缁樼箾閸欏澧甸柟顖氬暣椤㈡鎷呴搹鍦闂備焦鐪归崹钘夘焽瑜庣粋鎺楁晜閻ｅ瞼顔曢梺绋跨箺閸嬫劙骞婇崘顔藉亗闁靛牆妫庢禍婊堟煙閹冭埞闁诲浚浜弻锟犲川椤旀儳寮ㄩ梺鍝勭焿缂嶄線鐛崶顒夋晣闁绘棁娅ｉ埢蹇曠磽閸屾瑧顦﹀褍閰ｅ畷鎴﹀Χ婢跺﹦鐣哄┑顔姐仜閸嬫捇鏌熼鐣屾噰闁诡垰鍊垮鎷岀疀閿濆棛绉风紓鍌欑閸婂摜绮旇ぐ鎺戠畺婵炲棙鎼╅弫鍡椕归敐鍤借瀵兼惔銏㈢瘈缁剧増蓱椤﹪鏌涢妸锕€鈻曠€规洏鍨奸ˇ宕囩磼閸屾氨校闁靛牞缍佸畷姗€鍩℃担鎻掍壕闁割煈鍋呴崣蹇斾繆椤栨粌甯跺ù婊堢畺閹顫濋悙顒€顏�
    can_interrupt_enable(CAN2, CAN_INT_FIFO_WARNING);    // FIFO闂傚倸鍊搁崐鎼佸磹閹间礁纾归柟闂寸绾惧綊鏌熼梻瀵割槮缁炬儳缍婇弻鐔兼⒒鐎靛壊妲紒鐐劤濠€閬嶅焵椤掑倹鍤€閻庢凹鍙冨畷宕囧鐎ｃ劋姹楅梺鍦劋閸ㄥ綊宕愰悙鐑樺仭婵犲﹤鍠氬Ο鈧悗娈垮枟閹倸顕ｆ禒瀣垫晣闁绘柨鎼獮鎰版⒒娴ｈ鍋犻柛搴灦瀹曟洟鏌嗗鍡椻偓鍫曟煃閸濆嫬鏆熺痪鎯с偢閺岀喖鏌囬敃鈧鐐箾閸喓鐭掗柡灞糕偓宕囨殕闁逞屽墴瀹曚即寮介鐐电暫閻熸粍鏌ㄩ悾閿嬬附閸涘﹤浜滈梺鍛婄箓鐎氼剙鈻撻妷鈺傗拻闁稿本鐟чˇ锕傛煙鐠囇呯瘈鐎规洖婀遍幉鎾礋椤掆偓瀵潡姊洪崷顓℃闁哥姵鐗犻幃鈥愁潨閳ь剟寮婚悢鍛婄秶濡わ絽鍟宥夋⒑缁嬫鍎愰柛鏃€鐟╅獮鍐ㄎ旈崨顓熷祶濡炪倖鎸鹃崐顐﹀鎺虫禍婊堟煏婢舵稑顩紒鐘愁焽缁辨帗娼忛妸锕€闉嶉梺鐟板槻閹虫ê鐣烽锕€绀嬬痪鐗埫禍鍓р偓鍏夊亾闁告洦鍓涢崢閬嶆⒑闂堟胆褰掑磿閹惰棄鏄ラ柨婵嗘礌閸嬫挸鈻撻崹顔界亪濡炪値鍘鹃崗妯侯嚕椤愶箑绠涙い鎾跺仧缁愮偞绻濋悽闈浶㈤悗姘卞厴瀹曘儵宕ㄧ€涙ǚ鎷绘繛杈剧悼閹虫捇顢氬⿰鍛＜閻犲洦褰冮埀顒€娼￠悰顔藉緞婵炵偓顫嶉梺闈涚箳婵兘顢欓幒鏃傜＝闁稿本鐟ч崝宥嗐亜椤撶偞鍠樼€规洏鍨介獮鏍ㄦ媴閸忓瀚奸梻浣告啞缁嬫垿鏁冮敐鍥偨闂侇剙绉甸悡鏇㈡煟濡澧繛鍫熺矌閳ь剝顫夊ú姗€宕濆▎鎾跺祦闁搞儺鍓氶崑瀣煕椤愮姴鐏╂鐐村姍閺岋絾鎯旈垾鍐茶緟闂佺ǹ顑嗛幑鍥箖濡ゅ懏鏅查幖绮光偓鎰佹骄闂備椒绱粻鎴︽偋閹捐绠栨俊銈呭暞閸犲棝鏌涢弴銊ュ妞わ负鍔戦弻锝夊閳轰胶浠柣銏╁灣閸犳牠骞冨鈧獮鎺懳旀担鍝勫箺闂備胶绮崝鏇㈩敋椤撱垹鐓濋柟鍓х帛閻撳啰鎲稿⿰鍫濈婵炲棙鎸搁崒銊╂煛瀹ュ啫濡块柣婵嗙埣閺岋繝宕堕妷銉т痪闂佹娊鏀遍崹鍧楀蓟濞戞ǚ鏀介柛鈩冾殢娴尖偓闂備礁鐤囬褔藝閻㈢ǹ钃熸繛鎴炲焹閸嬫捇鏁嶉崡鐐叉殨濠㈣娲熷濠氬磼濞嗘帒鍘￠柡瀣典簼閵囧嫰骞嬪┑鍥舵＆濡ょ姷鍋為崝娆撶嵁閺嶃劎鐟瑰┑鐘插閳笺倖绻濋悽闈涒枅婵炰匠鍥舵晞闁圭増婢橀弸渚€鏌涢埄鍐姇闁绘挻娲熼幃姗€鎮欓幓鎺嗘寖闂佽桨鐒﹂悧鐘诲蓟閺囩喓绠鹃柣鎰靛墯閻濇洟姊洪幎鑺ユ暠闁搞劌娼″璇测槈濡攱鏂€闂佺硶鍓濋〃蹇斿閸屾凹娓婚柕鍫濋娴滃墽绱掗悩铏磳鐎殿喛顕ч埥澶愬閻樼數娼夐梻渚€鈧偛鑻晶瀵糕偓瑙勬礀缂嶅﹤鐣风粙璇炬棃宕橀妸褋鍋婇梻鍌欑閹诧繝宕濋敃鍌氱獥闁哄稁鍙忕紞鏍煕濞戞鎽犻柣鎾跺枑娣囧﹪顢涘┑鍥朵哗婵炲濮电粙鎺旀崲濞戙垹閱囬柣鏃囨閻ゅ嫬鈹戦纭锋敾婵＄偠妫勯悾鐑筋敃閿曗偓缁€瀣煕椤垵鈧綁顢旈崟銊︽杸闂佺粯鍔曞Ο濠偽ｇ憴鍕闁告瑥顦遍惌濠囧础闁秵鐓欓柟娈垮枛椤ｅジ鏌￠崨顔剧疄闁哄本绋撴禒锕傚礈瑜夐弸鏃堟⒑瑜版帗鏁辨俊鐐舵椤繐煤椤忓懎浜楅柟鍏兼儗閸犳绱炲Δ鍛拺缂佸灏呴弨缁樼箾閸欏澧甸柟顖氬暣椤㈡鎷呴搹鍦闂備焦鐪归崹钘夘焽瑜庣粋鎺楁晜閻ｅ瞼顔曢梺绋跨箺閸嬫劙骞婇崘顔藉亗闁靛牆妫庢禍婊堟煙閹冭埞闁诲浚浜弻锟犲川椤旀儳寮ㄩ梺鍝勭焿缂嶄線鐛崶顒夋晣闁绘棁娅ｉ埢蹇曠磽閸屾瑧顦﹀褍閰ｅ畷鎴﹀Χ婢跺﹦鐣哄┑顔姐仜閸嬫捇鏌熼鐣屾噰闁诡垰鍊垮鎷岀疀閿濆棛绉风紓鍌欑閸婂摜绮旇ぐ鎺戠畺婵炲棙鎼╅弫鍡椕归敐鍤借瀵兼惔銏㈢瘈缁剧増蓱椤﹪鏌涢妸锕€鈻曠€规洏鍨奸ˇ宕囩磼閸屾氨校闁靛牞缍佸畷姗€鍩℃担鎻掍壕闁割煈鍋呴崣蹇斾繆椤栨粌甯跺ù婊堢畺閹顫濋悙顒€顏�
    can_interrupt_enable(CAN2, CAN_INT_FIFO_OVERFLOW);   // FIFO闂傚倸鍊搁崐鎼佸磹閹间礁纾归柟闂寸绾惧綊鏌熼梻瀵割槮缁炬儳缍婇弻鐔兼⒒鐎靛壊妲紒鐐劤濠€閬嶅焵椤掑倹鍤€閻庢凹鍙冨畷宕囧鐎ｃ劋姹楅梺鍦劋閸ㄥ綊宕愰悙鐑樺仭婵犲﹤鍠氬Ο鈧悗娈垮枟閹倸顕ｆ禒瀣垫晣闁绘柨鎼獮鎰版⒒娴ｈ鍋犻柛搴灦瀹曟洟鏌嗗鍡椻偓鍫曟煃閸濆嫬鏆熺痪鎯с偢閺岀喖鏌囬敃鈧鐐箾閸喓鐭掗柡灞糕偓宕囨殕闁逞屽墴瀹曚即寮介鐐电暫閻熸粍鏌ㄩ悾閿嬬附閸涘﹤浜滈梺鍛婄箓鐎氼剙鈻撻妷鈺傗拻闁稿本鐟чˇ锕傛煙鐠囇呯瘈鐎规洖婀遍幉鎾礋椤掆偓瀵潡姊洪崷顓℃闁哥姵鐗犻幃鈥愁潨閳ь剟寮婚悢鍛婄秶濡わ絽鍟宥夋⒑缁嬫鍎愰柛鏃€鐟╅獮鍐ㄎ旈崨顓熷祶濡炪倖鎸鹃崐顐﹀鎺虫禍婊堟煏婢舵稑顩紒鐘愁焽缁辨帗娼忛妸锕€闉嶉梺鐟板槻閹虫ê鐣烽锕€绀嬬痪鐗埫禍鍓р偓鍏夊亾闁告洦鍓涢崢閬嶆⒑闂堟胆褰掑磿閹惰棄鏄ラ柨婵嗘礌閸嬫挸鈻撻崹顔界亪濡炪値鍘鹃崗妯侯嚕椤愶箑绠涙い鎾跺仧缁愮偞绻濋悽闈浶㈤悗姘卞厴瀹曘儵宕ㄧ€涙ǚ鎷绘繛杈剧悼閹虫捇顢氬⿰鍛＜閻犲洦褰冮埀顒€娼￠悰顔藉緞婵炵偓顫嶉梺闈涚箳婵兘顢欓幒鏃傜＝闁稿本鐟ч崝宥嗐亜椤撶偞鍠樼€规洏鍨介獮鏍ㄦ媴閸忓瀚奸梻浣告啞缁嬫垿鏁冮敐鍥偨闂侇剙绉甸悡鏇㈡煟濡澧繛鍫熺矌閳ь剝顫夊ú姗€宕濆▎鎾跺祦闁搞儺鍓氶崑瀣煕椤愮姴鐏╂鐐村姍閺岋絾鎯旈垾鍐茶緟闂佺ǹ顑嗛幑鍥箖濡ゅ懏鏅查幖绮光偓鎰佹骄闂備椒绱粻鎴︽偋閹捐绠栨俊銈呭暞閸犲棝鏌涢弴銊ュ妞わ负鍔戦弻锝夊閳轰胶浠柣銏╁灣閸犳牠骞冨鈧獮鎺懳旀担鍝勫箺闂備胶绮崝鏇㈩敋椤撱垹鐓濋柟鍓х帛閻撳啰鎲稿⿰鍫濈婵炲棙鎸搁崒銊╂煛瀹ュ啫濡块柣婵嗙埣閺岋繝宕堕妷銉т痪闂佹娊鏀遍崹鍧楀蓟濞戞ǚ鏀介柛鈩冾殢娴尖偓闂備礁鐤囬褔藝閻㈢ǹ钃熸繛鎴炲焹閸嬫捇鏁嶉崡鐐叉殨濠㈣娲熷濠氬磼濞嗘帒鍘￠柡瀣典簼閵囧嫰骞嬪┑鍥舵＆濡ょ姷鍋為崝娆撶嵁閺嶃劎鐟瑰┑鐘插閳笺倖绻濋悽闈涒枅婵炰匠鍥舵晞闁圭増婢橀弸渚€鏌涢埄鍐姇闁绘挻娲熼幃姗€鎮欓幓鎺嗘寖闂佽桨鐒﹂悧鐘诲蓟閺囩喓绠鹃柣鎰靛墯閻濇洟姊虹粙鍖″姛闁轰礁顭烽獮鍐ㄧ暋閹佃櫕鐎婚棅顐㈡处閹尖晜绂掗崜褏纾藉ù锝呮憸閻掗攱绻涙径瀣婵″弶鍔欓獮鎺楀籍閸屾粣绱叉繝纰樻閸ㄧ敻宕戦幇鐗堝仾闁告洦鍨遍埛鎴犵磽娴ｅ鑲╂闁秵鐓曢柨婵嗙箳閸掔増銇勯弴顏嗙ɑ缂佸倹甯為埀顒婄秵閳ь剦鍘搁弲鐘诲蓟閵娾晛鍗虫俊銈傚亾濞存粍鍎抽—鍐Χ閸涱収鍔夐梺鍦嚀濞差厼顕ｆ繝姘櫜濠㈣泛顑呮禍婊堟⒑閸涘﹦缂氶柛搴㈢叀瀹曞疇顦归柡宀嬬稻閹棃濮€閻樺弶鐦撻梻浣告啞閻熴儵宕幘顔嘉ュ〒姘ｅ亾鐎殿噮鍣ｅ畷濂告偄閾氬倻鐩庨梻鍌欒兌鏋紒缁樺姍閹啴鎮滈挊澶岊唵缂傚倷鐒﹂…鍥╃不妤ｅ啫绾ч柛顐ｇ箓閳锋梻绱掓径妯哄闁宠鍨块、娆撳传閸曘劌浜炬俊銈傚亾闁宠棄顦甸幃鐣岀矙閸ф鏁归梻浣告惈濞层劑宕伴幘璇插偍闂侇剙绉甸埛鎴︽煙缁嬫寧鎹ｇ紒鐘虫尵缁辨帞绱掑Ο鐑樿癁闂佽鍣ｇ粻鏍х暦瑜版帩鏁冩い鎰剁秵閸熷秹姊绘担铏瑰笡闁告梹顭囨禍绋库枎閹寸姳绗夋繝鐢靛У绾板秹鎮″☉妯忓綊鏁愰崼顐ｇ秷閻庤娲栭惌鍌炲蓟閳╁啯濯撮悷娆忓绾炬娊姊烘潪鎵妽闁圭懓娲顐﹀箻缂佹ɑ娅㈤梺璺ㄥ櫐閹凤拷

