kyckyckyc/DGM/src/gd32g5x3_init.c
    can_operation_mode_enter(CAN2, CAN_NORMAL_MODE);
 
    can_mailbox_transmit_inactive(CAN2, 8U);
    can_mailbox_transmit_inactive(CAN2, 9U);
    can_mailbox_transmit_inactive(CAN2, 10U);

  
}

void can0fd_txMessage(uint8_t length,uint8_t id,uint8_t *can0txdata)
{
    for(int i = 0; i < length; i++){
        transmit_message.data[i] = can0txdata[i];
    }
    transmit_message.rtr = 0U;
    transmit_message.ide = 0U;
    transmit_message.code = CAN_MB_TX_STATUS_DATA;
    transmit_message.brs = 1U;
    transmit_message.fdf = 1U;
    transmit_message.esi = 0U;
    transmit_message.prio = 0U;
    transmit_message.data_bytes = length;
    transmit_message.id = id;

    can_mailbox_config(CAN0, 1U, &transmit_message);
}

uint32_t mailbox_code = 0;
ErrStatus can2_tx_with_mailbox(uint8_t length, uint32_t id, uint8_t *can2txdata, uint32_t mailbox_index)
{
    
    if(length > 8) {
        return ERROR;
    }
    
    /* 闂傚倸鍊搁崐鎼佸磹閹间礁纾归柟闂寸绾惧綊鏌熼梻瀵割槮缁炬儳缍婇弻鐔兼⒒鐎靛壊妲紒鐐劤濠€閬嶅焵椤掑倹鍤€閻庢凹鍙冨畷宕囧鐎ｃ劋姹楅梺鍦劋閸ㄥ綊宕愰悙鐑樺仭婵犲﹤鍠氬Ο鈧悗娈垮枟閹倸顕ｆ禒瀣垫晣闁绘柨鎼獮鎰版⒒娴ｈ鍋犻柛搴灦瀹曟洟鏌嗗鍡椻偓鍫曟煃閸濆嫬鏆熺痪鎯с偢閺岀喖鏌囬敃鈧鐐箾閸喓鐭掗柡灞糕偓宕囨殕闁逞屽墴瀹曚即寮介鐐电暫閻熸粍鏌ㄩ悾閿嬬附閸涘﹤浜滈梺鍛婄箓鐎氼剙鈻撻妷鈺傗拻闁稿本鐟чˇ锕傛煙鐠囇呯瘈鐎规洖婀遍幉鎾礋椤掆偓瀵潡姊洪崷顓℃闁哥姵鐗犻幃鈥愁潨閳ь剟寮婚悢鍛婄秶濡わ絽鍟宥夋⒑缁嬫鍎愰柛鏃€鐟╅獮鍐ㄎ旈崨顓熷祶濡炪倖鎸鹃崐顐﹀鎺虫禍婊堟煏婢舵稑顩紒鐘愁焽缁辨帗娼忛妸锕€闉嶉梺鐟板槻閹虫ê鐣烽锕€绀嬬痪鐗埫禍鍓р偓鍏夊亾闁告洦鍓涢崢閬嶆⒑闂堟胆褰掑磿閹惰棄鏄ラ柨婵嗘礌閸嬫挸鈻撻崹顔界亪濡炪値鍘鹃崗妯侯嚕椤愶箑绠涙い鎾跺仧缁愮偞绻濋悽闈浶㈤悗姘卞厴瀹曘儵宕ㄧ€涙ǚ鎷绘繛杈剧悼閹虫捇顢氬⿰鍛＜閻犲洦褰冮埀顒€娼￠悰顔藉緞婵炵偓顫嶉梺闈涚箳婵兘顢欓幒鏃傜＝闁稿本鐟ч崝宥嗐亜椤撶偞鍠樼€规洏鍨介獮鏍ㄦ媴閸忓瀚奸梻浣告啞缁嬫垿鏁冮敐鍥偨闂侇剙绉甸悡鏇㈡煟濡澧繛鍫熺矌閳ь剝顫夊ú姗€宕濆▎鎾跺祦闁搞儺鍓氶崑瀣煕椤愮姴鐏╂鐐村姍閺岋絾鎯旈垾鍐茶緟闂佺ǹ顑嗛幑鍥箖濡ゅ懏鏅查幖绮光偓鎰佹骄闂備椒绱粻鎴︽偋閹捐绠栨俊銈呭暞閸犲棝鏌涢弴銊ュ妞わ负鍔戦弻锝夊閳轰胶浠柣銏╁灣閸犳牠骞冨鈧獮鎺懳旀担鍝勫箺闂備胶绮崝鏇㈩敋椤撱垹鐓濋柟鍓х帛閻撳啰鎲稿⿰鍫濈婵炲棙鎸搁崒銊╂煛瀹ュ啫濡块柣婵嗙埣閺岋繝宕堕妷銉т痪闂佹娊鏀遍崹鍧楀蓟濞戞ǚ鏀介柛鈩冾殢娴尖偓闂備礁鐤囬褔藝閻㈢ǹ钃熸繛鎴炲焹閸嬫捇鏁嶉崡鐐叉殨濠㈣娲熷濠氬磼濞嗘帒鍘￠柡瀣典簼閵囧嫰骞嬪┑鍥舵＆濡ょ姷鍋為崝娆撶嵁閺嶃劎鐟瑰┑鐘插閳笺倖绻濋悽闈涒枅婵炰匠鍥舵晞闁圭増婢橀弸渚€鏌涢埄鍐姇闁绘挻娲熼幃姗€鎮欓幓鎺嗘寖闂佽桨鐒﹂悧鐘诲蓟閺囩喓绠鹃柣鎰靛墯閻濇洟姊洪幎鑺ユ暠闁搞劌娼″璇测槈濡攱鏂€闂佺硶鍓濋〃蹇斿閸屾凹娓婚柕鍫濋娴滃墽绱掗悩铏磳鐎殿喛顕ч埥澶愬閻樼數娼夐梻渚€鈧偛鑻晶瀵糕偓瑙勬礀缂嶅﹤鐣风粙璇炬棃宕橀妸褋鍋婇梻鍌欑閹诧繝宕濋敃鍌氱獥闁哄稁鍙忕紞鏍煕濞戞鎽犻柣鎾崇箻閺屾盯顢曢敐鍥╃暫闂侀潻绲藉﹢杈╂閹烘绠涙い鎾跺Л婵洨绱撴担铏瑰笡缂佽鐗撻獮鍐╃鐎ｎ偒妫冨┑鐐殿棎缂堜即宕规禒瀣畺婵°倐鍋撴い顐ｇ箞濮婅崵鈧潧鎲￠弲鍏肩節绾版ǚ鍋撻崘鑼獓闂佸憡姊归悷銉╊敋閿濆绠绘い鏃傗拡濞煎﹪姊洪幎鑺ユ殰闁稿鎹囬弻鐔割槹鎼达絽绗＄紓浣虹帛缁嬫帒顭囪箛娑樼鐟滃秹宕哄畝鍕拺缁绢厼鎳庤缂備緡鍠栧ù鐑藉礆閹烘绫嶉柛顐ゅ枎閳ь剛绮穱濠囶敍閻愬瓨鐝崇紓浣靛妼椤嘲顫忓ú顏咁棃婵炴垼椴搁鍡涙⒒閸屾艾顏╅悗姘煎墴閹儳鐣￠幍顔芥畷闂侀€炲苯澧撮柛鈹惧亾濡炪倖甯掗崰姘焽閹邦厾绠鹃柛娆忣檧閼板潡鏌曢崱妤€鏆ｇ€规洏鍔嶅蹇涘礈瑜忛埣銈嗙節閻㈤潧孝闁挎洏鍊濋幃褔宕卞☉娆忊偓鍧楁煕椤垵浜栧ù婊勭矒閺岀喖宕崟顒夋婵炲瓨绮嶉崕鎶解€旈崘顔嘉ч柛鈩冾焽閳规稓绱撻崒姘毙＄紒鑸靛哺婵″瓨绗熼埀顒€顕ｉ幘顔碱潊闁斥晛鍟悵鏍⒒娓氣偓閳ь剛鍋涢懟顖涙櫠閹殿喚纾兼い鏂垮⒔鐢稓绱掔紒妯肩畵妞ゎ偅绻堥、姗€鎮欓弶鍨嚙闂傚倸鍊烽悞锕傚箖閸洖纾挎繝濠傜墕缁€鍐┿亜韫囨挾澧㈢€规洘绮岄埞鎴︽晬閸曨偂鏉梺绋匡攻閸ㄥ灝鐣烽弴銏″殤妞ゆ帊绀佹惔濠囨⒑閸撴彃浜濈紒璇茬Т椤洭寮介妸褏顔曢悗鐟板閸犳洜鑺遍崗绗轰簻闁靛鍎虫晶娑氱磼缂佹娲存鐐差儔閹瑧鎹勬笟顖涱棨濠碉紕鍋戦崐褏寰婃禒瀣妞ゆ劧绠戦悡姗€鏌熸潏鍓х暠闁绘搫绻濋弻娑㈠焺閸愶缚娌紓浣靛妿閸樠団€旈崘顔嘉ч柛鎰╁妼椤牓姊洪幐搴㈠濞存粠浜濇穱濠勨偓娑欘焽閻熷綊鏌嶈閸撴瑩顢氶敐澶樻晪闁逞屽墮閻ｉ攱绺介崨濠備簻闂備礁鐏濋鍥级濞差亝鈷掗柛灞剧懅閸斿秹鏌ｉ鍕Ш鐎规洝顫夌换婵嗩潩椤掍胶鈧剟姊鸿ぐ鎺擄紵缂佽绻濆顐ｇ節閸ャ劎鍘搁梺鎼炲劘閸庨亶鎮橀鍫熺厓闂佸灝顑呴悘鈺冪磼鏉堛劌娴い銏＄☉閳藉鈻庨幋顓熜氭繝鐢靛Л閹峰啴宕熼鐐茬哗闂備礁鎼惌澶岀礊娓氣偓楠炲啴濮€閵堝懐楠囬梺鐟扮摠缁诲倽顤傞梻鍌氬€烽懗鍓佹兜閸洖妫橀柛宀€鍋涢崹鍌炴煢濡警妲洪柡鍡畱閳规垿宕掑┃鎾舵嚀閺侇噣姊绘担鐟邦嚋婵﹤缍婂畷鏇㈠箮閻ｅ苯绁﹂梺褰掑亰閸忔﹢寮ㄦ禒瀣厽闁归偊鍨伴悡鎰喐閹跺﹤鎳愮壕鐣屸偓骞垮劙缁€浣圭閻愵兛绻嗛柣鎰典簻閳ь兙鍊濆畷鎴﹀礋椤栤偓閸ヮ剦鏁嶉柣鎰綑娴犲ジ鎮楅悷鏉款仾濠㈢懓妫濆鎶藉幢濞戞瑧鍘撻悷婊勭矒瀹曟粓鎮㈤悡搴㈡К闂侀€炲苯澧柕鍥у楠炴帒顓奸崶顏嗙崶闂備礁鎽滈崰搴ｆ崲濮椻偓瀵鈽夐姀鈩冩珳闁硅偐琛ラ崜婵嬫偟濠靛鍊甸悷娆忓缁€鍐磼椤旇姤宕屾鐐插暣婵偓闁靛牆妫岄幏褰掓⒑瑜版帒浜伴柛鐘冲哺閹偓銈ｉ崘鈹炬嫽婵炶揪绲挎灙妞ゃ儱绻橀弻娑氣偓锝庝簼閸ｅ綊鎮￠妶澶嬬厸鐎广儱楠搁獮妯尖偓瑙勬尫缁舵岸寮婚弴锛勭杸濠电偞鍎虫禍楣冩煠绾板崬澧伴柣锝夌畺濮婄粯绗熼埀顒€顭囪閹囧幢濞戞顔嗛梺鐟扮摠缁诲秴顭囬弽銊ょ箚闁靛牆鎳庨弳鐔虹棯閹佸仮闁哄瞼鍠栭獮鎾诲箳濠靛棗澹嬮梻浣风串缁蹭粙鎮樺璺虹疄闁靛⿵濡囩弧鈧梺绋胯閸婃宕ョ€ｎ喗鍊甸悷娆忓缁€鍐偨椤栨稑娴柛鈹垮灪閹棃濡搁妷褏鏉告俊鐐€栭弻銊╁箹椤愶絿顩烽柟鐑樺灍閺€浠嬫煟濡櫣浠涢柡鍡忔櫊閺屾稓鈧綆鍋嗗ú鎾寠濠靛鐓涘璺侯儜缁扁晜绻涘顔荤凹闁稿瀚—鍐偓锝庝簻椤掋垺绻涢崼銏犱壕缂佺粯鐩鍫曞箣濠靛洤鈧垰鈹戦悙鎻掓倯闁荤啙鍛灊閻犲洦绁村Σ鍫ユ煏韫囥儳纾块柛妯烘啞缁绘繈濮€閿濆棛銆愰梺鎸庢穿闂勫嫮绮嬮幒妤€顫呴柕鍫濇閸橀亶姊洪棃娑氬婵☆偅顨婇幃姗€鏁傞崜褏锛滅紓鍌欑劍椤洨绮婚悙鐑樼厵妞ゆ棁宕甸惌娆愪繆椤愩垹鏆欓棁澶愭偣娴ｅ憡璐＄紒澶樺櫍閺岋紕浠︾拠娴嬪亾濠靛绠栭柣鎴ｆ缁狙囧箹鐎涙ɑ灏伴悗鍨墱缁辨捇宕掑▎鎴ｇ獥闂佸摜濮甸悧鐘诲灳閿曞倹鍊诲┑顔藉姀閸嬫挻鎷呯化鏇燁潔闂侀潧绻嗛埀顒佹灱閸嬫捇鎮滈懞銉モ偓鐢告煟閵忋垺顏㈢憸鐗堝笧瀹撲焦淇婇妶鍛櫤闁抽攱甯掗湁闁挎繂瀚鐔兼煛閳ь剚瀵肩€涙鍘靛┑鐐跺蔼椤斿﹦鑺遍悾灞稿亾閸偅绶查柨鏇ㄤ簻閻ｇ兘骞囬悧鍫濅簽婵炶揪缍€椤鎯侀敐澶嬧拻闁稿本鑹鹃埀顒佹倐瀹曟劖顦版惔锝囩劶婵炴挻鍩冮崑鎾搭殽閻愬澧垫い銏℃礋閺佸啴鍩€椤掑倻涓嶉柣妯垮吹閸欐捇鏌涢妷锝呭闁宠棄顦辩槐鎺楁偐瀹曞洤鈷岄梺鍝勬湰缁嬫垿鎮惧┑瀣劦妞ゆ帒瀚壕缁樼箾閹存瑥鐏悗姘嚇閺岋綁寮崹顔藉€梺缁樻尪閸庣敻寮婚敐澶婃闁圭ǹ瀛╅崕鎾绘倵濞戞瑧绠樼紒杈ㄥ浮閹瑩顢楅埀顒勫礉閵堝鐓曟慨姗嗗墻閸庢劗绱掑畝鍐摵缂佺粯绻堝畷鍫曟嚋閸偅鐝┑鐘垫暩婵炩偓婵炰匠鍛亾濮樷偓閸パ咃紱闂佽宕橀褔鎮為崹顐犱簻闁圭儤鍨甸顏堟煟閹惧瓨绀嬮柟顔筋殜閺佹劖鎯旈垾鑼嚬闁诲氦顫夊ú鏍儔婵傜ǹ鐒垫い鎺嶇贰閸熷繘鏌涢悩铏闁告帗甯掗埢搴ㄥ箻閹典礁浜惧〒姘ｅ亾鐎殿喗鎸虫慨鈧柍銉ュ帠缁ㄥ姊绘担鍝勪壕闁煎綊绠栧畷鎰板箹娴ｂ偓婢跺⿴娼╂い鎾跺Х閻﹀牆鈹戦悙鑼闁诲繑绻堝鎼佹偄閸忚偐鍙嗛梺鍝勬处椤ㄥ棗鈻嶆繝鍕ㄥ亾鐟欏嫭绀冪紒顔肩焸閸┿儲寰勬繝搴㈠兊闁哄鐗冮弲婵嬪储閻樺磭绡€闁汇垽娼ф禒婊勪繆椤栨熬鏀荤紒鍌氱Т閳规垹鈧綆鍋勬禍妤€鈹戦悙鏉戠仧闁搞劍妞藉畷鎰板醇閺囩喓鍘介梺閫涘嵆閸嬪﹪寮跺ú顏呯厱闁靛牆妫涢幊鍐煃鐟欏嫬鐏存い銏＄懇閹剝鎯斿Ο杞板闂佺鍕垫當闁藉啰鍠栭弻锝夊籍閸屾瀚涢梺杞扮閿曨亪寮诲☉妯锋斀闁糕剝顨忔导鈧┑鐐差嚟閸樠囨偋閹捐绠栨俊銈呭暞閸犲棝鏌涢弴銊ュ闁挎稒锕㈠娲川婵犲啰鍙嗙紓浣割槸閻栧ジ鐛幋锕€顫呴柣姗嗗亝閺傗偓闂佽鍑界紞鍡樼閻愭牳鍥级濞嗙偓瀵岄梺闈涚墕閹虫劗绮婚悧鍫滅箚妞ゆ劧绲垮ú鎾煛娴ｅ摜效闁诡喓鍨藉畷妤冧焊閺嶃劌顏洪梻鍌欒兌鏋柡鍫墴閹虫繃銈ｉ崘銊у姦濡炪倖甯掔€氬嘲螞閹寸姷纾兼い鏃囧亹婢ф盯鏌熷畡鐗堝殗闁圭厧缍婂畷鐑筋敇瑜庣瑧濠电姷鏁告慨鐑藉极閸涘﹥鍙忛柡澶嬪灍閺嬫牗鎱ㄥ鍡楀箹缂佸墎鍋ら弻鐔兼焽閿曗偓婢х増銇勯弮鈧敮锟犲蓟閿濆鍋愰柛娆忣槺閳规盯鏌ｈ箛鎾剁闁荤啿鏅炲Λ鐔兼偡濠婂啰效闁糕晝鍋ら獮瀣晜缂佹ɑ娅撳┑鐘愁問閸犳宕濋幒鏂垮灊闁割偅娲橀埛鎴犵磼鐎ｎ偒鍎ラ柛搴㈠姍閺岀喖骞栨担铏规毇闂佺硶鏂侀崑鎾愁渻閵堝棗绗傜紒璁圭節瀹曨垵绠涘☉娆戝幈闂佹寧绻傛绋库枍瀹ュ洠鍋撶憴鍕闁搞劌澧庨幑銏犫攽鐎ｎ亞鍊為梺瀹犳〃閼冲爼濡堕敂鐣岀瘈缁剧増蓱椤﹪鏌涢妸銈呭祮闁诡垰鍟撮幃婊堟寠婢跺矉绱遍梻浣告贡閸嬫捇寮搁悡骞綁宕奸悢铏诡啎闂佸憡绮堢粈浣割嚕閹灐鐟扳堪鎼存繈鍋楅梺杞扮劍閸旀瑩骞冨▎鎾村€绘俊顖滅帛椤忕喖姊绘担铏瑰笡閽冮亶鏌＄€ｎ亗鍋㈡鐐茬箰鐓ゆい蹇撴噳閹锋椽姊洪崨濠勨槈闁挎洏鍎遍悾鐑藉礋椤栨稑鈧爼鐓崶銊︹拻闁瑰啿娲ㄩ埀顒冾潐濞插繘宕硅ぐ鎺嬪亼濞村吋娼欏婵囥亜閺嶃劎鐜荤紒杈ㄧ叀濮婄粯鎷呴搹鐟扮闂佹寧宀搁弻娑㈡偄闁垮浠撮梺璇″枟閿曘垽宕洪敓鐘茬妞ゅ繐妫寸槐鍙変繆閻愵亜鈧牕螞娴ｈ鍙忛柕鍫濓紗婢舵劕閱囬柕澶涘閸橀潧顪冮妶鍡樷拻闁稿鎸搁埢宥夊即閵忥紕鍘遍梺缁樓归婊冾啅閵夆晜鎳氶柨婵嗩槸缁狙囨煟閹邦剛鎽犵紒璺哄级閵囧嫰濡烽敂缁㈡殹缂備胶绮换鍌炲煝閹捐鍨傛い鏃傛櫕娴滃爼姊绘担鐟邦嚋婵炴彃绉瑰鏌ユ偐閼碱剚娈惧┑鐘诧工閸熺姴危閸喐鍙忔俊顖氥仒閸氼偊鏌ｉ幘鎰佸剰闁宠鍨块幃娆撳矗婢跺棙鐏嗗┑鐐茬摠缁秶鎹㈤崼銉ョ畺闁炽儲鏋煎Σ鍫ユ煏韫囧ň鍋撻弬銉ヤ壕闁割偅娲橀悡鐔兼煙娴兼潙浜伴柡澶嬫そ閺屾盯濡堕崱娆愬櫑闂佸疇顫夐崹鍧椼€佸▎鎾村亗閹煎瓨锚娴滈箖鏌涜椤ㄥ懘鎷戦悢鍏肩厽闁哄啫鍊甸幏锟犳煛娴ｉ潻韬柡灞剧☉閳规垿宕卞Δ濠佹闂備胶枪椤戝棝骞愰幖浣哥厴闁硅揪绠戦獮銏＄箾閸℃ê濮堟い鏃€娲熷缁樻媴閸涘﹨纭€闂佺ǹ绨洪崐婵嗙暦瑜版帗鍋勯柤鑼皑缂嶄礁鐣锋總鍛婂亜缂佸鐏濇导搴㈢節瀵伴攱婢橀埀顒佸姍瀹曟垿骞樼紙鐘电畾濡炪倖鍔х徊楣冨煕閹烘挷绻嗛柛娆忣槸婵秹鏌℃担瑙勫磳闁轰焦鎹囬弫鎾绘晸閿燂拷 */
    if(mailbox_index < 8 || mailbox_index > 10) {
        return ERROR;
    }
    
    /* 闂傚倸鍊搁崐鎼佸磹閹间礁纾归柟闂寸绾惧綊鏌熼梻瀵割槮缁炬儳缍婇弻鐔兼⒒鐎靛壊妲紒鐐劤濠€閬嶅焵椤掑倹鍤€閻庢凹鍙冨畷宕囧鐎ｃ劋姹楅梺鍦劋閸ㄥ綊宕愰悙鐑樺仭婵犲﹤鍠氬Ο鈧悗娈垮枟閹倸顕ｆ禒瀣垫晣闁绘柨鎼獮鎰版⒒娴ｈ鍋犻柛搴灦瀹曟洟鏌嗗鍡椻偓鍫曟煃閸濆嫬鏆熺痪鎯с偢閺岀喖鏌囬敃鈧鐐箾閸喓鐭掗柡灞糕偓宕囨殕闁逞屽墴瀹曚即寮介鐐电暫閻熸粍鏌ㄩ悾閿嬬附閸涘﹤浜滈梺鍛婄箓鐎氼剙鈻撻妷鈺傗拻闁稿本鐟чˇ锕傛煙鐠囇呯瘈鐎规洖婀遍幉鎾礋椤掆偓瀵潡姊洪崷顓℃闁哥姵鐗犻幃鈥愁潨閳ь剟寮婚悢鍛婄秶濡わ絽鍟宥夋⒑缁嬫鍎愰柛鏃€鐟╅獮鍐ㄎ旈崨顓熷祶濡炪倖鎸鹃崐顐﹀鎺虫禍婊堟煏婢舵稑顩紒鐘愁焽缁辨帗娼忛妸锕€闉嶉梺鐟板槻閹虫ê鐣烽锕€绀嬬痪鐗埫禍鍓р偓鍏夊亾闁告洦鍓涢崢閬嶆⒑闂堟胆褰掑磿閹惰棄鏄ラ柨婵嗘礌閸嬫挸鈻撻崹顔界亪濡炪値鍘鹃崗妯侯嚕椤愶箑绠涙い鎾跺仧缁愮偞绻濋悽闈浶㈤悗姘卞厴瀹曘儵宕ㄧ€涙ǚ鎷绘繛杈剧悼閹虫捇顢氬⿰鍛＜閻犲洦褰冮埀顒€娼￠悰顔藉緞婵炵偓顫嶉梺闈涚箳婵兘顢欓幒鏃傜＝闁稿本鐟ч崝宥嗐亜椤撶偞鍠樼€规洏鍨介獮鏍ㄦ媴閸忓瀚奸梻浣告啞缁嬫垿鏁冮敐鍥偨闂侇剙绉甸悡鏇㈡煟濡澧繛鍫熺矌閳ь剝顫夊ú姗€宕濆▎鎾跺祦闁搞儺鍓氶崑瀣煕椤愮姴鐏╂鐐村姍閺岋絾鎯旈垾鍐茶緟闂佺ǹ顑嗛幑鍥箖濡ゅ懏鏅查幖绮光偓鎰佹骄闂備椒绱粻鎴︽偋閹捐绠栨俊銈呭暞閸犲棝鏌涢弴銊ュ妞わ负鍔戦弻锝夊閳轰胶浠柣銏╁灣閸犳牠骞冨鈧獮鎺懳旀担鍝勫箺闂備胶绮崝鏇㈩敋椤撱垹鐓濋柟鍓х帛閻撳啰鎲稿⿰鍫濈婵炲棙鎸搁崒銊╂煛瀹ュ啫濡块柣婵嗙埣閺岋繝宕堕妷銉т痪闂佹娊鏀遍崹鍧楀蓟濞戞ǚ鏀介柛鈩冾殢娴尖偓闂備礁鐤囬褔藝閻㈢ǹ钃熸繛鎴炲焹閸嬫捇鏁嶉崡鐐叉殨濠㈣娲熷濠氬磼濞嗘帒鍘￠柡瀣典簼閵囧嫰骞嬪┑鍥舵＆濡ょ姷鍋為崝娆撶嵁閺嶃劎鐟瑰┑鐘插閳笺倖绻濋悽闈涒枅婵炰匠鍥舵晞闁圭増婢橀弸渚€鏌涢埄鍐姇闁绘挻娲熼幃姗€鎮欓幓鎺嗘寖闂佽桨鐒﹂悧鐘诲蓟閺囩喓绠鹃柣鎰靛墯閻濇洟姊洪幎鑺ユ暠闁搞劌娼″璇测槈濡攱鏂€闂佺硶鍓濋〃蹇斿閸屾凹娓婚柕鍫濋娴滃墽绱掗悩铏磳鐎殿喛顕ч埥澶愬閻樼數娼夐梻渚€鈧偛鑻晶瀵糕偓瑙勬礀缂嶅﹤鐣风粙璇炬棃宕橀妸褋鍋婇梻鍌欑閹诧繝宕濋敃鍌氱獥闁哄稁鍙忕紞鏍煕濞戞鎽犻柣鎾崇箻閺屾盯顢曢敐鍥╃暫闂侀潻绲藉﹢杈╂閹烘绠涙い鎾跺Л婵洨绱撴担铏瑰笡缂佽鐗撻獮鍐╃鐎ｎ偒妫冨┑鐐殿棎缂堜即宕规禒瀣畺婵°倐鍋撴い顐ｇ箞濮婅崵鈧潧鎲￠弲鍏肩節绾版ǚ鍋撻崘鑼獓闂佸憡姊归悷銉╊敋閿濆绠绘い鏃傗拡濞煎﹪姊洪幎鑺ユ殰闁稿鎹囬弻鐔割槹鎼达絽绗＄紓浣虹帛缁嬫帒顭囪箛娑樼鐟滃秹宕哄畝鍕拺缁绢厼鎳庤缂備緡鍠栧ù鐑藉礆閹烘绫嶉柛顐ゅ枎閳ь剛绮穱濠囶敍閻愬瓨鐝崇紓浣靛妼椤嘲顫忓ú顏咁棃婵炴垼椴搁鍡涙⒒閸屾艾顏╅悗姘煎墴閹儳鐣￠幍顔芥畷闂侀€炲苯澧撮柛鈹惧亾濡炪倖甯掗崰姘焽閹邦厾绠鹃柛娆忣檧閼板潡鏌曢崱妤€鏆ｇ€规洏鍔嶅蹇涘礈瑜忛埣銈嗙節閻㈤潧孝闁挎洏鍊濋幃褔宕卞☉娆忊偓鍧楁煕椤垵浜栧ù婊勭矒閺岀喖宕崟顒夋婵炲瓨绮嶉崕鎶解€旈崘顔嘉ч柛鈩冾焽閳规稓绱撻崒姘毙＄紒鑸靛哺婵″瓨绗熼埀顒€顕ｉ幘顔碱潊闁斥晛鍟悵鏍⒒娓氣偓閳ь剛鍋涢懟顖涙櫠閹殿喚纾兼い鏃傗拡閻撳ジ鏌熺粵鍦瘈濠碘€崇埣瀹曞爼鍩＄€ｎ剟妫峰┑鐘垫暩閸嬬娀骞撻鍡欑濞撴埃鍋撴い銏℃崌瀹曟儼顧佹繛灏栨櫊閹銈﹂幐搴哗濡炪倖鏌ㄥú顓烆潖濞差亝鐒婚柣鎰蔼鐎氭澘顭胯閻°劑骞堥妸锔剧瘈闁告劏鏂傛禒銏ゆ⒑閸︻収鍔滅紒缁樼箖娣囧﹪宕奸弴鐐茬獩闂佸憡渚楅崑鍕倶閺屻儲鐓涚€光偓閳ь剟宕伴幘璇茬獥濠电姴娲ょ涵鈧梺缁樺姈濠㈡﹢寮搁崼鐔剁箚闁靛牆娲ゅ暩闂佺ǹ顑囬崑銈夊箖瑜旈幃鈺佇ч崶锝呬壕濞撴埃鍋撶€殿喗鎸虫慨鈧柍鈺佸暞閻濇洟姊绘担钘壭撻柨姘亜閿旇鏋ら柤娲憾瀹曞綊顢曢妶鍥╂闂備焦鐪归崹钘夘焽瑜庣粋鎺楁晝閸屾稓鍘卞銈庡幗閸ㄧ敻鎮橀敂閿亾鐟欏嫭绀堥柟铏尵閸欏懎顪冮妶鍛闁瑰啿瀛╃粋宥呂旈崨顔规嫼闂傚倸鐗婃笟妤€危閹绢喗鐓涢柛娑卞枤閻帡鏌熼鍡欑瘈闁诡喓鍨藉畷妤呮嚃閳轰礁绠伴梻鍌欑劍閹爼宕曢鈧鎻掆槈濞嗘埈娴勫┑鐘诧工閻楀﹪鎮￠崘顏呭枑婵犲﹤鐗嗙粈鍫熺箾閸℃鐛滈柤鏉挎健濮婃椽顢楅埀顒傜矓閹绢喗鍊块柛顭戝亖娴滄粓鏌熼崫鍕ラ柛蹇撶焸閺屾盯鎮㈤崫銉ュ绩闂佸搫鐬奸崰鏍х暦濞嗘挸围闁糕剝顨忔导锟� */
    mailbox_code = can_mailbox_code_get(CAN2, mailbox_index);
    if(mailbox_code != CAN_MB_TX_STATUS_INACTIVE) {
        return ERROR; /* 闂傚倸鍊搁崐鎼佸磹閹间礁纾归柟闂寸绾惧綊鏌熼梻瀵割槮缁炬儳缍婇弻鐔兼⒒鐎靛壊妲紒鐐劤濠€閬嶅焵椤掑倹鍤€閻庢凹鍙冨畷宕囧鐎ｃ劋姹楅梺鍦劋閸ㄥ綊宕愰悙鐑樺仭婵犲﹤鍠氬Ο鈧悗娈垮枟閹倸顕ｆ禒瀣垫晣闁绘柨鎼獮鎰版⒒娴ｈ鍋犻柛搴灦瀹曟洟鏌嗗鍡椻偓鍫曟煃閸濆嫬鏆熺痪鎯с偢閺岀喖鏌囬敃鈧鐐箾閸喓鐭掗柡灞糕偓宕囨殕闁逞屽墴瀹曚即寮介鐐电暫閻熸粍鏌ㄩ悾閿嬬附閸涘﹤浜滈梺鍛婄箓鐎氼剙鈻撻妷鈺傗拻闁稿本鐟чˇ锕傛煙鐠囇呯瘈鐎规洖婀遍幉鎾礋椤掆偓瀵潡姊洪崷顓℃闁哥姵鐗犻幃鈥愁潨閳ь剟寮婚悢鍛婄秶濡わ絽鍟宥夋⒑缁嬫鍎愰柛鏃€鐟╅獮鍐ㄎ旈崨顓熷祶濡炪倖鎸鹃崐顐﹀鎺虫禍婊堟煏婢舵稑顩紒鐘愁焽缁辨帗娼忛妸锕€闉嶉梺鐟板槻閹虫ê鐣烽锕€绀嬬痪鐗埫禍鍓р偓鍏夊亾闁告洦鍓涢崢閬嶆⒑闂堟胆褰掑磿閹惰棄鏄ラ柨婵嗘礌閸嬫挸鈻撻崹顔界亪濡炪値鍘鹃崗妯侯嚕椤愶箑绠涙い鎾跺仧缁愮偞绻濋悽闈浶㈤悗姘卞厴瀹曘儵宕ㄧ€涙ǚ鎷绘繛杈剧悼閹虫捇顢氬⿰鍛＜閻犲洦褰冮埀顒€娼￠悰顔藉緞婵炵偓顫嶉梺闈涚箳婵兘顢欓幒鏃傜＝闁稿本鐟ч崝宥嗐亜椤撶偞鍠樼€规洏鍨介獮鏍ㄦ媴閸忓瀚奸梻浣告啞缁嬫垿鏁冮敐鍥偨闂侇剙绉甸悡鏇㈡煟濡澧繛鍫熺矌閳ь剝顫夊ú姗€宕濆▎鎾跺祦闁搞儺鍓氶崑瀣煕椤愮姴鐏╂鐐村姍閺岋絾鎯旈垾鍐茶緟闂佺ǹ顑嗛幑鍥箖濡ゅ懏鏅查幖绮光偓鎰佹骄闂備椒绱粻鎴︽偋閹捐绠栨俊銈呭暞閸犲棝鏌涢弴銊ュ妞わ负鍔戦弻锝夊閳轰胶浠柣銏╁灣閸犳牠骞冨鈧獮鎺懳旀担鍝勫箺闂備胶绮崝鏇㈩敋椤撱垹鐓濋柟鍓х帛閻撳啰鎲稿⿰鍫濈婵炲棙鎸搁崒銊╂煛瀹ュ啫濡块柣婵嗙埣閺岋繝宕堕妷銉т痪闂佹娊鏀遍崹鍧楀蓟濞戞ǚ鏀介柛鈩冾殢娴尖偓闂備礁鐤囬褔藝閻㈢ǹ钃熸繛鎴炲焹閸嬫捇鏁嶉崡鐐叉殨濠㈣娲熷濠氬磼濞嗘帒鍘￠柡瀣典簼閵囧嫰骞嬪┑鍥舵＆濡ょ姷鍋為崝娆撶嵁閺嶃劎鐟瑰┑鐘插閳笺倖绻濋悽闈涒枅婵炰匠鍏犲綊宕掑鑲╁姺濠电偛妫欓幐濠氭偂濞戞埃鍋撻獮鍨姎闁哥噥鍋呮穱濠冪鐎ｎ偆鍘搁梺绯曞墲閻熴儲绂掕缁辨帗娼忛妸锕€纾抽悗瑙勬礃鐢帡鍩㈡惔銊ョ闁瑰瓨绻傞懙鎰節閻㈤潧校妞ゆ梹鐗犲畷鏉款潩鐠虹儤鐎梺鍛婄缚閸庨亶宕瑰┑鍥╃闁糕剝蓱鐏忣厾绱掗悪鍛М闁哄被鍔戝鏉懳旈埀顒佺妤ｅ啯鈷戠紓浣股戠亸鎵磼鐠囪尙澧﹂柣娑卞櫍瀵粙鈥栭妷銉╁弰妞ゃ垺顨婇崺鈧い鎺嶆缁诲棝鏌ゅù瀣珖缁炬儳銈搁弻锝呪枎韫囨柨娅х紓浣割儏椤兘寮婚弴銏犵倞鐟滃秹顢旈鐕佹闁绘劖鎯岄悞浠嬫煙閻熸澘顏柟顔界矊铻ｉ悘蹇旂墪娴滈箖鏌熼鍡楁湰鐎靛矂姊洪棃娑氬婵☆偅鐟╄棢闁哄稁鍘介悡娆撴煕閹存瑥鈧牜鈧熬鎷� */
    }
    
    
