kyckyckyc/DGM/src/gd32g5x3_init.c
    /* 闂傚倸鍊搁崐鎼佸磹閹间礁纾归柟闂寸绾惧綊鏌熼梻瀵割槮缁炬儳缍婇弻鐔兼⒒鐎靛壊妲紒鐐劤濠€閬嶅焵椤掑倹鍤€閻庢凹鍙冨畷宕囧鐎ｃ劋姹楅梺鍦劋閸ㄥ綊宕愰悙鐑樺仭婵犲﹤鍠氬Ο鈧悗娈垮枟閹倸顕ｆ禒瀣垫晣闁绘柨鎼獮鎰版⒒娴ｈ鍋犻柛搴灦瀹曟洟鏌嗗鍡椻偓鍫曟煃閸濆嫬鏆熺痪鎯с偢閺岀喖鏌囬敃鈧鐐箾閸喓鐭掗柡灞糕偓宕囨殕闁逞屽墴瀹曚即寮介鐐电暫閻熸粍鏌ㄩ悾閿嬬附閸涘﹤浜滈梺鍛婄箓鐎氼剙鈻撻妷鈺傗拻闁稿本鐟чˇ锕傛煙鐠囇呯瘈鐎规洖婀遍幉鎾礋椤掆偓瀵潡姊洪崷顓℃闁哥姵鐗犻幃鈥愁潨閳ь剟寮婚悢鍛婄秶濡わ絽鍟宥夋⒑缁嬫鍎愰柛鏃€鐟╅獮鍐ㄎ旈崨顓熷祶濡炪倖鎸鹃崐顐﹀鎺虫禍婊堟煏婢舵稑顩紒鐘愁焽缁辨帗娼忛妸锕€闉嶉梺鐟板槻閹虫ê鐣烽锕€绀嬬痪鐗埫禍鍓р偓鍏夊亾闁告洦鍓涢崢閬嶆⒑闂堟胆褰掑磿閹惰棄鏄ラ柨婵嗘礌閸嬫挸鈻撻崹顔界亪濡炪値鍘鹃崗妯侯嚕椤愶箑绠涙い鎾跺仧缁愮偞绻濋悽闈浶㈤悗姘卞厴瀹曘儵宕ㄧ€涙ǚ鎷绘繛杈剧悼閹虫捇顢氬⿰鍛＜閻犲洦褰冮埀顒€娼￠悰顔藉緞婵炵偓顫嶉梺闈涚箳婵兘顢欓幒鏃傜＝闁稿本鐟ч崝宥嗐亜椤撶偞鍠樼€规洏鍨介獮鏍ㄦ媴閸忓瀚奸梻浣告啞缁嬫垿鏁冮敐鍥偨闂侇剙绉甸悡鏇㈡煟濡澧繛鍫熺矌閳ь剝顫夊ú姗€宕濆▎鎾跺祦闁搞儺鍓氶崑瀣煕椤愮姴鐏╂鐐村姍閺岋絾鎯旈垾鍐茶緟闂佺ǹ顑嗛幑鍥箖濡ゅ懏鏅查幖绮光偓鎰佹骄闂備椒绱粻鎴︽偋閹捐绠栨俊銈呭暞閸犲棝鏌涢弴銊ュ妞わ负鍔戦弻锝夊閳轰胶浠柣銏╁灣閸犳牠骞冨鈧獮鎺懳旀担鍝勫箺闂備胶绮崝鏇㈩敋椤撱垹鐓濋柟鍓х帛閻撳啰鎲稿⿰鍫濈婵炲棙鎸搁崒銊╂煛瀹ュ啫濡块柣婵嗙埣閺岋繝宕堕妷銉т痪闂佹娊鏀遍崹鍧楀蓟濞戞ǚ鏀介柛鈩冾殢娴尖偓闂備礁鐤囬褔藝閻㈢ǹ钃熸繛鎴炲焹閸嬫捇鏁嶉崡鐐叉殨濠㈣娲熷濠氬磼濞嗘帒鍘￠柡瀣典簼閵囧嫰骞嬪┑鍥舵＆濡ょ姷鍋為崝娆撶嵁閺嶃劎鐟瑰┑鐘插閳笺倖绻濋悽闈涒枅婵炰匠鍥舵晞闁圭増婢橀弸渚€鏌涢埄鍐姇闁绘挻娲熼幃姗€鎮欓幓鎺嗘寖闂佽桨鐒﹂悧鐘诲蓟閺囩喓绠鹃柣鎰靛墯閻濇洟姊洪幎鑺ユ暠闁搞劌娼″璇测槈濡攱鏂€闂佺硶鍓濋〃蹇斿閸屾凹娓婚柕鍫濋娴滃墽绱掗悩铏磳鐎殿喛顕ч埥澶愬閻樼數娼夐梻渚€鈧偛鑻晶瀵糕偓瑙勬礀缂嶅﹤鐣风粙璇炬棃宕橀妸褋鍋婇梻鍌欑閹诧繝宕濋敃鍌氱獥闁哄稁鍙忕紞鏍煕濞戞鎽犻柣鎾崇箻閺屾盯顢曢敐鍥╃暫闂侀潻绲藉﹢杈╂閹烘绠涙い鎾跺Л婵洨绱撴担铏瑰笡缂佽鐗撻獮鍐╃鐎ｎ偒妫冨┑鐐殿棎缂堜即宕规禒瀣畺婵°倐鍋撴い顐ｇ箞濮婅崵鈧潧鎲￠弲鍏肩節绾版ǚ鍋撻崘鑼獓闂佸憡姊归悷銉╊敋閿濆绠绘い鏃傗拡濞煎﹪姊洪幎鑺ユ殰闁稿鎹囬弻鐔割槹鎼达絽绗＄紓浣虹帛缁嬫帒顭囪箛娑樼鐟滃秹宕哄畝鍕拺缁绢厼鎳庤缂備緡鍠栧ù鐑藉礆閹烘绫嶉柛顐ゅ枎閳ь剛绮穱濠囶敍閻愬瓨鐝崇紓浣靛妼椤嘲顫忓ú顏咁棃婵炴垼椴搁鍡涙⒒閸屾艾顏╅悗姘煎墴閹儳鐣￠幍顔芥畷闂侀€炲苯澧撮柛鈹惧亾濡炪倖甯掗崰姘焽閹邦厾绠鹃柛娆忣檧閼板潡鏌曢崱妤€鏆ｇ€规洏鍔嶅蹇涘礈瑜忛埣銈嗙節閻㈤潧孝闁挎洏鍊濋幃褔宕卞☉娆忊偓鍧楁煕椤垵浜栧ù婊勭矒閺岀喖宕崟顒夋婵炲瓨绮嶉崕鎶解€旈崘顔嘉ч柛鈩冾焽閳规稓绱撻崒姘毙＄紒鑸靛哺婵″瓨绗熼埀顒€顕ｉ幘顔碱潊闁斥晛鍟悵鏍⒒娓氣偓閳ь剛鍋涢懟顖涙櫠閹殿喚纾兼い鏃傗拡閻撳ジ鏌熺粵鍦瘈濠碘€崇埣瀹曞爼鍩＄€ｎ剟妫峰┑鐘垫暩閸嬬娀骞撻鍡欑闁逞屽墴閺屾稓鈧綆浜滈埀顒€娼￠悰顔锯偓锝庝簴閺€浠嬫煕閹般劍娅囬柍褜鍓氬钘夘潖濞差亝顥堟繛鎴炴皑閻ゅ嫰姊虹粙鍖℃敾闁绘濞€瀹曞搫鈽夐姀鐘殿吅闂佹寧妫佸Λ鍕椤栫偞鈷戦悹鍥ｂ偓鍐茬闁汇埄鍨辩敮妤佺┍婵犲洤绀傞柤娴嬫櫇椤旀洟姊洪崨濠佺繁闁哥姵鐗楅幈銊ヮ吋婢跺鍘搁悗鍏夊亾闁逞屽墴瀹曚即寮借閺嗭附绻涢崱妯诲碍閸ユ挳姊虹化鏇炲⒉妞ゃ劌绻戠€靛ジ鏁撻敓锟� */
    for(int i = 0; i < length; i++) {
        can2transmit_message.data[i] = can2txdata[i];
    }
    
    /* 闂傚倸鍊搁崐鎼佸磹閹间礁纾归柟闂寸绾惧綊鏌熼梻瀵割槮缁炬儳缍婇弻鐔兼⒒鐎靛壊妲紒鐐劤濠€閬嶅焵椤掑倹鍤€閻庢凹鍙冨畷宕囧鐎ｃ劋姹楅梺鍦劋閸ㄥ綊宕愰悙鐑樺仭婵犲﹤鍠氬Ο鈧悗娈垮枟閹倸顕ｆ禒瀣垫晣闁绘柨鎼獮鎰版⒒娴ｈ鍋犻柛搴灦瀹曟洟鏌嗗鍡椻偓鍫曟煃閸濆嫬鏆熺痪鎯с偢閺岀喖鏌囬敃鈧鐐箾閸喓鐭掗柡灞糕偓宕囨殕闁逞屽墴瀹曚即寮介鐐电暫閻熸粍鏌ㄩ悾閿嬬附閸涘﹤浜滈梺鍛婄箓鐎氼剙鈻撻妷鈺傗拻闁稿本鐟чˇ锕傛煙鐠囇呯瘈鐎规洖婀遍幉鎾礋椤掆偓瀵潡姊洪崷顓℃闁哥姵鐗犻幃鈥愁潨閳ь剟寮婚悢鍛婄秶濡わ絽鍟宥夋⒑缁嬫鍎愰柛鏃€鐟╅獮鍐ㄎ旈崨顓熷祶濡炪倖鎸鹃崐顐﹀鎺虫禍婊堟煏婢舵稑顩紒鐘愁焽缁辨帗娼忛妸锕€闉嶉梺鐟板槻閹虫ê鐣烽锕€绀嬬痪鐗埫禍鍓р偓鍏夊亾闁告洦鍓涢崢閬嶆⒑闂堟胆褰掑磿閹惰棄鏄ラ柨婵嗘礌閸嬫挸鈻撻崹顔界亪濡炪値鍘鹃崗妯侯嚕椤愶箑绠涙い鎾跺仧缁愮偞绻濋悽闈浶㈤悗姘卞厴瀹曘儵宕ㄧ€涙ǚ鎷绘繛杈剧悼閹虫捇顢氬⿰鍛＜閻犲洦褰冮埀顒€娼￠悰顔藉緞婵炵偓顫嶉梺闈涚箳婵兘顢欓幒鏃傜＝闁稿本鐟ч崝宥嗐亜椤撶偞鍠樼€规洏鍨介獮鏍ㄦ媴閸忓瀚奸梻浣告啞缁嬫垿鏁冮敐鍥偨闂侇剙绉甸悡鏇㈡煟濡澧繛鍫熺矌閳ь剝顫夊ú姗€宕濆▎鎾跺祦闁搞儺鍓氶崑瀣煕椤愮姴鐏╂鐐村姍閺岋絾鎯旈垾鍐茶緟闂佺ǹ顑嗛幑鍥箖濡ゅ懏鏅查幖绮光偓鎰佹骄闁荤偞鐔梽鍕┍婵犲洦鍊锋い蹇撳閸嬫捇骞嬮敃鈧崹鍌炴煟閹寸儐鐒藉ù鐘崇娣囧﹪鎮欓鍕ㄥ亾瑜斿浠嬪礋椤旇桨姹楅梺鍛婂姦閸犳绮婚幒鎾剁瘈闁汇垽娼у瓭闂佹寧娲忛崐妤呭焵椤掍礁鍤柛锝忕秮楠炲棗鐣濋崟顐ゎ唺濠德板€撻懗鍫曞储閹间焦鐓熼煫鍥ㄦ礀娴犳粌顭胯濡嫮鍙呴梺鍝勵槹閸ㄧ喖寮ㄦ禒瀣厓闁靛鍎抽敍宥夋煕閳哄鎮奸柍褜鍓濋～澶娒洪弽褏鏆︽い鎺戝閻撴繈骞栧ǎ顒€鈧鎮块埀顒佺節閻㈤潧孝闁哥噥鍋婇、鏃堫敍濞戞氨鐦堥悗鍏稿嵆閺€鍗烆熆濮椻偓閸┾偓妞ゆ帊绶″▓鏇㈡煙娓氬灝濮傞柟顔界矒閹稿﹥寰勫畝瀣耿濠电姷鏁搁崑鐐哄垂閸撲礁鏋堢€广儱鎳愰弳锕傛煕濞嗗浚妲归柛娆忕箲娣囧﹪鎮欐０婵嗘婵炲瓨绮嶉崕瀹犵亙闂佺粯锕㈠褎绂掑⿰鍫熺厱闁绘洑绀佹禍浼存煏閸偂绨奸悗闈涖偢瀵爼骞嬮敃鈧弫褰掓⒒娴ｈ櫣甯涙俊顐㈠暣瀵劑鏌嗗鍡椾痪闂佸憡绋戦悺銊╁煕閹烘垯鈧帒顫濋敐鍛婵犵數鍋橀崠鐘诲吹闊彃濮傞柛鈹惧亾濡炪倖甯掔€氼參鍩涢幒妤佺厱闁哄洢鍔屾禍婊勩亜韫囷絽骞楅柕鍥у婵偓闁斥晛鍠氬Λ鍐⒑鐠団€虫灁闁搞劏妫勯悾宄拔旈崘褏鍓ㄩ梺鍝勭Р閸斿矂顢斿ú顏呪拻闁稿本鐟ㄩ崗宀勫几椤忓牊鐓涢柛顐亜婢ф挳鏌熼鐐効妞わ箑顕槐鎺楊敋閸℃瑧袦閻庢鍣崳锝夊春閳ь剚銇勯幒鎴濐仼濡楀懘姊洪崨濠冨闁搞劑浜跺鏌ュ蓟閵壯冨絼闂佹悶鍎崝宥夊箚閸曨剛绠剧€瑰壊鍠栧顕€鏌熼绛嬫疁鐎规洖缍婇、鏇㈡晲閸パ冩闂傚倷鐒︾€笛兠鸿箛娑樼？闁规儼妫勭粻鏌ユ煏韫囨洖袥闁衡偓娴犲鐓曢柍閿亾闁哄懏绮撳畷鎾绘偨閸涘ň鎷虹紓浣割儓濞夋洜绮绘导瀛樼厱婵﹩鍓﹂崕蹇涙煃鐠囪尙效鐎殿噮鍣ｉ崺鈧い鎺戝€瑰畷鍙夌節闂堟侗鍎愰柛瀣ㄥ姂濮婂宕奸悢宄扮€梺闈涚箞閸婃牠鎮￠妷鈺傜厸闁搞儺鐓侀鍫濈劦妞ゆ帊鑳剁粻鐐搭殽閻愭彃鏆㈡い锕€婀遍埀顒冾潐濞叉牕鐣烽鍕厺閹兼番鍔岀粻锝嗙節婵犲倹鍣介柟鑼嚀閳规垿鏁嶉崟顐℃澀闂佺ǹ锕ラ悧鐘诲箖瑜嶉オ浼村醇濠靛牞绱遍梻浣虹帛閸旀宕曢妶澶婄；闁稿瞼鍋為悡鐔兼煛閸屾氨浠㈤柟顔藉灴閺岋綁骞樼€靛憡鍣伴悗娈垮枛閻栫厧鐣烽悡搴樻斀闁糕€崇箲鐎垫牠姊绘担鍛婂暈閻㈩垱顨嗙粩鐔煎幢濞戞鐣哄銈嗘⒒閳峰牆顭囬埡鍛厾闁告縿鍎洪弳顖炴煙闁垮銇濇慨濠冩そ瀹曘劍绻濋崟顓犳殼闂佽瀛╅崙褰掑矗閸愩劎鏆﹂柛鎰梿濞差亶鏁傞柛娑卞灠楠炲秵淇婇悙顏勨偓鏍ь潖婵犳艾鍌ㄧ憸鏃堝春閳ь剚銇勯幒鍡椾壕闂佽绻戠换鍫ャ€佸鑸垫櫜闁糕剝鐟ч惁鍫濃攽椤旀枻渚涢柛妯挎閳诲秹濮€閵堝棌鎷虹紓鍌欑劍閵嗘帡宕烽婵堝墾濠电偛妫欓幐濠氬疾椤掍胶绡€濠电姴鍊搁弳濠囨煛閳ь剚绂掔€ｎ偆鍘撻梺鑺ッˇ浼此夊⿰鍫熺厽闊洤顑呴崝锕傛煛鐏炵偓绀嬬€规洝绮剧粻娑㈠箻閹绘帩妫滈梻鍌氬€搁崐鐑芥嚄閼哥數浠氭俊鐐€栭崹闈浳涘┑瀣祦闁硅揪绠戦悙濠勬喐濠婂牆鍚归柡鍥╀紳瑜版帗鍋愮€瑰壊鍠栭崜楣冩⒑鏉炴壆顦﹂柛鐔告尦瀵鏁愭径濠勭潉闂佹悶鍎崝蹇涘触閸屾稓绡€闁靛骏缍嗗鎰箾閸欏澧甸柛鈺冨仱楠炲鏁傜紒妯绘珦缂傚倷鐒︾粙鎴︻敄閸ヮ剙绀夐柣鎴ｅГ閳锋垹绱掔€ｎ偒鍎ラ柛搴㈠姍閺岀喖骞栨担铏规毇闂佺硶鏂侀崑鎾愁渻閵堝棗绗傞柤鍐茬埣瀹曨垶寮婚妷锔惧幍闂佸憡鍨崐鏍偓姘炬嫹 */
    can2transmit_message.rtr = 0U;
    can2transmit_message.ide = 0U;
    can2transmit_message.code = CAN_MB_TX_STATUS_DATA;
    can2transmit_message.brs = 0U;
    can2transmit_message.fdf = 0U;
    can2transmit_message.esi = 0U;
    can2transmit_message.prio = 0U;
    can2transmit_message.data_bytes = length;
    can2transmit_message.id = id;
    
    /* 闂傚倸鍊搁崐鎼佸磹閹间礁纾归柟闂寸绾惧綊鏌熼梻瀵割槮缁炬儳缍婇弻鐔兼⒒鐎靛壊妲紒鐐劤濠€閬嶅焵椤掑倹鍤€閻庢凹鍙冨畷宕囧鐎ｃ劋姹楅梺鍦劋閸ㄥ綊宕愰悙鐑樺仭婵犲﹤鍠氬Ο鈧悗娈垮枟閹倸顕ｆ禒瀣垫晣闁绘柨鎼獮鎰版⒒娴ｈ鍋犻柛搴灦瀹曟洟鏌嗗鍡椻偓鍫曟煃閸濆嫬鏆熺痪鎯с偢閺岀喖鏌囬敃鈧鐐箾閸喓鐭掗柡灞糕偓宕囨殕闁逞屽墴瀹曚即寮介鐐电暫閻熸粍鏌ㄩ悾閿嬬附閸涘﹤浜滈梺鍛婄箓鐎氼剙鈻撻妷鈺傗拻闁稿本鐟чˇ锕傛煙鐠囇呯瘈鐎规洖婀遍幉鎾礋椤掆偓瀵潡姊洪崷顓℃闁哥姵鐗犻幃鈥愁潨閳ь剟寮婚悢鍛婄秶濡わ絽鍟宥夋⒑缁嬫鍎愰柛鏃€鐟╅獮鍐ㄎ旈崨顓熷祶濡炪倖鎸鹃崐顐﹀鎺虫禍婊堟煏婢舵稑顩紒鐘愁焽缁辨帗娼忛妸锕€闉嶉梺鐟板槻閹虫ê鐣烽锕€绀嬬痪鐗埫禍鍓р偓鍏夊亾闁告洦鍓涢崢閬嶆⒑闂堟胆褰掑磿閹惰棄鏄ラ柨婵嗘礌閸嬫挸鈻撻崹顔界亪濡炪値鍘鹃崗妯侯嚕椤愶箑绠涙い鎾跺仧缁愮偞绻濋悽闈浶㈤悗姘卞厴瀹曘儵宕ㄧ€涙ǚ鎷绘繛杈剧悼閹虫捇顢氬⿰鍛＜閻犲洦褰冮埀顒€娼￠悰顔藉緞婵炵偓顫嶉梺闈涚箳婵兘顢欓幒鏃傜＝闁稿本鐟ч崝宥嗐亜椤撶偞鍠樼€规洏鍨介獮鏍ㄦ媴閸忓瀚奸梻浣告啞缁嬫垿鏁冮敐鍥偨闂侇剙绉甸悡鏇㈡煟濡澧繛鍫熺矌閳ь剝顫夊ú姗€宕濆▎鎾跺祦闁搞儺鍓氶崑瀣煕椤愮姴鐏╂鐐村姍閺岋絾鎯旈垾鍐茶緟闂佺ǹ顑嗛幑鍥箖濡ゅ懏鏅查幖绮光偓鎰佹骄闂備椒绱粻鎴︽偋閹捐绠栨俊銈呭暞閸犲棝鏌涢弴銊ュ妞わ负鍔戦弻锝夊閳轰胶浠柣銏╁灣閸犳牠骞冨鈧獮鎺懳旀担鍝勫箺闂備胶绮崝鏇㈩敋椤撱垹鐓濋柟鍓х帛閻撳啰鎲稿⿰鍫濈婵炲棙鎸搁崒銊╂煛瀹ュ啫濡块柣婵嗙埣閺岋繝宕堕妷銉т痪闂佹娊鏀遍崹鍧楀蓟濞戞ǚ鏀介柛鈩冾殢娴尖偓闂備礁鐤囬褔藝閻㈢ǹ钃熸繛鎴炲焹閸嬫捇鏁嶉崡鐐叉殨濠㈣娲熷濠氬磼濞嗘帒鍘￠柡瀣典簼閵囧嫰骞嬪┑鍥舵＆濡ょ姷鍋為崝娆撶嵁閺嶃劎鐟瑰┑鐘插閳笺倖绻濋悽闈涒枅婵炰匠鍥舵晞闁圭増婢橀弸渚€鏌涢埄鍐姇闁绘挻娲熼幃姗€鎮欓幓鎺嗘寖闂佽桨鐒﹂悧鐘诲蓟閺囩喓绠鹃柣鎰靛墯閻濇洟姊洪幎鑺ユ暠闁搞劌娼″璇测槈濡攱鏂€闂佺硶鍓濋〃蹇斿閸屾凹娓婚柕鍫濋娴滃墽绱掗悩铏磳鐎殿喛顕ч埥澶愬閻樼數娼夐梻渚€鈧偛鑻晶瀵糕偓瑙勬礀缂嶅﹤鐣风粙璇炬棃宕橀妸褋鍋婇梻鍌欑閹诧繝宕濋敃鍌氱獥闁哄稁鍙忕紞鏍煕濞戞鎽犻柣鎾崇箻閺屾盯顢曢敐鍥╃暫闂侀潻绲藉﹢杈╂閹烘绠涙い鎾跺Л婵洨绱撴担铏瑰笡缂佽鐗撻獮鍐╃鐎ｎ偒妫冨┑鐐殿棎缂堜即宕规禒瀣畺婵°倐鍋撴い顐ｇ箞濮婅崵鈧潧鎲￠弲鍏肩節绾版ǚ鍋撻崘鑼獓闂佸憡姊归悷銉╊敋閿濆绠绘い鏃傗拡濞煎﹪姊洪幎鑺ユ殰闁稿鎹囬弻鐔割槹鎼达絽绗＄紓浣虹帛缁嬫帒顭囪箛娑樼鐟滃秹宕哄畝鍕拺缁绢厼鎳庤缂備緡鍠栧ù鐑藉礆閹烘绫嶉柛顐ゅ枎閳ь剛绮穱濠囶敍閻愬瓨鐝崇紓浣靛妼椤嘲顫忓ú顏咁棃婵炴垼椴搁鍡涙⒒閸屾艾顏╅悗姘煎墴閹儳鐣￠幍顔芥畷闂侀€炲苯澧撮柛鈹惧亾濡炪倖甯掗崰姘焽閹邦厾绠鹃柛娆忣檧閼板潡鏌曢崱妤€鏆ｇ€规洏鍔嶅蹇涘礈瑜忛埣銈嗙節閻㈤潧孝闁挎洏鍊濋幃褔宕卞☉娆忊偓鍧楁煕椤垵浜栧ù婊勭矒閺岀喖宕崟顒夋婵炲瓨绮嶉崕鎶解€旈崘顔嘉ч柛鈩冾焽閳规稓绱撻崒姘毙＄紒鑸靛哺婵″瓨绗熼埀顒€顕ｉ幘顔碱潊闁斥晛鍟悵鏍⒒娓氣偓閳ь剛鍋涢懟顖涙櫠閹殿喚纾兼い鏂垮⒔鐢稓绱掔紒妯肩畵妞ゎ偅绻堥、姗€鎮欓弶鍨嚙闂傚倸鍊烽悞锕傚箖閸洖纾块柣鎴烆焽椤╁弶绻濇繝鍌滃闁稿骸绉归弻锝夊箣閻愬啯绮嶇粋宥呪堪閸喓鍘甸梺璇″瀻閸涱喗鍠栭梻渚€娼уú锔炬崲閸愵喖绠為柕濠忓缁♀偓闂佸憡鍔忛弬鍌涚閵忋倖鍊甸悷娆忓缁€鍫ユ煕韫囨棑鑰块柕鍡曠椤粓鍩€椤掑嫬绠栨繛鍡樻尭缁犵敻鏌熼悜妯肩畼闁逞屽墴娴滆泛顫忔繝姘＜婵炲棙鍨垫俊浠嬫⒑鐠団€虫灈闁绘牜鍘ч悾宄扳攽婵犲嫮鏉稿┑鐐村灦椤洭鏁嶅☉銏♀拺闁革富鍘奸。鍏肩節閵忊槄鑰块柟顔惧仱瀹曞綊顢曢悩杈╃泿闂備胶鎳撻幖顐ょ矓閻戣棄绀傞悘鐐板嫎娴滄粓鏌ㄥ┑鍡橆棤闁告瑢鍋撻梻浣告惈閻绱炴笟鈧獮鍐閵堝懐鐓戞繝銏ｆ硾椤戝洩銇愰崨顔荤箚闁绘劦浜滈埀顑惧€濆畷鎴﹀礋椤撶喎搴婂┑顔姐仜閸嬫挻顨ラ悙瀵稿⒌鐎规洜鍏橀、姗€鎮㈤柨瀣偓顓㈡⒒娴ｅ憡鍟炴繛璇х畵瀹曟垿宕卞☉娆愭珫闂婎偄娲︾粙鎺楀煕閹烘垯鈧帒顫濋敐鍛婵犵數鍋橀崠鐘诲礋椤撴繄娉婇梻鍌氬€烽懗鑸电仚闁诲孩绋堥弲鐘诲箖閿熺姵鏅搁柣妯垮皺閻ｅ搫鈹戞幊閸婃捇姊藉澶婄；闁告稑鐡ㄩ悡鏇㈡煙閼割剙濡介柡澶婄秺閺岀喖鏌ㄧ€ｎ偁浠㈠┑顔硷攻濡炶棄鐣烽妸锔剧瘈闁告洦鍘鹃弳銈夋⒑鐠囨彃顒㈡慨妯稿姂瀹曟螣閾忚娈鹃梺鍝勬祫缁辨洟鎮块埀顒勬⒑閸濆嫬鈧粙顢欐繝鍕С閻犲洤妯婂〒濠氭煏閸繃顥為悘蹇涙涧閳规垿顢欓懞銉ュ攭閻庤娲忛崹浠嬬嵁濮椻偓椤㈡瑩鎮剧仦钘夌濠电姷鏁搁崑鐐哄垂闂堟稓鏆︽い鎺戝閸戠娀鏌ㄩ弬鍨挃缁炬儳銈搁弻锝呂熼搹鐧哥礊闂佸疇妫勯ˇ鐢稿蓟瀹ュ瀵犲鑸瞪戠瑧闂備礁鐤囬褍顫濋敂鍓т笉婵炴垶鐟х弧鈧梺绋挎湰閻熴儵藟濮橆兘鏀介柣妯虹仛閺嗏晛鈹戦鐐毄闁哥姴锕ら鍏煎緞鐎ｎ亙绨甸梻浣虹帛椤洨鍒掗鐐村亗婵炲棙鍔戞禍婊堟煙閹规劖纭鹃柡瀣捣缁辨帒螖娴ｅ憡璇為梺鍝勬湰閻╊垰顕ｉ鈧崺鈧い鎺戝€搁崹婵堚偓骞垮劚濞诧箑鐣烽崣澶岀闁瑰瓨鐟ラ悘鈺冣偓鐟版啞缁诲啴濡甸崟顖氱疀闁宠桨鑳舵导鍕箾鐎电ǹ甯堕柣妤€妫濋崺鐐哄箣閿旂粯鏅╃紒缁㈠弮閺€閬嶅极閹€鏀介柨娑樺娴犫晜淇婇銏狀伃闁诡噣绠栭幃婊呯驳鐎ｎ偅娅囬梻浣瑰濞插秹宕戦幘鍓佺＜闁逞屽墰閳ь剨缍嗛崑浣圭濠婂牊鐓欓梺顓ㄧ畱閺嬫盯鏌＄€ｎ亪顎楅棁澶嬬節婵犲倻澧㈤柣锝嗘そ閺岋紕浠﹂崜褎鍒涘銈冨灪濞茬喖寮幇鏉垮耿婵炲棙蓱琚ｇ紓鍌氬€烽懗鍫曞磻閹捐纾跨€规洖娲ㄧ粈濠傗攽閻樺弶鎼愰柦鍐枛閺屽秹濡烽敃鈧晶顖炴煕濮橆剦鍎旀鐐寸墱閸掓帡宕楁径濠佸闂佽偐鈷堥崜娑㈠春瀹ュ鈷掗柛灞剧懆閸忓矂寮搁鍛簻闁瑰瓨绻冮ˉ銏☆殽閻愭潙濮嶆鐐寸墬缁楃喐绻濋崟顓涙（濠电姷鏁告繛鈧繛浣冲浂鏁勯柛鈩冪☉绾惧綊姊洪崹顕呭剭濞存粍绮撻弻鐔煎传閸曨剦妫炴繛瀛樼矋閸庢娊鈥旈崘顔嘉ч柛娑橆嚟瀹曨亪姊洪悷鏉挎闁瑰嚖鎷� */
    can_mailbox_config(CAN2, mailbox_index, &can2transmit_message);
    
    return SUCCESS;
}
ErrStatus can2_tx_auto(uint8_t length, uint32_t id, uint8_t *can2txdata)
{
    /* 闂傚倸鍊搁崐鎼佸磹閹间礁纾归柟闂寸绾惧綊鏌熼梻瀵割槮缁炬儳缍婇弻鐔兼⒒鐎靛壊妲紒鐐劤濠€閬嶅焵椤掑倹鍤€閻庢凹鍙冨畷宕囧鐎ｃ劋姹楅梺鍦劋閸ㄥ綊宕愰悙鐑樺仭婵犲﹤鍠氬Ο鈧悗娈垮枟閹倸顕ｆ禒瀣垫晣闁绘柨鎼獮鎰版⒒娴ｈ鍋犻柛搴灦瀹曟洟鏌嗗鍡椻偓鍫曟煃閸濆嫬鏆熺痪鎯с偢閺岀喖鏌囬敃鈧鐐箾閸喓鐭掗柡灞糕偓宕囨殕闁逞屽墴瀹曚即寮介鐐电暫閻熸粍鏌ㄩ悾閿嬬附閸涘﹤浜滈梺鍛婄箓鐎氼剙鈻撻妷鈺傗拻闁稿本鐟чˇ锕傛煙鐠囇呯瘈鐎规洖婀遍幉鎾礋椤掆偓瀵潡姊洪崷顓℃闁哥姵鐗犻幃鈥愁潨閳ь剟寮婚悢鍛婄秶濡わ絽鍟宥夋⒑缁嬫鍎愰柛鏃€鐟╅獮鍐ㄎ旈崨顓熷祶濡炪倖鎸鹃崐顐﹀鎺虫禍婊堟煏婢舵稑顩紒鐘愁焽缁辨帗娼忛妸锕€闉嶉梺鐟板槻閹虫ê鐣烽锕€绀嬬痪鐗埫禍鍓р偓鍏夊亾闁告洦鍓涢崢閬嶆⒑闂堟胆褰掑磿閹惰棄鏄ラ柨婵嗘礌閸嬫挸鈻撻崹顔界亪濡炪値鍘鹃崗妯侯嚕椤愶箑绠涙い鎾跺仧缁愮偞绻濋悽闈浶㈤悗姘卞厴瀹曘儵宕ㄧ€涙ǚ鎷绘繛杈剧悼閹虫捇顢氬⿰鍛＜閻犲洦褰冮埀顒€娼￠悰顔藉緞婵炵偓顫嶉梺闈涚箳婵兘顢欓幒鏃傜＝闁稿本鐟ч崝宥嗐亜椤撶偞鍠樼€规洏鍨介獮鏍ㄦ媴閸忓瀚奸梻浣告啞缁嬫垿鏁冮敐鍥偨闂侇剙绉甸悡鏇㈡煟濡澧繛鍫熺矌閳ь剝顫夊ú姗€宕濆▎鎾跺祦闁搞儺鍓氶崑瀣煕椤愮姴鐏╂鐐村姍閺岋絾鎯旈垾鍐茶緟闂佺ǹ顑嗛幑鍥箖濡ゅ懏鏅查幖绮光偓鎰佹骄闂備椒绱粻鎴︽偋閹捐绠栨俊銈呭暞閸犲棝鏌涢弴銊ュ妞わ负鍔戦弻锝夊閳轰胶浠柣銏╁灣閸犳牠骞冨鈧獮鎺懳旀担鍝勫箺闂備胶绮崝鏇㈩敋椤撱垹鐓濋柟鍓х帛閻撳啰鎲稿⿰鍫濈婵炲棙鎸搁崒銊╂煛瀹ュ啫濡块柣婵嗙埣閺岋繝宕堕妷銉т痪闂佹娊鏀遍崹鍧楀蓟濞戞ǚ鏀介柛鈩冾殢娴尖偓闂備礁鐤囬褔藝閻㈢ǹ钃熸繛鎴炲焹閸嬫捇鏁嶉崡鐐叉殨濠㈣娲熷濠氬磼濞嗘帒鍘￠柡瀣典簼閵囧嫰骞嬪┑鍥舵＆濡ょ姷鍋為崝娆撶嵁閺嶃劎鐟瑰┑鐘插閳笺倖绻濋悽闈涒枅婵炰匠鍥舵晞闁圭増婢橀弸渚€鏌涢埄鍐姇闁绘挻娲熼幃姗€鎮欓幓鎺嗘寖闂佽桨鐒﹂悧鐘诲蓟閺囩喓绠鹃柣鎰靛墯閻濇洟姊洪幎鑺ユ暠闁搞劌娼″璇测槈濡攱鏂€闂佺硶鍓濋〃蹇斿閸屾凹娓婚柕鍫濋娴滃墽绱掗悩铏磳鐎殿喛顕ч埥澶愬閻樼數娼夐梻渚€鈧偛鑻晶瀵糕偓瑙勬礀缂嶅﹤鐣风粙璇炬棃宕橀妸褋鍋婇梻鍌欑閹诧繝宕濋敃鍌氱獥闁哄稁鍙忕紞鏍煕濞戞鎽犻柣鎾崇箻閺屾盯顢曢敐鍥╃暫闂侀潻绲藉﹢杈╂閹烘绠涙い鎾跺Л婵洨绱撴担铏瑰笡缂佽鐗撻獮鍐╃鐎ｎ偒妫冨┑鐐殿棎缂堜即宕规禒瀣畺婵°倐鍋撴い顐ｇ箞濮婅崵鈧潧鎲￠弲鍏肩節绾版ǚ鍋撻崘鑼獓闂佸憡姊归悷銉╊敋閿濆绠绘い鏃傗拡濞煎﹪姊洪幎鑺ユ殰闁稿鎹囬弻鐔割槹鎼达絽绗＄紓浣虹帛缁嬫帒顭囪箛娑樼鐟滃秹宕哄畝鍕拺缁绢厼鎳庤缂備緡鍠栧ù鐑藉礆閹烘绫嶉柛顐ゅ枎閳ь剛绮穱濠囶敍閻愬瓨鐝崇紓浣靛妼椤嘲顫忓ú顏咁棃婵炴垼椴搁鍡涙⒒閸屾艾顏╅悗姘煎墴閹儳鐣￠幍顔芥畷闂侀€炲苯澧撮柛鈹惧亾濡炪倖甯掗崰姘焽閹邦厾绠鹃柛娆忣檧閼板潡鏌曢崱妤€鏆ｇ€规洏鍔嶅蹇涘礈瑜忛埣銈嗙節閻㈤潧孝闁挎洏鍊濋幃褔宕卞☉娆忊偓鍧楁煕椤垵浜栧ù婊勭矒閺岀喖宕崟顒夋婵炲瓨绮嶉崕鎶解€旈崘顔嘉ч柛鈩冾焽閳规稓绱撻崒姘毙＄紒鑸靛哺婵″瓨绗熼埀顒€顕ｉ幘顔碱潊闁斥晛鍟悵鏍⒒娓氣偓閳ь剛鍋涢懟顖涙櫠閹殿喚纾兼い鏂垮⒔鐢稓绱掔紒妯肩畵妞ゎ偅绻堥、姗€鎮欓弶鍨嚙闂傚倸鍊烽悞锕傚箖閸洖纾挎繝濠傜墕缁€鍐┿亜韫囨挾澧㈢€规洘绮岄埞鎴︽晬閸曨偂鏉梺绋匡攻閸ㄥ灝鐣烽弴銏″殤妞ゆ帊绀佹惔濠囨⒑閸撴彃浜濈紒璇茬Т椤洭寮介妸褏顔曢悗鐟板閸犳洜鑺遍崗绗轰簻闁靛鍎虫晶娑氱磼缂佹娲存鐐差儔閹瑧鎹勬笟顖涱棨濠碉紕鍋戦崐褏寰婃禒瀣妞ゆ劧绠戦悡姗€鏌熸潏鍓х暠闁绘搫绻濋弻娑㈠焺閸愶缚娌紓浣靛妿閸樠団€旈崘顔嘉ч柛鎰╁妼椤牓姊洪幐搴㈠濞存粠浜濇穱濠勨偓娑欘焽閻熷綊鏌嶈閸撴瑩顢氶敐澶樻晪闁逞屽墮閻ｇ兘鎮℃惔妯绘杸闁诲函缍嗘禍婵嬪汲椤忓牊鈷掗柛灞剧懅椤︼箓鏌熺喊鍗炰簻閻撱倝鏌曟繛鐐珔闁汇値鍣ｉ弻娑滎槼妞ゃ劌鎳愮划濠氼敍濞戞氨顔曢悗鐟板閸犳洜鑺辨總鍛婄厽闁规崘娉涢弸娑㈡煛瀹€瀣埌閾伙綁鏌涘┑鍡楊仼缂佹鍙冨娲偂鎼粹槅妫屾繛瀛樼矤娴滎亜顕ｇ拠娴嬫闁靛繒濮甸ˉ婵嬫煟閻樺厖鑸柛鏂块叄瀹曟繈顢涢悙鏉戔偓鍨箾閸繄浠㈤柡瀣枛閺岀喖顢欓悡搴樺亾閸ф鍋樻い鏃堟暜閸嬫捇鏁愭惔鈩冪亶闂佸搫鎳忕划鎾诲蓟閿濆鏅查柛娑欐緲椤忣厼螖閻橀潧浠﹂柛鏃€鐟ラ～蹇涙惞鐟欏嫬鐝伴梺鍦帛鐢帒袙閹邦喚纾介柛灞炬皑瀛濆┑鈽嗗亝閻熝呭垝鐎ｎ亶鍚嬪璺猴躬閸炲爼姊洪崫鍕窛闁哥姴瀛╃粋宥呂旈崨顔规嫼缂備礁顑堝▔鏇犵不閹惰姤鐓冪€瑰嫭澹嗘晶鏇㈡煃缂佹ɑ灏扮紒鍌涘笧閳ь剨缍嗛崑鍡涘储娴犲鈷戠憸鐗堝笒娴滀即鏌涢妸銈呭祮闁诡垰鍟撮幖褰掑捶椤撶媴绱查梻浣虹帛閿氭俊顖氾躬閹剝绺介崨濠勫幐閻庡厜鍋撻柍褜鍓熷畷浼村冀椤撴壕鍋撴担绯曟瀻闁圭偓娼欐禒濂告倵閸忓浜鹃梺閫炲苯澧撮柟顔瑰墲瀵板嫰骞囬娑欏闂備浇宕甸崰鎰珶閸℃稒鏅€广儱顦伴悡鏇㈡倵閿濆啫濡奸柍褜鍓氶悧妤冪矚鏉堛劎绡€闁搞儯鍔岄埀顒€顭烽弻銈夊箒閹烘垵濮曞┑鐐叉噹濡稓妲愰幘瀛樺闁革富鍘稿Σ鍫濐渻閵堝棗鐏ラ悗姘嵆閻涱喚鈧綆鍠楅崐濠氭煠閹帒鍔楅柟宄邦煼濮婅櫣绮欓幐搴㈡嫳闂佺厧缍婄粻鏍春閳ь剚銇勯幒宥囧妽闁稿﹥鍔楅埀顒冾潐濞叉﹢宕濆▎鎾跺祦闁哄秲鍔嶆刊鎾煕濠靛嫬鍔电紒槌栧櫍濮婄粯鎷呴崫銉ㄥ┑鈽嗗亯濞夋洜鍒掗崼鐔虹懝闁逞屽墴楠炲啴宕稿Δ濠冩櫔闂侀€炲苯澧寸€殿喛顕ч埥澶愬閻樼數鏉告俊鐐€栭幐鐐叏娴兼潙纾婚柣鎰劋閳锋垿鏌涘┑鍡楊伌闁稿孩鍔欓弻锝呂旀笟鍥ㄧ暭闂佺懓绠嶉崹褰掑煡婢舵劕顫呴柣妯活問閸氬懏绻濋悽闈涗粶婵☆偅顨堥幑銏ゅ箳閹鹃娴勬繝闈涘€搁幉锟犲煕閹达附鐓曟繝闈涙椤忊晜銇勮箛瀣姦闁哄本绋掗幆鏃堟晲閸℃ɑ鐦撻柣搴㈩問閸犳牠鈥﹂柨瀣╃箚闁归棿绀侀悡娑㈡煕鐏炲墽鐓紒銊ヮ煼濮婄粯鎷呴崨濠傛殘缂備浇顕ч崐濠氬焵椤掍焦鐨戦柛蹇旓耿瀹曟椽鍩€椤掍降浜滈柟鍝勬娴滈箖姊哄ú璇插箹闁稿﹤鐏濋锝嗙節濮橆剛鍔撮梺鍛婂姀閺呮盯顢撻幘缁樷拺闁告稑锕﹂埥澶嬵殰椤忓懏缍戦摶鐐烘煟閹邦喖鍔嬮柍閿嬪灴閹宕烽鐑嗏偓灞剧箾閸忕厧濮嶉柡灞剧洴婵℃悂濡烽敃鈧禒鏉懳旈悩闈涗粶闁哥喐鎸冲畷娲晸閻樻彃绐涘銈嗘尵婵參宕禒瀣拻濞达絽鎲＄拹锟犳煕鎼存稑鈧繈鐛幇顓犵瘈婵ê鍚嬮弲鈺呮⒑閸涘﹥澶勯柛蹇旂〒閹广垽宕卞☉娆戝幗闂佽婢橀崥鈧紒銊ヮ煼閺屽秷顧侀柛鎾磋壘鐓ゆ繝濠傜墕缁犳煡鏌曡箛瀣偓鏇犵不濞戙垺鐓熸俊銈傚亾闁绘妫欑粋宥夘敍閻愮补鎷虹紓鍌欑劍钃遍悘蹇ｅ弮閹宕归銏㈢懆濡炪値鍘煎ú顓烆嚕娴犲鏁囬柣鏂挎惈瀵即姊绘繝搴′簻婵炶绠撳畷娆撴偡闁妇鍔烽梺褰掑亰閸犳帡宕戦幘鑸靛枂闁告洦鍓涢ˇ銉ヮ渻閵堝繐顩柡浣筋嚙椤曪絾绻濆顒€宓嗛梺缁樻濞咃綁顢欓弴銏♀拺闁告捁灏欓崢娑㈡煕閻樺磭澧柟渚垮姂瀵挳濮€閳锯偓閹锋椽鏌ｉ悩鍙夌┛閻忓繑鐟х划濠氭晲閸モ晝锛滈梺濂告櫜缁茬粯绔熷Ο姹囦簻妞ゆ劑鍨荤粻濠氭煙閻撳海绉虹€规洜鍏橀、姗€鎮崨顖氱哎婵犵數濮烽。钘壩ｉ崨鏉戝瀭濞寸厧鐡ㄩ崕宥団偓鐟板鐎氬牆鈽夐姀鐘栤晠鏌嶉崫鍕偓鐢稿箯閾忓湱纾藉ù锝呭閸庡繘鎮樿箛鎾村殗鐎殿喓鍔戦幊锟犲Χ閸モ晪绱查梺鑽ゅТ濞测晝浜稿▎鎰珷闁哄洢鍨洪悡鐔兼煥濠靛棙鍣规俊鎻掝煼閹繝濡堕崱鎰盎闂婎偄娲﹂幐鎼佹偟鐎ｎ喗鐓忓┑鐐靛亾濞呭棝鏌ｉ幘鍐叉殻鐎殿喖鐖奸幃娆撳级閹搭厽顥嬫俊鐐€х拋锝嗕繆閸モ晜顫曢柟鐑橆殔缁犳稒銇勯幘璺盒涙俊鎻掔墕椤啴濡舵惔婵堢泿闂佸摜鍠庨悺銊︾┍婵犲洤閱囬柡鍥╁仜閼板灝鈹戦埥鍡楃仸闁衡偓鏉堚斁鍋撳顐ょ煓婵﹦绮幏鍛矙閹稿孩鐦ｉ梻浣规偠閸ㄦ椽鎮￠敓鐘茬畺鐟滃海鎹㈠┑瀣闁靛ǹ鍎版竟鏇㈡⒒閸屾氨澧涚紒瀣箻瀹曟垿濮€閳藉棙顔旈梺缁樺姈閹矂鎮為悾宀€纾奸弶鍫涘妼缁楁帡鎽堕敐澶嬧拺闁割煈鍣崕蹇斻亜韫囨洖鍔嬬紒缁樼箞閹粙妫冨☉妤€鎽嬮梻浣筋潐濡炴寧绂嶉悙鍨潟闁绘劕鎼悞鍨亜閹哄棗浜鹃梺瀹狀潐閸ㄥ潡銆佸▎鎾充紶闁告洏鍔屾禍鐐繆閵堝倸浜鹃梺瀹犳椤︾敻骞冮悾宀€鐭欓柛褎顨呴弫褰掓⒒娴ｅ憡鎯堟繛灞傚姂瀹曚即骞樼拠鎻掑亶闂備緡鍓欑粔鐢稿煕閹寸姷纾藉ù锝呭帨濡劍銇勮箛鎾跺闁汇値鍣ｉ弻鐔虹矙閸噮鍔夐梺鍛婄懃缁绘帡鍩€椤掆偓缁犲秹宕曢崡鐏绘椽鎮╃拠鑼紱闂佸湱鍋撻弸濂稿几閺冨牊鐓曟い顓熷灥閺嬬喖鏌ｈ箛鎾跺ⅵ婵﹨娅ｅ☉鐢稿椽娴ｅ憡鐤傜紓鍌欐祰妞寸ǹ煤閻旇偐宓侀柟杈剧畱椤懘鏌ｅ鍡椾簼闁哄倵鍋撻梻鍌欒兌绾泛顬婅瀵彃饪伴崼婵堬紳闂傚倸鐗婃笟妤€銆掓繝姘厪闁割偅绻冮ˉ婊呯磼濡や礁娴柡灞剧〒閳ь剨缍嗘禍婵嬎夐姀鈶╁亾鐟欏嫭澶勯柛鎾跺枛楠炲啯绂掔€ｎ亜绐涙繝鐢靛仧閸嬫挾鈧俺妫勯埞鎴︽倷閼搁潧娑х紓浣藉紦缁瑩鐛弽顓ф晝闁挎繂娴傚ú鍛婁繆閵堝繒鍒伴柛鐕佸灦閹繝鎮╅崹顐㈡瀾闂佺粯顨呴悧鍡欑箔瑜旈弻锝夋晲閸噥浠╅梺閫炲苯澧叉い顐㈩槸鐓ゆ慨妞诲亾鐎规洘绻堝浠嬵敃閿濆懎绨ユ繝鐢靛█濞佳兾涢鐑嗙劷闁冲搫鎳忛悡鏇㈢叓閸ャ劍灏柟顔藉灦缁绘盯宕ㄩ鐕佹＆濠殿喖锕ら…宄扮暦閹烘垟鏋庨柟杈剧悼閻涖儵姊绘担鍛婂暈闁圭ǹ顭烽幃鐤槾闁告帗甯″顕€宕奸悢铚傜紦缂傚倷绀侀鍫濃枖閺囥垹鍌ㄩ梺顒€绉甸埛鎴犵棯椤撶偞鍣虹憸鎶婂洦鈷掗柛鏇ㄥ亜椤忣厾鈧娲橀崹鍧楀极閹邦厼绶為悗锝庡墮楠炲秵淇婇悙顏勨偓鏍箰妤ｅ啫绐楅幖杈剧悼缁犳棃鏌熼悜妯虹亶闁衡偓娴犲鐓冮柕澹啩缂撻梺绋款儍閸ㄤ粙寮婚垾宕囨殕閻庯綆鍓涢敍鐔兼⒑闁偛鑻晶鍓х磽瀹ュ懏顥㈢€规洘鍨垮畷鐔碱敍濞戞ǚ鍋撻崼鏇熺厵缂備降鍨归弸鐔兼煟閹惧銆掗柍褜鍓欓崢婊堝磻閹剧粯鍊甸柨婵嗛婢т即鏌ㄥ☉姘灈婵﹥妞介弻鍛存倷閼艰泛顏繝鈷€鍐ㄢ挃缂佽鲸鎸搁濂稿川椤曞懏锛佺紓鍌欑閸婂摜绮旈悷鎵殾濠靛倻枪閸楁娊鏌ｉ弮鍥ㄨ吂缂併劎鏁诲缁樻媴閸涢潧婀遍幑銏ゅ箳濡も偓閻撴洟鏌涢锝囧闁哄鏌ㄩ湁闁绘ê妯婇崕鎰版煟閹捐泛鏋涢柡宀€鍠栭弻鍥晝閳ь剟鎮橀悩缁樼厽闁靛ǹ鍔嶉鐘电磼鏉堛劌娴柟顔规櫅椤斿繘顢欓幆褎鍊梻鍌欑閹碱偊鎯夋總绋跨獥闁哄稁鍘归埀顑跨閳诲酣骞橀弶鎴滄偅闁诲骸鍘滈崑鎾绘煃瑜滈崜鐔煎箖閳╁啫绶為柟閭﹀幐閹锋椽姊洪懡銈呮瀾濠㈢懓妫濋弫宥咁吋婢跺鍘遍柣搴祷閸斿矂鍩€椤掍胶澧紒宀冮哺缁绘繈宕堕妸銉㈠亾婵犳碍鐓犻柟顓熷笒閸旀粍绻涢崨顓燁棤缂佽鲸鎸婚幏鍛村捶椤撴稒顫嶆俊鐐€栭崹鐢碘偓姘嵆閻涱喚鈧綆鍠楅崐濠氭煠閹帒鍔楅柟宄邦煼濮婅櫣绮欓幐搴㈡嫳闂佺厧缍婄粻鏍春閳ь剚銇勯幒鎴濐伌婵☆偅鍨圭槐鎺楊敊閼测晛顤€缂備焦顨堥崰鏍春閳ь剚銇勯幒鎴濐伀鐎规挷绶氶弻鈥愁吋鎼粹€冲闂佽桨绀侀崯鎾蓟閵娾晛鍗虫俊銈傚亾濞存粌澧界槐鎺楁倷椤掆偓閸斻倗绱撳鍜冭含鐎殿喛顕ч埥澶愬閳哄倹娅囬梻浣瑰缁诲倸螞濞戔懞鍥Ψ瑜忕壕濂告煟閹伴潧澧柛鏂诲€楃槐鎾愁吋閸滃啳鍚悗娈垮枛椤兘宕规ィ鍐ㄧ疀濞达絽鎲￠崐顖炴⒑绾懎浜归悶娑栧劦閸┾偓妞ゆ帒鍟惃娲煟閺嶎厺鎲炬慨濠勭帛閹峰懘宕ㄩ棃娑氱Ш妞ゃ垺鐗犲畷鍗炩槈濡⒈鍞堕梻浣哥秺濡法娆㈤妶鍥╃闁哄秲鍔庣弧鈧梻鍌氱墛娓氭宕曞☉銏＄厸濞达絽鎲￠ˉ銏ゆ煛鐏炲墽銆掑ù鐙呯畵瀹曟粏顦抽柡鍛偢濮婃椽妫冨ù銉ョ墦瀵彃饪伴崼婵堝幈闂佺鎻梽鍕偂閺囩喓绡€闂傚牊绋掗ˉ婊勩亜韫囷絽澧柕鍥у椤㈡洟顢楅崒婊勬闂備礁鎼張顒勬儎椤栨凹鍤曟い鏇楀亾闁糕斁鍋撳銈嗗笒鐎氼剟宕归崒鐐寸厱鐟滃酣銆冮崼婵堟殼濞撴埃鍋撻柡灞剧洴楠炲洭妫冨☉娆戜邯婵＄偑鍊ら崑鍕箠濮椻偓瀵寮撮姀鐘诲敹濠电娀娼уù鍌毼涢敓鐘斥拺缂佸鐏濋惁銊ッ瑰⿰搴濈盎妞ゎ偄绻愮叅妞ゅ繐鎳庡▓銉╂⒑闂堟稓澧曢柟鍐茬箻閹骞嗚閺€浠嬫煟濮楀棗鏋涢柣蹇ｄ簼閵囧嫰顢橀悙瀛樻倷濡炪倖娲忛崕鑼崲濠靛鐐婇柕濞垮劜閻ｄ即姊绘担绋挎毐闁圭⒈鍋婂畷顖涘鐎涙ɑ娅栧┑鐘绘涧濞层劎绮绘ィ鍐ㄧ骇闁割偅绻傞埛鏃堟煕閹哄秴宓嗛柡宀€鍠撻崰濠囧础閻愭壆鍑圭紓鍌欑閸婂摜绮旇ぐ鎺戠畺婵炲棙鎼╅弫鍡涙煕鐏炲墽鐭屾俊鎻掓喘濮婄粯绗熼埀顒€顭囪閹广垽宕卞顫秮瀹曠喖顢涘☉妯荤暚闂備胶顫嬮崟鍨暦闁诲海鏁告慨鐢垫崲濠靛顥堟繛鎴濆船閸撻亶姊虹紒妯诲鞍闁荤噦濡囬幑銏犫槈閵忕娀鍞跺┑鐘绘涧閻楀懘鎼规惔銊︹拺闁告繂瀚烽崕鎰版煙閻熺増鍠樼€殿喛顕ч埥澶婎潩閿濆懍澹曢梺鎸庣箓妤犲憡绂嶅┑瀣€堕煫鍥风到楠炴鏌曢崶褍顏い銏℃礋閺佹劙宕堕埡鍐╂緰闂傚倷娴囬鏍窗濡ゅ懏鍋￠柍鍝勬噷閳ь兛绀佽灃闁告侗鍘鹃崝锕€顪冮妶鍡楃瑨閻庢氨鍏樺顐﹀磼閻愬鍙嗛梺缁樻礀閸婂湱鈧熬鎷� */
    for(uint8_t i = 0; i < 3; i++) {
        uint32_t mailbox_index = can2_tx_manager.mailboxes[i];
        uint32_t mailbox_code = can_mailbox_code_get(CAN2, mailbox_index);
        
