kyckyckyc/DGM/src/gd32g5x3_init.c
        if(mailbox_code == CAN_MB_TX_STATUS_INACTIVE) {
            if(can2_tx_with_mailbox(length, id, can2txdata, mailbox_index) == SUCCESS) {
                can2_tx_manager.sent_count[i]++;
                return SUCCESS;
            }
        }
    }
    
    return ERROR; /* 闂傚倸鍊搁崐鎼佸磹閹间礁纾归柟闂寸绾惧綊鏌熼梻瀵割槮缁炬儳缍婇弻鐔兼⒒鐎靛壊妲紒鐐劤濠€閬嶅焵椤掑倹鍤€閻庢凹鍙冨畷宕囧鐎ｃ劋姹楅梺鍦劋閸ㄥ綊宕愰悙鐑樺仭婵犲﹤鍠氬Ο鈧悗娈垮枟閹倸顕ｆ禒瀣垫晣闁绘柨鎼獮鎰版⒒娴ｈ鍋犻柛搴灦瀹曟洟鏌嗗鍡椻偓鍫曟煃閸濆嫬鏆熺痪鎯с偢閺岀喖鏌囬敃鈧鐐箾閸喓鐭掗柡灞糕偓宕囨殕闁逞屽墴瀹曚即寮介鐐电暫閻熸粍鏌ㄩ悾閿嬬附閸涘﹤浜滈梺鍛婄箓鐎氼剙鈻撻妷鈺傗拻闁稿本鐟чˇ锕傛煙鐠囇呯瘈鐎规洖婀遍幉鎾礋椤掆偓瀵潡姊洪崷顓℃闁哥姵鐗犻幃鈥愁潨閳ь剟寮婚悢鍛婄秶濡わ絽鍟宥夋⒑缁嬫鍎愰柛鏃€鐟╅獮鍐ㄎ旈崨顓熷祶濡炪倖鎸鹃崐顐﹀鎺虫禍婊堟煏婢舵稑顩紒鐘愁焽缁辨帗娼忛妸锕€闉嶉梺鐟板槻閹虫ê鐣烽锕€绀嬬痪鐗埫禍鍓р偓鍏夊亾闁告洦鍓涢崢閬嶆⒑闂堟胆褰掑磿閹惰棄鏄ラ柨婵嗘礌閸嬫挸鈻撻崹顔界亪濡炪値鍘鹃崗妯侯嚕椤愶箑绠涙い鎾跺仧缁愮偞绻濋悽闈浶㈤悗姘卞厴瀹曘儵宕ㄧ€涙ǚ鎷绘繛杈剧悼閹虫捇顢氬⿰鍛＜閻犲洦褰冮埀顒€娼￠悰顔藉緞婵炵偓顫嶉梺闈涚箳婵兘顢欓幒鏃傜＝闁稿本鐟ч崝宥嗐亜椤撶偞鍠樼€规洏鍨介獮鏍ㄦ媴閸忓瀚奸梻浣告啞缁嬫垿鏁冮敐鍥偨闂侇剙绉甸悡鏇㈡煟濡澧繛鍫熺矌閳ь剝顫夊ú姗€宕濆▎鎾跺祦闁搞儺鍓氶崑瀣煕椤愮姴鐏╂鐐村姍閺岋絾鎯旈垾鍐茶緟闂佺ǹ顑嗛幑鍥箖濡ゅ懏鏅查幖绮光偓鎰佹骄闂備椒绱粻鎴︽偋閹捐绠栨俊銈呭暞閸犲棝鏌涢弴銊ュ妞わ负鍔戦弻锝夊閳轰胶浠柣銏╁灣閸犳牠骞冨鈧獮鎺懳旀担鍝勫箺闂備胶绮崝鏇㈩敋椤撱垹鐓濋柟鍓х帛閻撳啰鎲稿⿰鍫濈婵炲棙鎸搁崒銊╂煛瀹ュ啫濡块柣婵嗙埣閺岋繝宕堕妷銉т痪闂佹娊鏀遍崹鍧楀蓟濞戞ǚ鏀介柛鈩冾殢娴尖偓闂備礁鐤囬褔藝閻㈢ǹ钃熸繛鎴炲焹閸嬫捇鏁嶉崡鐐叉殨濠㈣娲熷濠氬磼濞嗘帒鍘￠柡瀣典簼閵囧嫰骞嬪┑鍥舵＆濡ょ姷鍋為崝娆撶嵁閺嶃劎鐟瑰┑鐘插閳笺倖绻濋悽闈涒枅婵炰匠鍥舵晞闁圭増婢橀弸渚€鏌涢埄鍐姇闁绘挻娲熼幃姗€鎮欓幓鎺嗘寖闂佽桨鐒﹂悧鐘诲蓟閺囩喓绠鹃柣鎰靛墯閻濇洟姊洪幎鑺ユ暠闁搞劌娼″璇测槈濡攱鏂€闂佺硶鍓濋〃蹇斿閸屾凹娓婚柕鍫濋娴滃墽绱掗悩铏磳鐎殿喛顕ч埥澶愬閻樼數娼夐梻渚€鈧偛鑻晶瀵糕偓瑙勬礀缂嶅﹤鐣风粙璇炬棃宕橀妸褋鍋婇梻鍌欑閹诧繝宕濋敃鍌氱獥闁哄稁鍙忕紞鏍煕濞戞鎽犻柣鎾崇箻閺屾盯顢曢敐鍥╃暫闂侀潻绲藉﹢杈╂閹烘绠涙い鎾跺Л婵洨绱撴担铏瑰笡缂佽鐗撻獮鍐╃鐎ｎ偒妫冨┑鐐殿棎缂堜即宕规禒瀣畺婵°倐鍋撴い顐ｇ箞濮婅崵鈧潧鎲￠弲鍏肩節绾版ǚ鍋撻崘鑼獓闂佸憡姊归悷銉╊敋閿濆绠绘い鏃傗拡濞煎﹪姊洪幎鑺ユ殰闁稿鎹囬弻鐔割槹鎼达絽绗＄紓浣虹帛缁嬫帒顭囪箛娑樼鐟滃秹宕哄畝鍕拺缁绢厼鎳庤缂備緡鍠栧ù鐑藉礆閹烘绫嶉柛顐ゅ枎閳ь剛绮穱濠囶敍閻愬瓨鐝崇紓浣靛妼椤嘲顫忓ú顏咁棃婵炴垼椴搁鍡涙⒒閸屾艾顏╅悗姘煎墴閹儳鐣￠幍顔芥畷闂侀€炲苯澧撮柛鈹惧亾濡炪倖甯掗崰姘焽閹邦厾绠鹃柛娆忣檧閼板潡鏌曢崱妤€鏆ｇ€规洏鍔嶅蹇涘礈瑜忛埣銈嗙節閻㈤潧孝闁挎洏鍊濋幃褔宕卞☉娆忊偓鍧楁煕椤垵浜栧ù婊勭矒閺岀喖宕崟顒夋婵炲瓨绮嶉崕鎶解€旈崘顔嘉ч柛鈩冾焽閳规稓绱撻崒姘毙＄紒鑸靛哺婵″瓨绗熼埀顒€顕ｉ幘顔碱潊闁斥晛鍟悵鏍⒒娓氣偓閳ь剛鍋涢懟顖涙櫠閹殿喚纾兼い鏂垮⒔鐢稓绱掔紒妯肩畵妞ゎ偅绻堥、姗€鎮欓弶鍨嚙闂傚倸鍊烽悞锕傚箖閸洖纾块柣鎴烆焽椤╁弶绻濇繝鍌滃闁稿骸绉归弻锝夊箣閻愬啯绮嶇粋宥呪堪閸喓鍘甸梺璇″瀻閸涱喗鍠栭梻渚€娼уú锔炬崲閸愵喖绠為柕濠忓缁♀偓闂佸憡鍔忛弬鍌涚閵忋倖鍊甸悷娆忓缁€鍫ユ煕韫囨棑鑰块柕鍡曠椤粓鍩€椤掑嫬绠栨繛鍡樻尭缁犵敻鏌熼悜妯肩畼闁逞屽墮瀹曨剟鍩為幋锔芥櫖闁告洦鍋傞弶顓㈡⒑缁嬪尅鏀婚柛銊ョ仢閻ｅ嘲鈹戦崱娆愭畷闂佸憡娲﹂崑鍡涙偪閸パ€鏀介柍钘夋閻忋儲绻涢崪鍐М鐎殿喗濞婇弫鍐磼濞戞艾甯鹃梻濠庡亜濞层倝顢栭崨鏉戠劦妞ゆ帊鐒︾粈鍫㈢磼椤斿灝鍚圭紒杈ㄥ笒铻ｉ梻鈧幇顔炬晨闂傚倷绀侀幖顐﹀疮閻樿纾婚柟鍓х帛閻撴洟骞栨潏鍓х？闁哄鍟撮弻鏇㈠炊閵娿儱顫掗悗瑙勬礈閸犳牠銆佸☉妯锋闁圭儤鎸搁褰掓⒒閸屾瑨鍏屾い銏狅躬瀹曟垿骞囬弶璺紱濠电偞鍨崹鍦矆婢跺鍙忔俊鐐额嚙娴滈箖姊洪崫鍕拱闁烩晩鍨伴锝夘敆閸曨偊鏁滃┑掳鍊愰崑鎾垛偓娈垮枟濠㈡ǹ鐏冮梺缁橈耿濞佳勭濠婂牊鐓ラ柡鍥ュ妺缁ㄥ鏌ｉ敐鍥у幋濠碘剝鎮傞崺鈩冪節閸愨晜鐝﹂梻浣告惈椤﹂亶宕戦悙瀵哥彾闁糕剝绋掗崕搴ㄥ箹濞ｎ剙濡介柍閿嬪笒闇夐柨婵嗘处閸も偓濡炪倖娲樼划搴ｆ閹烘梹瀚氶柟缁樺坊閸嬫挻绻濆顒傤唹闂侀潧绻堥崐鏇犵不閿濆鐓熸慨妤€妫楁禍婊兠瑰⿰鍛壕闁逛究鍔岃灒闁绘挸绨兼竟鏇㈡煟鎼淬垻鍟查柟鍑ゆ嫹 */
}
void can2_txMessage(uint8_t length,uint8_t id,uint8_t *can2txdata)
{
    for(int i = 0; i < length; i++){
        can2transmit_message.data[i] = can2txdata[i];
    }
    can2transmit_message.rtr = 0U;
    can2transmit_message.ide = 0U;
    can2transmit_message.code = CAN_MB_TX_STATUS_DATA;
    can2transmit_message.brs = 0U;
    can2transmit_message.fdf = 0U;
    can2transmit_message.esi = 0U;
    can2transmit_message.prio = 0U;
    can2transmit_message.data_bytes = length;
    can2transmit_message.id = id;

    can_mailbox_config(CAN2, 3u, &can2transmit_message);
}

